{"Titles":{"1":"Valiant Hearts: Coming Home","2":"Roller Drama","3":"Devolver Tumble Time","4":"Pocket Card Jockey: Ride On!","5":"Madness\/Endless","6":"Omega 13","7":"Teenage Mutant Ninja Turtles: Shredder's Revenge","8":"Boxville","9":"Wavecade","10":"Ninja Must Die","11":"Afterplace","12":"Vampire Survivors","13":"Scriptic Netflix Edition","14":"Dead Cells+","15":"Reigns: Three Kingdoms","16":"Finding Paradise","17":"Old Man's Journey+","18":"OPUS: Echo of Starsong","19":"CarX Street","20":"Wreckfest","21":"Evidence 111","22":"Medieval II: Total War Kingdoms"},"Platform":{"1":"iOS","2":"iOS","3":"iOS","4":"iOS\n                                                                                     (Apple Arcade)","5":"iOS","6":"iOS","7":"iOS","8":"iOS","9":"iOS","10":"iOS","11":"iOS","12":"iOS","13":"iOS","14":"iOS\n                                                                                     (Apple Arcade)","15":"iOS","16":"iOS","17":"iOS\n                                                                                     (Apple Arcade)","18":"iOS","19":"iOS","20":"iOS","21":"iOS","22":"iOS"},"RatingMC":{"1":"76","2":"None","3":"None","4":"82","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"91","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None"},"UserRating":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None"},"Summary":{"1":"[A Netflix Exclusive] Set during World War I, Valiant Hearts: Coming Home is a dramatic narrative game that follows four characters in a story about friendship, survival, and sacrifice as they deal with the overwhelming impact of war.  The game depicts part of the story of the Harlem Hellfighters, the first African-American infantry unit to fight in World War I. Like its predecessor, the gameplay features a mix of exploration, puzzles, and action.\r\n\r\nWalt, the faithful canine companion from the first game, returns to help players solve puzzles.","2":"In Roller Drama, you (Joan) live with &amp; coach five kickass athletes: Anne, Portia, Lily, Cordelia, and Juliet. Together they form a top Roller Derby team, a full contact sport on quad skates!\n\nYour job is to act as a keeper of the team, managing both their personal and professional lives. Try to balance everyone's emotions as they navigate rivalries, friendships, and love.\n\nThe visual novel \/ sport management mashup game of your (anxiety-ridden?) DREAMS! Lead a team of Roller Derby athletes using strategy and real-time controls. Outside the ring you'll have to manage five big personalities as they grapple with friendship, heartbreak, and late capitalist society...","3":"Devolver Tumble Time is the future of physics-based puzzle gameplay, elegant monetization, and strategic brand integration. Choose characters from a packed roster of your favorite Devolver Digital games and rack up big points matching and clearing their impossibly adorable heads from the tumbler. Get hyped enough and unleash each character's special ability to clear huge chunks and earn powerups to create chaotic chain reactions.\n\nThen maybe watch some entertaining ads.\n\nEarn and unlock new characters, compete in daily challenges, and buy stuff. Buying stuff is so great. Don't forget to keep an eye out for new character drops from your favorite Devolver Digital games and maybe even from ones you've never heard of in your life.\n\nPlus delicious ads. Watch 'em up real good.","4":"Saddle up for this unique solitaire and horse-racing hybrid from Game Freak, creators of the Pokemon franchise! Pocket Card Jockey originally released to great acclaim on the Nintendo 3DS, and while the basic rules are the same, the racing segments have been reborn in glorious 3-D! Focus your mind and clear cards with subsequent numbers in quick succession. The more cards you clear, the better your horse's mood will be - which helps them charge energy during races!\r\n\r\nTake the beloved steeds you've grown on the racetrack and pair them up on the farm. The foal they produce will inherit their abilities and become your new partner on the racecourse! Breed generation after generation of racehorses in your quest to conquer all the biggest, most prestigious races in the world!","5":"","6":"You play as a mech pilot who survived the war. In order to find someone, you join the arena and fight to the championship. You will also meet a mysterious woman and uncover the truth about the eternal night of the planet.","7":"Teenage Mutant Ninja Turtles: Shredder's Revenge features groundbreaking gameplay rooted in timeless classic brawling mechanics, brought to you by the beat 'em up experts at Dotemu (Streets of Rage 4) and Tribute Games.\n\nBash your way through gorgeous pixel art environments and slay tons of hellacious enemies with your favorite Turtle, each with his own skills and moves - making each run unique! Choose a fighter, use radical combos to defeat your opponents and experience intense combats loaded with breathtaking action and outrageous ninja abilities.\n\nStay sharp as you face off against Shredder and his faithful Foot Clan alone, or grab your best buds and play with up to 6 players simultaneously!","8":"Boxville is a city of boxes populated with old cans. They live quiet and happy lives with their everyday routines and habits. But one day, unexplained earthquakes disturbed their idyll...\n\nBlue Can (our hero) lost his best friend because of that. He started his search but it is not so easy to move through the city after earthquakes. He has to find a way to move forward, return the friend back home and discover the real reason for all those earthquakes. \n\nThere are many adventures, new friends and it's not only friends that are waiting for him on the way. He has to be curious, inventive, careful, and to help others, to reach his goal.","9":"WAVECADE is a sci-fi arcade shoot-em-up where YOU control the speed of the game.\n\nInspired by classic arcade shooters such as 'Space Invaders' and 'Galaga', Wavecade brings back the original nostalgia feeling to players from arcades, using sleek retro 80's and sci-fi aesthetic.\n\nDestroy blocks in style as you collect powerups and avoid hazards. \n\nHow far can you go? Set your own rules and unlock your favourite mode to play.","10":"","11":"","12":"Mow thousands of night creatures and survive until dawn! \n\nVampire Survivors is a gothic horror casual game with rogue-lite elements, where your choices can allow you to quickly snowball against the hundreds of monsters that get thrown at you. \n\nThere's no place where to hide, all you can do is try to survive a cursed night and get as much gold as possible for the next survivor, before Death inevitably puts an end to your struggles.","13":"","14":"","15":"Inspired by the beloved Chinese epic, The Romance of the Three Kingdoms, Reigns: Three Kingdoms thrusts players into the turbulent final years of the Han dynasty. There, they will encounter the many factions, wars, and heroes of the saga as they swipe their way through negotiations, marry to strengthen alliances, and convert to gain more power. \n\nDiscover new ways to enjoy Reigns' unique swiping mechanic as you uncover the many secrets of a vast storyline and a host of unexpected mini-games.","16":"Dr. Rosalene and Dr. Watts have peculiar jobs: They give people another chance to live, all the way from the very beginning... but only in their patients' heads.\n\nDue to the severity of the operation, the new life becomes the last thing the patients remember before drawing their last breath. Thus, the operation is only done to people on their deathbeds, to fulfill what they wish they had done with their lives, but didn't.\n\nFinding Paradise is the 2nd full episode of To the Moon's series. It follows the life of the doctors' new patient, Colin, as they attempt to unravel a life that is split down the middle, and fulfill a wish that appears to be self-contradictory by nature.","17":"","18":"\"I will claim the starsongs, and bring honor to the clan.\"\n\nExiled by his people, Jun ventures out in search of starsongs to redeem himself. But progress is slow, until he saves Eda, a witch who can pick up on the sound of asteroids. However, what appears to be a blessed encounter, will end up becoming a lifelong burden...\n\nEcho of Starsong is a narrative puzzle adventure game. Asteroids emitting a sound known as \"Starsongs\" have become the center of conflict for the immense power they hold. Determined to claim asteroids of his own, a young man ventures out with a girl who can imitate starsongs, lending her voice to unravel an ancient myth deep in the heart of space.","19":"","20":"Break the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physics simulation crafted by legendary developer Bugbear, who also brought you FlatOut 1 &amp; 2! \n\nBurn rubber and shred metal in the ultimate driving playground! Wreckfest is jam-packed with upgrade and customization options. \n\nWhether you are preparing for your next demolition derby with reinforced bumpers, roll cages, side protectors and much more, or setting your car up for a banger race with engine performance parts like air filters, camshafts, fuel systems, etc., Wreckfest is shaping up to be the best combative motorsport game out there.","21":"","22":"Medieval II: Total War Kingdoms is the official expansion to Medieval II: Total War, presenting players with all-new territories to explore, troops to command, and enemies to conquer. Kingdoms features four new entire campaigns centered on expanded maps of the British Isles, Teutonic Northern Europe, the Middle East, and the Americas. All-new factions from the New World are also now fully playable, including the Aztecs, Apaches, and Mayans."},"Link":{"1":"www.metacritic.com\/game\/ios\/valiant-hearts-coming-home","2":"www.metacritic.com\/game\/ios\/roller-drama","3":"www.metacritic.com\/game\/ios\/devolver-tumble-time","4":"www.metacritic.com\/game\/ios\/pocket-card-jockey-ride-on!","5":"www.metacritic.com\/game\/ios\/madnessendless","6":"www.metacritic.com\/game\/ios\/omega-13","7":"www.metacritic.com\/game\/ios\/teenage-mutant-ninja-turtles-shredders-revenge","8":"www.metacritic.com\/game\/ios\/boxville","9":"www.metacritic.com\/game\/ios\/wavecade","10":"www.metacritic.com\/game\/ios\/ninja-must-die","11":"www.metacritic.com\/game\/ios\/afterplace","12":"www.metacritic.com\/game\/ios\/vampire-survivors","13":"www.metacritic.com\/game\/ios\/scriptic-netflix-edition","14":"www.metacritic.com\/game\/ios\/dead-cells+","15":"www.metacritic.com\/game\/ios\/reigns-three-kingdoms","16":"www.metacritic.com\/game\/ios\/finding-paradise","17":"www.metacritic.com\/game\/ios\/old-mans-journey+","18":"www.metacritic.com\/game\/ios\/opus-echo-of-starsong","19":"www.metacritic.com\/game\/ios\/carx-street","20":"www.metacritic.com\/game\/ios\/wreckfest","21":"www.metacritic.com\/game\/ios\/evidence-111","22":"www.metacritic.com\/game\/ios\/medieval-ii-total-war-kingdoms"},"Release":{"1":"January 31, 2023","2":"January 26, 2023","3":"January 26, 2023","4":"January 20, 2023","5":"January 20, 2023","6":"January 12, 2023","7":"January 10, 2023","8":"January 5, 2023","9":"January 4, 2023","10":"December 13, 2022","11":"December 9, 2022","12":"December 8, 2022","13":"December 6, 2022","14":"December 2, 2022","15":"November 29, 2022","16":"November 18, 2022","17":"November 18, 2022","18":"November 17, 2022","19":"November 16, 2022","20":"November 14, 2022","21":"November 14, 2022","22":"November 10, 2022"}}