{"Titles":{"1":"Death Trials Director's Cut","2":"Dropoff Dealer","3":"Violet Wisteria","4":"Top Race","5":"Sex Simulator - The Yacht","6":"Thief x Detective Blonde Lady","7":"Big Adventure: Trip to Europe 4","8":"CryptoZoo","9":"FIGHT PLANE","10":"Pigskin Punter!","11":"Lockes The Thief","12":"Tower Walker: MMO Grind Simulator","13":"Otome Legends","14":"Man 3: The Social Media Wars","15":"Sky Rider","16":"Sunrider 4: The Captain's Return","17":"Madorica Real Estate 2 - The mystery of the new property -","18":"Cave Raider","19":"Prizma Puzzle Prime","20":"Idle interstellar Factory 2","21":"OUTSTAND","22":"PIP XL","23":"Drawing From Memory","24":"Fight &amp; Crush","25":"Sex with Succubus","26":"City Ambulance Car Driving","27":"Balloon Man","28":"My Hobby: Needlework Valentine's Day","29":"YourTrain","30":"Hogwarts Legacy","31":"Conjury Revell","32":"Netherverse","33":"Drift Experience Japan","34":"Poly Memory: Butterflies","35":"Street Lords","36":"Daily Dadish","37":"College Entrance Winner","38":"C***ville","39":"Multiplayer Werewolves","40":"Avenger (1986)","41":"Hug Survivor","42":"TROJAN","43":"The Forest","44":"Upgrader","45":"Moving in with My Step-sister","46":"Scorchlands","47":"Phoenix Nightmare","48":"Old Tunnel","49":"Satay Shop Tycoon","50":"Tal Wars","51":"Puppet Show in the Box","52":"You Can Do!mino","53":"Endless Fireworks Simulator","54":"The Fairy's Secret","55":"Billion Bastard Bots","56":"Tasty Merge","57":"Chess Defense Saga","58":"Secret Dimension","59":"Voxabular P.I.: Penny's First Case","60":"Under the Sky World~Another~","61":"SokoMage","62":"CRPG is in China.","63":"The Utility Room","64":"Alice Running Adventures","65":"Army War: Shooting Simulator","66":"Berry Madness","67":"Love Love School Days","68":"Cubic Crush Streamer Showdown","69":"Banana Attack VR","70":"House of the Soul","71":"Weird and Unfortunate Things Are Happening","72":"F1 Crazy Stunts","73":"LightFall","74":"Wild Seas","75":"Kristal Magara","76":"Nature Escapes 2","77":"Gravlist","78":"Hentai Puzzle Universe","79":"Stories From the Cores","80":"Alchemy Shop","81":"Aim Expert","82":"Drive Maker","83":"Weekend Warriors MMA","84":"A Travers Le Temps","85":"Tears RAIN: Tears of Goddess","86":"Synthetic Days","87":"Code Rivals","88":"WTP Story 1","89":"Komodo 3K Arena","90":"Need Know What Know","91":"DeliverywarTH","92":"Decent Checkers","93":"Earth Mars Mix VR Game","94":"KittenMouse: Summer Of Love","95":"PROTOTYPE (Veronika Orfeeva)","96":"Limited Rescue","97":"LoFi Hotel","98":"Souen no Iseki","99":"Variant 22","100":"Food Maze"},"Platform":{"1":"PC","2":"PC","3":"PC","4":"PC","5":"PC","6":"PC","7":"PC","8":"PC","9":"PC","10":"PC","11":"PC","12":"PC","13":"PC","14":"PC","15":"PC","16":"PC","17":"PC","18":"PC","19":"PC","20":"PC","21":"PC","22":"PC","23":"PC","24":"PC","25":"PC","26":"PC","27":"PC","28":"PC","29":"PC","30":"PC","31":"PC","32":"PC","33":"PC","34":"PC","35":"PC","36":"PC","37":"PC","38":"PC","39":"PC","40":"PC","41":"PC","42":"PC","43":"PC","44":"PC","45":"PC","46":"PC","47":"PC","48":"PC","49":"PC","50":"PC","51":"PC","52":"PC","53":"PC","54":"PC","55":"PC","56":"PC","57":"PC","58":"PC","59":"PC","60":"PC","61":"PC","62":"PC","63":"PC","64":"PC","65":"PC","66":"PC","67":"PC","68":"PC","69":"PC","70":"PC","71":"PC","72":"PC","73":"PC","74":"PC","75":"PC","76":"PC","77":"PC","78":"PC","79":"PC","80":"PC","81":"PC","82":"PC","83":"PC","84":"PC","85":"PC","86":"PC","87":"PC","88":"PC","89":"PC","90":"PC","91":"PC","92":"PC","93":"PC","94":"PC","95":"PC","96":"PC","97":"PC","98":"PC","99":"PC","100":"PC"},"RatingMC":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"83","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"UserRating":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"Summary":{"1":"You wake up in total darkness in a rusty metal cage. After you escape it, you notice the room you're in smells like rotten flesh and death. In this labyrinth of corpses and blood, you must find a way to escape... before they come for you.\n\nFace the horrors buried deep within this God forsaken testing facility. Voices echo through the halls. Maybe there's survivors, or maybe you're all alone. You can't shake that intense feeling of danger. Something feels like it's coming.\n\nWill you run and hide, or fight to escape?","2":"","3":"90s style platformer with a completely unique attack system. Slash your way through 8 stages of pure skills-based platforming.","4":"","5":"An interactive sex simulation game, featuring realistic high definition graphics and characters. You play the role a guy having fun on a luxurious yacht anchored near warm tropical islands.","6":"","7":"","8":"XD Tokens are a must have for any CryptoZoo-ologist. Use XD Tokens to crack eggs and collect animals. Merge them into new creations and sell high! Hatch-Merge-Sell is the gameplay loop. Short on cash? Cannot afford to crack anymore eggs? Fear not! CryptoZoo includes a in-game mini game called Crypto Invaders to help you earn by playing the game!","9":"","10":"Cute and silly arcade game about punting pigskins! Indie developer looking for feedback! Can you beat the game?","11":"A talented thief is summoned to sabotage a sinister plot devised by his own tribe.","12":"Tower Walker is a fresh new addictive auto-grinder rich with features, inspired by classic MMORPGS and RTS games with indirect control over your hero. The mysterious tower awaits!","13":"A visual novel where the routes are not routes, the endings are not endings, and your choices are not real choices.","14":"Join Daniel and Calvin as they create drama and fight media personalities. This is a 3D fighting game with a fully-3D environment.","15":"Skyrider is a fun and relaxing endless runner. Attempt a highscore, challenges, or simply enjoy the atmosphere of an endless futuristic city. Complete challenges to earn credits, which can be spent on character cosmetics.","16":"Captain Kayto Shields returns from exile in Sunrider 4: The Captain’s Return for a new space adventure!","17":"","18":"","19":"Tile-based puzzle game with smooth and addictive gameplay, old-school isometric graphics and excellent music. The player's task is to connect nodes which have various functions.","20":"","21":"OUTSTAND is a game that reflects the real face of dark and intense fear to the person from a first-person camera angle. Your treasure-seeking friend is trapped! Can you save him? Solve puzzles, watch out for the items around you and most importantly survive!","22":"PIP XL — cute puzzle game with pipes. Enjoy a relaxing time connecting pipes.","23":"Drawing from Memory is an online party game where you and 2-4 friends try to figure out what your most and least favorite characters look like by Drawing them from Memory.","24":"Try new top experiences together with this new action game, called Fight &amp; Crush! Being in the shoes of a beginner fighter, your main mission is to beat all the world fighters in your upcoming fights! You will have a limited time for this and limited health, so take care!\r\n\r\nArm with courage! The moment of the big chance has come, don’t miss it. Study and analyze the enemies carefully because each of them is preparing a surprise for you. Everyone is waiting to see a new invincible fighter. But what surprise are you preparing for the others?","25":"","26":"Take ill people to emergency hospital in this ambulance game. If you like to play simulation games, this ambulance game is for you.","27":"Avoid various traps and solve puzzles to help Balloon Man propose to the princess!\n\nThere are traps, puzzles, and unique bosses to confuse players!\n\nThere are stages with various concepts such as platforms, boss battles, chases, puzzles, and time machines.\n\nChallenge yourself to speedrun and compete with people all over the world!!","28":"Discover the world of embroidery and treat yourself to relaxing hours of fun in this charming Pixel Art game full of attractive canvases to color. Each design was chosen to celebrate love.\n\nSo find a comfy chair, thread your needle, and embroider your way through these delightful Valentine's themed pictures with My Hobby: Needlework - Valentine's Day!","29":"This is a simulation game of driving a train to transport customers on a Japanese railroad line.","30":"LIVE THE UNWRITTEN = Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and new locations as you explore and discover fantastic beasts, customize your character and craft potions, master spell casting, upgrade talents, and become the wizard you want to be.\r\n\r\nExperience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. You have received a late acceptance to the Hogwarts School of Witchcraft and Wizardry and soon discover that you are no ordinary student: you possess an unusual ability to perceive and master Ancient Magic. Only you can decide if you will protect this secret for the good of all, or yield to the temptation of more sinister magic.\r\n\r\nDiscover the feeling of living at Hogwarts as you make allies, battle Dark wizards, and ultimately decide the fate of the wizarding world. Your legacy is what you make of it.","31":"Conjury Revell is a first-person action game from the students at SMU Guildhall. Use your magical spells and abilities to eliminate waves of faceless oppressors as they attempt to keep you from rebelling against the system.","32":"","33":"Go FULL SEND Drifting in the streets of japan in 2 different sprint circuits and customize your car!","34":"Cute, relaxing, polygonal memory game with butterflies.","35":"Procedurally-generated gang warfare meets turn-based strategy and FPS action to deliver an immersive, brutal, endlessly-replayable strategic-shooter - generate your city, customise your gangs, and fight in first person on bloody urban battlefields.","36":"It’s an adventure that lasts a whole year! Daily Dadish is a retro platformer that features over 365 handcrafted levels - one for every day of the year! Face challenging foes, unlock cool characters, and help reunite Dadish with his missing kids all over again!","37":"","38":"","39":"Multiplayer Werewolves - You and Your Team are the last remaining Humans on Earth. Can You Survive?","40":"First came \"The Way of the Tiger\" the martial arts classic in which you had to prove your physical skills to become a Ninja. Now you have to prove your supreme mental agility in the second part of the Way of the Tiger Saga \"Avenger\", the ultimate arcade adventure. Yaemon Grand Master of Flame has assassinated your foster father Naijshi and stolen the Scrolls of Kettsuin. You have sworn to the God Kwon that you will avenge Yaemon's murderous act and recover the sacred scrolls. Your enemies are many, varied and all are deadly. All your skills, courage and nerve will be called upon when you begin the final conflict in the Great Keep. Good luck... only the brave hearted will survive.","41":"Love-filled survivor rogue-like shooter. Hug and bind the nuisances that spawn crazy chicks","42":"","43":"As the lone survivor of a passenger jet crash, you find yourself in a mysterious forest battling to stay alive against a society of cannibalistic mutants. Build, explore, survive in this terrifying first person survival horror simulator.","44":"A Top down action adventure upgrading rougelike, which introduces alot of ways to create the ultimate upgrader! Lots of customization with pets weapons and accessory's.","45":"One day, I received a phone call from my folks informing me that my stepsister was moving to the same city for work. It turned out she would be staying in my flat for the time being. A bright pink comet barreled into my humdrum routine. And so, my exciting life began with my stepsister moving in...","46":"Who says magic and science don't go along? The birdfolk of Giwi are curious explorers and inventors - what better way to satisfy scientific curiosity than an expedition to the moon?\n\nThe volcanic satellite, Helia, is filled with resources, so the daring explorers will not only discover new magical technologies but also harvest riches and establish colonies. Great discoveries aren't easy to come by - the moon's surface is full of dangerous creatures waiting to fight for their habitat. The Giwi will have to use magic not only to fend off any predators, but also to sustain their economy with arcane lasers allowing them to handle resource logistics by connecting all colonies into an industrial web.\n\nTo fully discover the mysteries of Helia players will have to establish multiple colonies on the moon's surface, discover new tech and magic, terraform the hostile environment and fight against local creatures.","47":"","48":"The game takes place in one of the tunnels where there is a mythical spring that restores the youth of anyone who drinks or swims in its waters. A group of archaeologists, having found it, find themselves in a dangerous situation from which only a guard armed to the teeth can pull them out.\n\nOld Tunnel is a runner and platformer with a side view. Despite the fact that the character moves through the tunnels automatically, you still have something to worry about. Every second your hero has to make decisions: jump or roll under an obstacle? Or maybe to shield yourself from the threat? \n\nThere are plenty of traps and troubles in the dungeons that will finish your race ahead of time. Are you sure that you are ready for a new batch of tests?","49":"","50":"","51":"","52":"Is this a puzzle or a simulation? I can't define the genre of the game. Clear the stage in various ways. Use different special dominoes and play the game with objects.","53":"This is a firework simulator game. Anytime you want to set off fireworks, this is one of the best.","54":"In this sequel to the fantasy yuri visual novel, The Fairy's Song, Marnie and Lisbeth return to Fenchapel to visit Marnie’s grandmother. Things soon become complicated, however, when they run into two figures from the past who ought to be dead.","55":"Intense first-person bullet-hell boomer-shooter in a fully randomised city-scape. Retro-style rogue-like with WAAAAY too many enemies all at once.","56":"Merge ingredients to cook up delicious dishes that'll keep the customers coming back in Tasty Merge! The more satisfied customers that walk through the door, the more money you'll earn to upgrade and customize your restaurant. But as your clientele grows, so do their tastes, so you'll need to unlock new offerings for your menu to keep them happy, from burgers to pizza and sushi to sweets!","57":"A chess-themed tower defense game with unique strategies, stories, and illustrations!","58":"Secret Dimension - a mind-bending platformer that will test your skills and keep you guessing. Master illusions, beat the clock and set new high scores.","59":"Learn Spanish by playing, not by studying! Practice languages by solving mysteries in this mix of the classic text adventure and point-and-click genres.","60":"\"Under the Sky World' is another story of IF.If KARIN in the main plot infected with [virus], so on the wrong path of words ......This is a small story about KARIN \"if\" -","61":"SokoMage is a new Top-Down puzzle that will push your brain to the limit. Slap rocks, avoid bushes, and hit the crystal to reach the end! Can you smash your way to the final level?","62":"The story takes place in the fantasy world of the low-magic era. As an oriental person who has experienced a shipwreck, the player begins to return home. .\n\nFind teammates, take advantage of your various talents to take risks in the game, no task lists and damn Ubisoft question marks torment.","63":"This VR Journey takes you to the 'behind the scenes' of the Universe. Beyond a door lies a barren landscape inhabited by strange rocky heads. Here, the maintenance and heavy lifting required keeps existence stable and temporal. You are a tourist. Don't do anything foolish.","64":"Different Worlds for you to explore and more world are coming Different cake types to unlock.","65":"You must take back the previously captured base in this military war game. As a commander, you must complete all challenging missions.","66":"In Berry Madness you need to find all the berries in the world to beat the game. Berry Madness takes place in beatiful world. You need to find all the berries to become a champion berry hunter.","67":"","68":"Show off your skills in the Cubic Crush Streamer Showdown! Play in the rooms of your favorite YouTubers, use power-ups, complete missions and let your viewers help or punish you in Twitch mode. Unlock more rooms as you progress and become the king of Cubic Crush!","69":"Shoot zombie limbs off and watch their ragdoll bodies fall then cook their delicious remains over the fire and feed it to your cute little fox!","70":"Begin a journey of deception and discovery in 'HOUSE OF THE SOUL', a first-person exploration and story based experience. Explore an isolated mansion and descend into its lower levels as you discover the hidden secret project of the obsessive inventor who lives there.","71":"Join Alicia as she tries to save her niece from a city warped and twisted by otherworldly beings in this eccentric RPG.","72":"Have you ever imagined doing stunts with a formula 1 car? Welcome to the parallel universe!","73":"The spirit that lived high in the sky falls to the underground city for some reason. \n\nIt's a 2D flat-former game where you have to find a way to get up from the gravity and traps of the underground city to get back to where you were.","74":"Defend the jewel of evil pirates! Wild Seas is a tower defense game with rogue-like elements, where your positioning can ensure victory","75":"In this game where we collect crystals, our goal is to complete the level without falling down from the platform and without being targeted by cannonballs. \n\nThe simple fun type of Kristal Magara is a challenging platform game even for players who have good hand and eye coordination.","76":"Nature Escapes returns with another beautiful collection of fun hidden object scenes!","77":"Gravlist is gravitational 2d platformer. Our player tries to overcome all the obstacles in front of him to find his goal","78":"A simple puzzle-based fun game with anime characters in different concepts. Solve puzzles and join the fun!","79":"Deep beneath the ocean floor, what discoveries are possible? \n\nJoin science bot Rovee on 3 expeditions with the International Ocean Discovery Project. Drill core samples from below the ocean floor, compare the layers, investigate hypotheses, and piece together dramatic stories of life on Earth.\n\nStores from the Cores is a suite of 3 single-player mini games about deep ocean core science. The games feature multiple choice questions, exploring 3D environments with science bot Rovee via point and click controls. Collecting mineral samples for scientific research, and matching games that all teach players about deep ocean core science.","80":"a puzzle game where you combine ingredients on a board and craft them into potions or other alchemical products for sale to waiting customers.","81":"Explore unique challenges and use your aiming skills to compete for the highest scores while having a fun and satisfying experience or train in a variety of scenarios and difficulties designed to improve your aiming. Aim Expert offers endless hours of entertainment and skill-building.","82":"A fun driving game with simple controls and graphics.","83":"The engine behind 3D wrestling brings the revolution to MMA, where real resistance challenges you to survive each round! Embark on a career to climb the ranks at 5 unique promotions with their own weight classes, or become the boss in the sport's 1st fully playable \"Promoter\" mode.","84":"Through Time is a platform game to pass the time! You have rather complex levels and an endless mode!","85":"Tears Rain is a combination of TCG and roguelike, and tells the story of characters who set foot in the Forest of Illusions. Use the given cards, weapons, and items strategically to defeat the enemies that stand in your way.","86":"Small town. Living without excess and deficiency, Komine Shion, a girl with no friends, spends such days.\n\nOne day, Shion hears rumors about her new transfer student, Suiren Higurashi. The next day, such a girl was standing in front of her Shion's house...\n\nAnd knowing the truth of \"her\", the past that was hidden in the depths of her heart.\n\nA short youth girl-meets-girl that should never be forgotten.","87":"Code Rivals is a experimental, visual programming language combat game, by a solo developer.\n\nLearn the basic principles of programming in a super intuitive visual (not text-based) programming language in a campaign tutorial, then challenge your friends in a autonomous robot combat, in different online multiplayer arenas, in various game modes.\n\nIn Code Rivals, instead of controlling the combat robot you will program it to fight for you, using an intuitive graphic based programming language you will use blocks that represent the actions the program will execute, the parts of the robot that will be activated, the flow of execution, variables etc.","88":"WTP - Story 1 is a dynamic choice lead adventure.","89":"Get ready for a powerful Komodo 3k blast with a bigger challenge! Fight against dozens of komodo dragons chasing you, an entertaining basic shooting game with different levels of complexity.","90":"","91":"You are a food delivery worker in Asia. There are two companies. Green food delivery company. and orange food delivery company The two companies have long been at odds of interest. And the conflict cannot be resolved by the company. therefore decided to fight for space","92":"Checkers is a timeless classic, steeped in rich history. This release supports 4 rulesets and includes PvE, PvP, and puzzle modes. From the casual checkers enthusiast to the competitive master, this game is sure to provide hours of entertainment and mental stimulation.","93":"A long and hurdle journey from Earth to Mars. A perfectly exciting game with a lot of VR physics mechanics.Run Jump Climb Fly Shoot Die Repeat. It will be hard to escape from the Artificial Intelligence Spider Robots. You can also escape from the new generation guided shots by stopping time.","94":"First Person Shooter, with a full single player campaign and story. Fight through 5 fiery and action packed levels, and enjoy the inspiring story of one man determined to defend his town! Multiple weapon and enemy types.","95":"","96":"The safe area is shrinking and only one may stand ! Use a variety of spells to push your friends in the hot lava and make sure you're the one getting rescued.","97":"This is a cozy game that mixes management with world map exploration. Gather gems to unlock rooms and hotel improvements. Explore levels in a sky world to collect the cutest guests and musicians in the islands. Your songs will change depending of which musicians you collected. No rush! Just chill!","98":"\"Souennoiseki\" is an adventure game for two players that aims to clear the game by cooperating.\n\nIt is divided into a novel part with a story experience unique to two people, and a puzzle part where you explore the labyrinth and solve the mystery.\n\nLet's work together to clear a puzzle where you can't see each other's screens and need to exchange information over the phone! Let's talk about what you know and what you want to know! !","99":"","100":""},"Link":{"1":"www.metacritic.com\/game\/pc\/death-trials-directors-cut","2":"www.metacritic.com\/game\/pc\/dropoff-dealer","3":"www.metacritic.com\/game\/pc\/violet-wisteria","4":"www.metacritic.com\/game\/pc\/top-race","5":"www.metacritic.com\/game\/pc\/sex-simulator---the-yacht","6":"www.metacritic.com\/game\/pc\/thief-x-detective-blonde-lady","7":"www.metacritic.com\/game\/pc\/big-adventure-trip-to-europe-4","8":"www.metacritic.com\/game\/pc\/cryptozoo","9":"www.metacritic.com\/game\/pc\/fight-plane","10":"www.metacritic.com\/game\/pc\/pigskin-punter!","11":"www.metacritic.com\/game\/pc\/lockes-the-thief","12":"www.metacritic.com\/game\/pc\/tower-walker-mmo-grind-simulator","13":"www.metacritic.com\/game\/pc\/otome-legends","14":"www.metacritic.com\/game\/pc\/man-3-the-social-media-wars","15":"www.metacritic.com\/game\/pc\/sky-rider","16":"www.metacritic.com\/game\/pc\/sunrider-4-the-captains-return","17":"www.metacritic.com\/game\/pc\/madorica-real-estate-2---the-mystery-of-the-new-property--","18":"www.metacritic.com\/game\/pc\/cave-raider","19":"www.metacritic.com\/game\/pc\/prizma-puzzle-prime","20":"www.metacritic.com\/game\/pc\/idle-interstellar-factory-2","21":"www.metacritic.com\/game\/pc\/outstand","22":"www.metacritic.com\/game\/pc\/pip-xl","23":"www.metacritic.com\/game\/pc\/drawing-from-memory","24":"www.metacritic.com\/game\/pc\/fight-crush","25":"www.metacritic.com\/game\/pc\/sex-with-succubus","26":"www.metacritic.com\/game\/pc\/city-ambulance-car-driving","27":"www.metacritic.com\/game\/pc\/balloon-man","28":"www.metacritic.com\/game\/pc\/my-hobby-needlework-valentine39s-day","29":"www.metacritic.com\/game\/pc\/yourtrain","30":"www.metacritic.com\/game\/pc\/hogwarts-legacy","31":"www.metacritic.com\/game\/pc\/conjury-revell","32":"www.metacritic.com\/game\/pc\/netherverse","33":"www.metacritic.com\/game\/pc\/drift-experience-japan","34":"www.metacritic.com\/game\/pc\/poly-memory-butterflies","35":"www.metacritic.com\/game\/pc\/street-lords","36":"www.metacritic.com\/game\/pc\/daily-dadish","37":"www.metacritic.com\/game\/pc\/college-entrance-winner","38":"www.metacritic.com\/game\/pc\/cville","39":"www.metacritic.com\/game\/pc\/multiplayer-werewolves","40":"www.metacritic.com\/game\/pc\/avenger-1986","41":"www.metacritic.com\/game\/pc\/hug-survivor","42":"www.metacritic.com\/game\/pc\/trojan","43":"www.metacritic.com\/game\/pc\/the-forest","44":"www.metacritic.com\/game\/pc\/upgrader","45":"www.metacritic.com\/game\/pc\/moving-in-with-my-step-sister","46":"www.metacritic.com\/game\/pc\/scorchlands","47":"www.metacritic.com\/game\/pc\/phoenix-nightmare","48":"www.metacritic.com\/game\/pc\/old-tunnel","49":"www.metacritic.com\/game\/pc\/satay-shop-tycoon","50":"www.metacritic.com\/game\/pc\/tal-wars","51":"www.metacritic.com\/game\/pc\/puppet-show-in-the-box","52":"www.metacritic.com\/game\/pc\/you-can-do!mino","53":"www.metacritic.com\/game\/pc\/endless-fireworks-simulator","54":"www.metacritic.com\/game\/pc\/the-fairys-secret","55":"www.metacritic.com\/game\/pc\/billion-bastard-bots","56":"www.metacritic.com\/game\/pc\/tasty-merge","57":"www.metacritic.com\/game\/pc\/chess-defense-saga","58":"www.metacritic.com\/game\/pc\/secret-dimension","59":"www.metacritic.com\/game\/pc\/voxabular-pi-pennys-first-case","60":"www.metacritic.com\/game\/pc\/under-the-sky-worldanother","61":"www.metacritic.com\/game\/pc\/sokomage","62":"www.metacritic.com\/game\/pc\/crpg-is-in-china","63":"www.metacritic.com\/game\/pc\/the-utility-room","64":"www.metacritic.com\/game\/pc\/alice-running-adventures","65":"www.metacritic.com\/game\/pc\/army-war-shooting-simulator","66":"www.metacritic.com\/game\/pc\/berry-madness","67":"www.metacritic.com\/game\/pc\/love-love-school-days","68":"www.metacritic.com\/game\/pc\/cubic-crush-streamer-showdown","69":"www.metacritic.com\/game\/pc\/banana-attack-vr","70":"www.metacritic.com\/game\/pc\/house-of-the-soul","71":"www.metacritic.com\/game\/pc\/weird-and-unfortunate-things-are-happening","72":"www.metacritic.com\/game\/pc\/f1-crazy-stunts","73":"www.metacritic.com\/game\/pc\/lightfall","74":"www.metacritic.com\/game\/pc\/wild-seas","75":"www.metacritic.com\/game\/pc\/kristal-magara","76":"www.metacritic.com\/game\/pc\/nature-escapes-2","77":"www.metacritic.com\/game\/pc\/gravlist","78":"www.metacritic.com\/game\/pc\/hentai-puzzle-universe","79":"www.metacritic.com\/game\/pc\/stories-from-the-cores","80":"www.metacritic.com\/game\/pc\/alchemy-shop","81":"www.metacritic.com\/game\/pc\/aim-expert","82":"www.metacritic.com\/game\/pc\/drive-maker","83":"www.metacritic.com\/game\/pc\/weekend-warriors-mma","84":"www.metacritic.com\/game\/pc\/a-travers-le-temps","85":"www.metacritic.com\/game\/pc\/tears-rain-tears-of-goddess","86":"www.metacritic.com\/game\/pc\/synthetic-days","87":"www.metacritic.com\/game\/pc\/code-rivals","88":"www.metacritic.com\/game\/pc\/wtp-story-1","89":"www.metacritic.com\/game\/pc\/komodo-3k-arena","90":"www.metacritic.com\/game\/pc\/need-know-what-know","91":"www.metacritic.com\/game\/pc\/deliverywarth","92":"www.metacritic.com\/game\/pc\/decent-checkers","93":"www.metacritic.com\/game\/pc\/earth-mars-mix-vr-game","94":"www.metacritic.com\/game\/pc\/kittenmouse-summer-of-love","95":"www.metacritic.com\/game\/pc\/prototype-veronika-orfeeva","96":"www.metacritic.com\/game\/pc\/limited-rescue","97":"www.metacritic.com\/game\/pc\/lofi-hotel","98":"www.metacritic.com\/game\/pc\/souen-no-iseki","99":"www.metacritic.com\/game\/pc\/variant-22","100":"www.metacritic.com\/game\/pc\/food-maze"},"Release":{"1":"February 8, 2023","2":"February 8, 2023","3":"February 8, 2023","4":"February 8, 2023","5":"February 8, 2023","6":"February 8, 2023","7":"February 8, 2023","8":"February 8, 2023","9":"February 8, 2023","10":"February 8, 2023","11":"February 8, 2023","12":"February 8, 2023","13":"February 8, 2023","14":"February 8, 2023","15":"February 8, 2023","16":"February 8, 2023","17":"February 8, 2023","18":"February 8, 2023","19":"February 8, 2023","20":"February 8, 2023","21":"February 8, 2023","22":"February 8, 2023","23":"February 8, 2023","24":"February 8, 2023","25":"February 8, 2023","26":"February 7, 2023","27":"February 7, 2023","28":"February 7, 2023","29":"February 7, 2023","30":"February 7, 2023","31":"February 7, 2023","32":"February 7, 2023","33":"February 7, 2023","34":"February 7, 2023","35":"February 7, 2023","36":"February 7, 2023","37":"February 7, 2023","38":"February 7, 2023","39":"February 7, 2023","40":"February 7, 2023","41":"February 7, 2023","42":"February 7, 2023","43":"February 7, 2023","44":"February 7, 2023","45":"February 7, 2023","46":"February 7, 2023","47":"February 7, 2023","48":"February 7, 2023","49":"February 7, 2023","50":"February 7, 2023","51":"February 7, 2023","52":"February 7, 2023","53":"February 6, 2023","54":"February 6, 2023","55":"February 6, 2023","56":"February 6, 2023","57":"February 6, 2023","58":"February 6, 2023","59":"February 6, 2023","60":"February 6, 2023","61":"February 6, 2023","62":"February 6, 2023","63":"February 6, 2023","64":"February 6, 2023","65":"February 6, 2023","66":"February 6, 2023","67":"February 6, 2023","68":"February 6, 2023","69":"February 6, 2023","70":"February 6, 2023","71":"February 6, 2023","72":"February 6, 2023","73":"February 6, 2023","74":"February 5, 2023","75":"February 5, 2023","76":"February 5, 2023","77":"February 5, 2023","78":"February 5, 2023","79":"February 5, 2023","80":"February 5, 2023","81":"February 5, 2023","82":"February 5, 2023","83":"February 5, 2023","84":"February 5, 2023","85":"February 5, 2023","86":"February 5, 2023","87":"February 4, 2023","88":"February 4, 2023","89":"February 4, 2023","90":"February 4, 2023","91":"February 4, 2023","92":"February 4, 2023","93":"February 4, 2023","94":"February 4, 2023","95":"February 4, 2023","96":"February 4, 2023","97":"February 4, 2023","98":"February 3, 2023","99":"February 3, 2023","100":"February 3, 2023"}}