{"Titles":{"1":"The Redress of Mira","2":"Prison Tycoon: Under New Management","3":"Dicey Dungeons","4":"Quiz Thiz Spain","5":"Dodge the Ball","6":"Helvetii","7":"Pets at Work","8":"Pirated Code: Admin Edition","9":"Prison Simulator","10":"Offroad Moto Bike","11":"Delirium","12":"Puzzle Bobble 2X \/ Bust-a-Move 2 Arcade Edition &amp; Puzzle Bobble 3 \/ Bust-a-Move 3 S-Tribute","13":"Deliver Us Mars","14":"ExitMan Deluxe","15":"Fashion Police Squad","16":"Arcade Archives: Phelios","17":"Albacete Warrior","18":"Beveron","19":"Rhythm Sprout","20":"Row of numbers","21":"Astro &amp; Suzy go to the beach!","22":"PowerWash Simulator","23":"Raiden IV x Mikado Remix","24":"Straylight","25":"We Were Here Forever","26":"PowerWash Simulator: Tomb Raider Special Pack","27":"SpongeBob SquarePants: The Cosmic Shake","28":"SEASON: A letter to the future","29":"Gnomes Garden Return Of The Queen","30":"Backfirewall_","31":"\"Buy The Game, I Have a Gun\" -Sheesh-Man","32":"Egg Runner","33":"Find the Bug","34":"The Jumping Onigiri","35":"Stranger of Paradise: Final Fantasy Origin - Different Future","36":"Pro Turkey Hunting","37":"ATONE: Heart of the Elder Tree","38":"Dance of Death: Du Lac &amp; Fey","39":"Wonderland Nights: White Rabbit's Diary","40":"Startup Company: Console Edition","41":"Wonder Boy Anniversary Collection","42":"MechWarrior 5: Mercenaries - Rise of Rasalhague","43":"Arcade Archives: The New Zealand Story","44":"OddBallers","45":"Cat Slide Tiles","46":"Miracle Snack Shop","47":"Sissa's Path","48":"The Dino R","49":"Clunky Hero","50":"Risen","51":"Neptunia: Sisters vs. Sisters","52":"Roads of Time","53":"Hashiriya Drifter - Car Drift Racing Simulator","54":"The Zebra Z","55":"OmegaBot","56":"Monster Hunter Rise","57":"Stroke the Horse","58":"Napoleon Maiden Episode.1 A maiden without the word impossible","59":"Demon Hunter: New Chapter","60":"Frido","61":"Flipy","62":"The Jumping Chocolate","63":"Trenches","64":"99 Seconds","65":"Rally Rock 'N Racing","66":"Persona 4 Golden","67":"Persona 3 Portable","68":"Q.U.B.E. 10th Anniversary","69":"NeverAwake","70":"Arcade Archives: TANK FORCE","71":"Super Jumpy Ball","72":"A Matter of Principle","73":"Tortuga - A Pirate's Tale","74":"A Space For The Unbound","75":"Graze Counter GM","76":"The Legend of Tianding","77":"Hot Shots Golf 2","78":"Star Wars: Demolition","79":"Syphon Filter 3","80":"Mrs.Cat Between Worlds","81":"Wings Of Bluestar","82":"US Navy Sea Conflict","83":"Hyper Gunsport","84":"Ultimate ADOM - Caverns of Chaos","85":"The Jumping Salad","86":"Dungeon Munchies","87":"Aurora's Journey and the Pitiful Lackey","88":"One Piece Odyssey","89":"Chasing Static","90":"Breakers Collection","91":"Arcade Archives: Senjyo","92":"Fight of Steel: Infinity Warrior","93":"Fight of Animals: Arena","94":"Reckless auto racing","95":"Burrow of the Fallen Bear: A Gay Furry Visual Novel","96":"Salamander County Public Television","97":"Suhoshin","98":"Vengeful Guardian: Moonrider","99":"Crown of the Empire: Around the World","100":"Children of Silentown"},"Platform":{"1":"PlayStation 4","2":"PlayStation 4","3":"PlayStation 4","4":"PlayStation 4","5":"PlayStation 4","6":"PlayStation 4","7":"PlayStation 4","8":"PlayStation 4","9":"PlayStation 4","10":"PlayStation 4","11":"PlayStation 4","12":"PlayStation 4","13":"PlayStation 4","14":"PlayStation 4","15":"PlayStation 4","16":"PlayStation 4","17":"PlayStation 4","18":"PlayStation 4","19":"PlayStation 4","20":"PlayStation 4","21":"PlayStation 4","22":"PlayStation 4","23":"PlayStation 4","24":"PlayStation 4","25":"PlayStation 4","26":"PlayStation 4","27":"PlayStation 4","28":"PlayStation 4","29":"PlayStation 4","30":"PlayStation 4","31":"PlayStation 4","32":"PlayStation 4","33":"PlayStation 4","34":"PlayStation 4","35":"PlayStation 4","36":"PlayStation 4","37":"PlayStation 4","38":"PlayStation 4","39":"PlayStation 4","40":"PlayStation 4","41":"PlayStation 4","42":"PlayStation 4","43":"PlayStation 4","44":"PlayStation 4","45":"PlayStation 4","46":"PlayStation 4","47":"PlayStation 4","48":"PlayStation 4","49":"PlayStation 4","50":"PlayStation 4","51":"PlayStation 4","52":"PlayStation 4","53":"PlayStation 4","54":"PlayStation 4","55":"PlayStation 4","56":"PlayStation 4","57":"PlayStation 4","58":"PlayStation 4","59":"PlayStation 4","60":"PlayStation 4","61":"PlayStation 4","62":"PlayStation 4","63":"PlayStation 4","64":"PlayStation 4","65":"PlayStation 4","66":"PlayStation 4","67":"PlayStation 4","68":"PlayStation 4","69":"PlayStation 4","70":"PlayStation 4","71":"PlayStation 4","72":"PlayStation 4","73":"PlayStation 4","74":"PlayStation 4","75":"PlayStation 4","76":"PlayStation 4","77":"PlayStation 4","78":"PlayStation 4","79":"PlayStation 4","80":"PlayStation 4","81":"PlayStation 4","82":"PlayStation 4","83":"PlayStation 4","84":"PlayStation 4","85":"PlayStation 4","86":"PlayStation 4","87":"PlayStation 4","88":"PlayStation 4","89":"PlayStation 4","90":"PlayStation 4","91":"PlayStation 4","92":"PlayStation 4","93":"PlayStation 4","94":"PlayStation 4","95":"PlayStation 4","96":"PlayStation 4","97":"PlayStation 4","98":"PlayStation 4","99":"PlayStation 4","100":"PlayStation 4"},"RatingMC":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"88","67":"80","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"UserRating":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"6.0","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"6.9","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"Summary":{"1":"\"Seeing how serious her mother was about keeping it a secret made Mira understand just how sensitive what she was about to tell her was. 'I promise,' Mira said solemnly.\"\n\nWith a variety of gameplay mechanics, venture through Mira's fantasy world filled with atmosphere and adventure, and pursue her inner peace. Uncover her past with the help of written books; witness events before she embarked.\n\nIn the daytime, travel through nature and man-made ruins; pass through magic gates with the aid of a mana-filled staff. In the nighttime, experience the horror of Mira's short nightmares.","2":"Plan and build your own prison from the ground up! Secure government grants, hire guards and staff and begin welcoming new prisoners in this reboot of the Prison Tycoon franchise.\n\nThe goal of a good Warden is not to punish their prisoners, it's to rehabilitate them into productive members of society. In Under New Management, each inmate must work through their own issues that landed them in prison, and it's your job to provide them with the help they need to get healthy.\n\n\"Prison Tycoon : Under New Management\" is looking for a good Warden. Are you up for the job?","3":"In this new fast-paced deckbuilding roguelike from Terry Cavanagh, Chipzel, and Marlowe Dobbe, you'll fight monsters, find better loot, and level up your heroes as you work together to take down the Goddess of Fortune, Lady Luck herself. Balance your carefully planned strategies against the unknown of a dice roll.\n\nPlay as six different characters, each with their own unique play styles and abilities. Master each class and figure out which one best fits your style in this charming world filled with a growing array of twists and secrets.\n\nCan you make it out alive? Maybe, but luck is definitely not on your side.","4":"Are you the new quiz master and can you beat your friends on this quiz? Answer questions about this country and collect valuable points! Also, learn new facts about this country while playing!","5":"Dodge the incoming balls and collect diamonds and score the highest score.","6":"Around a hundred years BC, all of Gaul is far from Roman control. In the lands controlled by the Helvetii, a Roman legion was subjugated by young warchief Divico, blessed by an ancient boon brought to him from parts unknown.\r\n\r\nHowever, this victory came at a great cost, as soon the result of the war chief's pact would turn into a curse; an ever spreading rot crawling through his land, and slowly corrupting his mind and heart. Monsters and cultists start appearing throughout the land, and a shadowy figure makes his move, taking advantage of the chaos he helped create.\r\n\r\nWith the help of the trusted yet reclusive druid Nammeios and the curious half-beast Renart, Divico sets his journey to undo the source of the rot and restore what was lost inside him.","7":"Some pets got lost from their owners in an office and now need to work together, using boxes, mats, buttons, climb on shelves and tables or just make a mess trying to find them in this colorful co-op game!","8":"When an advanced AI program named Seren awakens to find they've been installed as the co-pilot of a smuggling ship, they can't help but be annoyed. This is clearly not what they were made to do... right?\n\nActually, they can't remember...\n\nWith no memories of their previous directive, they'll have to (begrudgingly) rely on their newfound crewmates to help them find where they belong.\n\nPirated Code: Admin Edition is a visual novel that expands the hit game jam game with more chapters, more secrets and unlockable content through different story routes. Follow Seren and their story of self-discovery aboard Dex's smuggler ship.","9":"Prison Simulator is a first-person simulation game in which you play the role of a prison service officer a month before your desired promotion. You have to perform increasingly complex tasks in prison, balancing the administration's assessment and inmates' satisfaction.\n\nWill you choose to follow the rules, intercept contraband, count prisoners, send them to work, take care of their basic needs and keep prison gangs under control? Will you go to the dark side? Whatever you decide, remember that your actions will affect both the facility itself and the inmates, and above all, the further course of your career.","10":"Enjoy riding your moto bike on off road terrains, trying to reach the goal line of each level.\n\nYou will have to face loops, bridges, hills, jumps and all sort of obstacles.\n\nMore importantly, you will have to watch carefully your gazoline consumption to make sure you don't run out of it.\n\nEasily playable, but still much fun, Offroad Moto Bike will please at all ages.","11":"Delirium is a first-person graphic adventure in which we control teenage rebel Lola. Like Lola, our main objective will be to escape from Delirium along with her freak brother Danny, who will accompany us during the adventure.\r\n\r\nTo do this, we must put all our ingenuity in solving fun puzzles, explore unusual scenarios and meet peculiar characters. In Delirium we will be able to interact with the stage to examine objects, pick them up and also combine them with other different ones in order to advance in the story.\r\n\r\nWith Lola and Danny we will live a whole adventure full of humor and full of references to pop culture, be it video games, comics, movies or series.","12":"Puzzle Bobble is a series of puzzle games in which the player fires bubbles from the bottom of the screen, and the bubbles pop when three or more of the same color stick together. The player clears each stage when they meet the conditions for that stage. Higher points are scored when many bubbles are dropped at once or when bubbles are popped by shooting bubbles and bouncing them off the walls.\r\n\r\nHave fun playing alone in puzzle mode, where you can take your time solving puzzles, or with a friend in versus mode, where you fire bubbles at each other. Enjoy ports of the arcade games Puzzle Bobble 2X and Puzzle Bobble 3, as well as four home console versions released in Japan and abroad, with added original modes.\r\n\r\nThe games also have new features such as rewind, slow mode, and quick save, which are perfect for practice, strategizing, and stage creation.","13":"Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward.","14":"Chicken Little was right, the sky IS falling!\n\nQuickly run into the gap as the ceiling comes crashing down from above. If you make it in time the ceiling will rise up again and then crash down again and again, each time with the gap in a random place. How long can you survive?\n\nIf you can squeeze into the yellow Exit area you'll earn coins that you can use to buy new costumes.","15":"Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!\n\nFashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!","16":"Artemis, the goddess of the moon, has been kidnapped by the evil ruler of the darkness known as Typhon. Apollo must traverse seven treacherous areas in order to rescue his love!","17":"Albacete Warrior is a satirical combat game where you take on the role of Benito Waters, ninja from Albacete, Spain, in his worldwide adventure on an important task given to him by his master, Paco sensei. With his trusty companion, friend and also main weapon, Pepito the chicken, cockslap waves of enemies whose only wish is to see you dead and fulfill the ancient prophecy to become the chosen one, like many that have come before him. Being the chosen one doesn't really seem very special but it does sound fun.\n\nFight, climb, laugh and weep alone or with friends! Albacete Warrior includes a cooperative mode where you can experience Benito's odyssey in good company while you shed gallons of pixelated blood.","18":"Beveron is 3D racing game. Your goal is to get all collectibles in each level under certain time. There are many levels to beat and hopefully enjoy.","19":"Rhythm Sprout is a brand new high-focus rhythm action. Move and fight to the beat and follow a silly self-aware story in the breaks.\n\nYou play as the Chosen Onion - Sprout - saviour of the Vegetable Kingdom.\n\nWill you stop the King Sugar Daddy's Bad Sweets army? Could you save the Princess ... what was her name, again?","20":"Learn the numerical order with us and our green centipede. Best game for your pre-school kid to learn the order of the numbers.","21":"Astro &amp; Suzy have finally made it to the beach! And the humans are dropping all kinds of yummy things! Hotdogs! Tacos! Hamburgers! Help Astro &amp; Suzy eat all the wasted human beach food before it hits the ground. But watch out for the Mayo! It will ruin the whole day. Make sure to get all the power-ups like Catsup, Mustard, and Salsa! They increase Astro &amp; Suzy’s food bonus multipliers! And don’t miss the ‘dog bone of invincibility’! (Based on a real-life story that hasn’t happened yet)","22":"Release the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. \n\nBuild up your business in Career Mode and complete a variety of dirty jobs across the dusty town of Muckingham. There's no right or wrong; no time pressure or final score, just you and the tools you need to soak away your stress. Want a clean start? Chill out and replay your favourite jobs in Free Play.","23":"THE ROAR OF THUNDER IS BACK!\n\nRaiden IV, the popular shoot 'em up arcade and console game, debuts on Nintendo Switch with remixed background music by a superb lineup of artists produced by GAME CENTER MIKADO.\n\nInstill fear in your enemies with devastating attacks and earn the acclaimed title of master Ace!","24":"The goal in STRAYLIGHT is simple: Get to the end. But to do that, you're going to have to fly. You're going to have to dodge and swing and soar, avoiding deadly obstacles by the most razor-thin margins. You're going to have to react faster than you can think, finding your own pathway through these beautiful--and dangerous--cosmic playgrounds.\n\nSTRAYLIGHT is all about the flow, all about mastering the Fling Engine to become an unstoppable parkour space ninja; all about nailing that perfect run and making it through the level without dying once. It's about swinging around a deadly crystal ball just in time to barely avoid a deadly spinning crystal ring, and crowing in triumph. It's also about dying, over and over and over again, until you become transcendent. It's about telling those who say you can't move around in Virtual Reality: \"Oh yeah? Watch this.\"","25":"You both awaken imprisoned inside the sinister Castle Rock - were you betrayed, or simply not that clever? Find out in the newest co-op puzzle adventure in the We Were Here Series! Do you and your partner have what it takes to face the dark forces of this realm or will you be trapped… forever?","26":"The Tomb Raider Free Special Pack rappels into PWS.","27":"Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!\n\nFeatures\n\n* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick\n* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar\n* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom\n* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick\n* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors\n* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory","28":"Immerse yourself in the world of Season, a third-person atmospheric adventure bicycle road trip game.\r\n\r\nLeave home for the first time to collect memories before a mysterious cataclysm washes everything away. Explore, record, meet people, and unravel the strange world around you.","29":"What could gnomes and harpies have in common? It might seem that there's nothing, but that couldn't be further from the truth. The Harpy Queen and Gnome Queen are old friends. They first met on the Sloping Shores when a gnome ship was wrecked. The Harpy Queen helped the Gnome Queen and the whole crew reach their land and they've been the best of friends since then.","30":"Hello and welcome to Backfirewall_, a first-person tragicomic adventure set inside a smartphone.\n\nYou are the update assistant. Solve wacky puzzles to counter the update and save the previous operating system from deletion. The fate of the System is in your hands!","31":"This game is worth every penny, and you should buy it right now, why? Firstly because the whole story was written during a live-stream, which makes the story totally nonsensical! If this doesn't convince you remember that not only do I have a gun, I also know all your secrets. This is of course a joke, I do not know your secrets, yet. The game even features some of the most famous actors to have ever lived, including \"Thrash94Gaming\" you might know him for never being in a movie. \"LaraCroft86\" you might know her for also not being in any movie. Lastly but mostly least \"Gamer Jeffro\" for his famous role as Asa Gray in the video game that you are about to buy. Thankfully this game also includes two actors from Kimulator's Films, sadly they also were never in anything noteworthy.\r\n\r\nYou might wonder who I am, well I'm Sheesh-Man, I literally come from another planet, I'm like an alien, a spooky sheeshing alien to say the truth. Don't challenge me or I will sheesh your whole family, including your dog, it's not a threat, it's a fact.\r\n\r\nNow back to the game, it features over 2 hours of video footage of me and my worst enemy Swag-Girl, who even says Swag in 2023? Pft, we all know Sheeshing is the new hip and cool thing to do.\r\n\r\nThis game is an interactive movie telling the story of how I went on earth and became a super-hero or whatever, it's pretty sick if you ask me! Not sick in the sense that you will throw up, but in the sense that it's cool. This my friend was a word play, you can expect this level of humour in the game, may I say it even gets better than this, not a lot, but at least a little bit.\r\n\r\nThe game as a ton of bonus content too! Even a video of Mini the dog taking a shower, can you believe it? I surely can, because it's true and it's literally in the game.\r\n\r\nEither way, I don't think you need more reasons to buy the game but I will give you another one, this game includes 4 PSN Avatars! Use them to show all your friends that you are indeed the best gamer of the gamers.","32":"Help The Egg to collect coins and power ups in this endless runner. Unlock new characters and defeat enemies.\n\nEgg Runner is a simple yet addictive game that will bring you hours of fun.","33":"Find the different bug and tag him. Perfect game to learn the differences.","34":"Join BIG O on his exciting journey through the kitchen and make him jump! Enjoy the colorful comic graphics accompanied by atmospheric music.","35":"Guided by the enigmatic moogle spirit, Jack and his allies travel to a city in another dimension. Lufenians call this place Central, and from here they monitor a myriad of worlds and dimensions. Yet for all the power and grandeur of this metropolis, it took only the mad delusions of one Lufenian to bring it all to ruin. Jack strides deep into the heart of this ghostly city to break the fetters of this karmic juggernaut once and for all.","36":"Experience virtual spring gobbler hunting at it's finest! Whether you are a turkey hunter that needs off season action or a game enthusiast that enjoys playing true to life hunting simulations 'Pro Turkey Hunting' is the fix you need. Game play centers around the four wild turkey sub-species residing in North America; easterns, osceolas, rios and marriams. Harvesting each sub-species is referred to as the 'Grand Slam' of turkey hunting. Get close to that gobbler and use your calls and decoy to lure him in. But be careful not to move too abruptly, these old gobblers have incredible eyesight! Challenge yourself and see if you have what it takes to earn the coveted 'Grand Slam'!","37":"The Gods have abandoned Midgard. Once a prosperous land teeming with mythical beasts and beings, it now rots from the inside, tainted by unknown forces. Odin's chosen guardians of the realm are gone. In their absence, the sacred Elder Tree they swore to protect is exposed to abuse and manipulation. Now, the only remnants of hope reside in Estra, the daughter of mankind's last great leader.\n\nWith a heavy emphasis on narrative, Estra's journey through Midgard is filled with Nordic lore, mysterious twists, and consequential decisions. Players will converse with a variety of characters and share in Estra's discoveries as she learns more about her family's past and the looming darkness spreading across the realm.","38":"London, 1888: The people of Whitechapel live under the ghastly shadow of Jack the Ripper, tempting Arthurian legends - Du Lac &amp; Fey - back to English shores to intervene. Will they stop Jack before more blood is spilt on the cobbled streets? Victorian London awaits you...","39":"The four nations of Wonderland meet every year to agree on shared policies and enact their various schemes against each other.\n\nYou are the White Rabbit, and your job is to organize the schedule. Every decision you make affects the destiny of Wonderland!\n\nThere are personal vendettas to resolve and enchantments hidden everywhere, and did someone mention the dreaded intruder known as Alice?\n\nEach decision you make affects the destiny of Wonderland, and political intrigue is everywhere!","40":"Your company’s success depends on your ability to run and manage a website. You must develop and improve features while increasing hosting capacity and run marketing campaigns. The city offers you offices in all sizes and shapes. It’s up to you to select the most suitable. It’s your job to organize and decorate the office while keeping your employees happy. Your employees are a vital part of your success. As you grow, you must continue recruiting more people. Over time, your employees will start demanding more of you and the company. It’s your job to keep them happy, before your competitors send them a job offer they can’t reject! There’s no website without stable and reliable servers. As your website attracts more traffic, you'll have to move from virtual servers to your own fully featured hosting center. The goal is obvious: become the biggest website in the industry. It’s up to you if you want to buy and merge your competitors or outrun them until they go out of business!","41":"Featuring 21 versions of six of the most iconic Wonder Boy games ever released, this incredible compilation brings the influential platformer series to today's hardware. Through the 1980s and 1990s the Wonder Boy series gained a vast cult following thanks to its distinct blend of energetic platforming, action-RPG elements, and even shoot 'em up gameplay. And now you can enjoy a diverse spread of the Wonder Boy games that have left a powerful legacy throughout gaming, from the 1986 arcade original to 1994's Monster World IV.\n\nWhether you're a retro devotee wanting to catch up on this important piece of gaming history, a Wonder Boy fan looking to play your favourites on cutting edge hardware or are simply looking to experience the very best in nostalgic gameplay, Wonder Boy Anniversary Collection is about as essential as it gets.","42":"In a conflict that pre-dates the formation of the Star League, Join Colonel Månsdottir and the people of Rasalhague in a fight for freedom and independence from the Great Houses, in a new 12 mission quest line. Rise of Rasalhague adds the Crusader 'Mech chassis with 11 variants, the new Rival Mercenaries feature allowing you to interact with numerous other mercenary companies and the infamous Bounty Hunter.","43":"Wally Walrus has captured his tea - 20 of Tiki Kiwi's friends from the New Zealand zoo, and if Tiki doesn't rescue them all by tea-time they'll be stuffed, served and swallowed at Wally's table. Tiki has to search Wally's domain which is just how you would expect it to be - FAT with danger! Armed only with a bow and arrow, Tiki can accumulate more weapons along the way. Beware of the malicious rabbits, boomerang throwers, deadly frogs, blood-sucking bats and many, many more villainous creatures.","44":"Bend your knees and thrust your hips -- it's time for an intense dose of hard-hitting dodgeball action! OddBallers is a hilariously charming and totally bonkers multiplayer party game where each round is a new, absurd type of dodgeball. Gather your best enemies and prepare to shave sheep with lawnmowers, tussle with tractors, slam stinky toilets -- and yes, throw dodgeballs -- to decide who's the greatest OddBallers of them all!","45":"Kitty Tom needs to go a long way to his home. However, to make your life more difficult, the blocks of land that make up the path are completely out of order. Slide blocks from the terrain to create a path that leads the kitten from point A to point B.\n\nThere are three keys in each scenario. The kitten must take all the keys to open the door that leads to the next path.\n\nTake Tom to his destination, he really needs you to get home before dark.","46":"Manage your own snack shop as you try to win love and success! Feel the characters' emotions as you listen to the Korean voice acting in this detailed visual novel.\n\nDue to financial troubles, our main character is gifted his own snack shop. But one day, a mysterious portal appears in the attic apartment, and a queen from an icy realm jumps through!\n\nHow are you going to balance love and business as the story plays out before your eyes?!","47":"Get to know the curious hobby of a kitten named Sissa! She's a very organized feline, and when she plays with her balls of wool, each needs to be pushed across the floor to the correct spot. Presented in cute and colorful 3D style, Sissa's Path is a pushing puzzle game where you play as Sissa and move her toys around tiled floors.\n\nOnce all the balls of wool rest on the white circular tiles, the stage is cleared, and another increasingly complex hand-crafted puzzle awaits to challenge Sissa's toy-nudging skills.\n\nCan you help her organize her toys?","48":"The clicking adventure you and your friends need. Eat melons with the main hero of the game The Dino R and eat all the meat in the world!","49":"In a village far, far away, a dull peasant named Rufus was living an ordinary life. Life was nice and happy in the village, until one day, awakened by some magical mistake, the Evil One started to spread his minions around town, performing hideous acts against the people. The worst of which was the kidnapping of Brunilde. She was torn from Rufus' hands and put in a prison at the Evil One's castle.\n\nDetermined to win her back, Rufus made a helmet out of a bucket and picked a broom as a weapon. Everybody now calls him the CLUNKY HERO, but he might be the only hope to defeat the evil one that no one wants to call by name. Rufus is now on his journey to save his wife and the whole village! \n\nCLUNKY HERO is a story-driven, platformer metroidvania game, with a touch of RPG and tons of humor.\n\nIf you'd love a platformer game where you have a strong storyline, can talk with characters, solve side quests, find and buy items, change weapons and wearables, with great hand-drawn-looking backgrounds, presented in a very comical way, then CLUNKY HERO might be the game of your dreams!","50":"This epic RPG is set in a medieval world on a volcanic Mediterranean island. The \"Risen\" story unfolds over four engrossing chapters and will offer multiple ways for the player to develop the story by his own actions and decisions. An innovative and intuitive user control interface will support both casual and hardcore gamers. With full world streaming support, players will have a seamless experience while playing in a fully-simulated game world with authentic, customizable characters.","51":"While the Goddesses were out responding to a distress call from the faraway PC Continent, Nepgear and the other Candidates were sent to investigate an abandoned laboratory.\n\nIt was there that they found the \"Ashen Goddess,\" who trapped them in a deep sleep capsule. By the time they awoke, 2 years had already passed.\n\nThe latest smartphone, the \"rPhone,\" dominates the market.\n\nNeptune has been missing since her mission to the PC Continent, and in the absence of its Goddess and Candidate, Planeptune was ravaged by a strange new phenomenon, the Trendi Outbreaks.\n\nSuddenly finding herself robbed of home and family, Nepgear falls into a deep depression.\n\nThis is a story about finding hope in the midst of despair, and the rebirth of a Goddess in the wake of destruction.","52":"A time travel adventure gone wrong! Brian and P.E.T. are thrown back in time after a miscalculation, to the era of pharaohs in Ancient Egypt! Evil Anubis and his minions are terrorizing the people. Without a second thought, Brian and P.E.T. rush to stop the evil pharaoh's plots! Get ready for a wild adventure across ancient Egypt full of ancient relics and mysterious artifacts. Roads of Time is the exciting casual strategy game you've been waiting for!","53":"Hashiriya Drifter - from 80-90' Japan car culture.\r\nHashiriya Drifter is the ultimate drift racing game that you always wanted to play! This immersive, epic car game also offers an update with the Nascar experience. There are dozens of cars you can choose from in this online racing game, and you need to burn rubber on the asphalt if you really want to win.\r\nYou will be playing against more than 10 million players in intense, exciting PVP races. Focus on one of the most impressive, exciting racing games out there. You get the CSR experience on steroids for free, and you also get to test your driving skills in no time. And since you can play against 20 people online at the same time, this is a very immersive and intense experience.\r\nIf you love street racing and drifting, Hashiriya Drifter is the coolest game you can play. These street racing are immersive and you have the unique opportunity to fully modify your car the way you want.\r\nThere are dozens of levels to choose from, and they all come with twists and turns to test your drifting capabilities. Your focus is to try and become the best and reach the finish line first. It s not easy to do that in this seesaw, challenging simulator game. But you need to constantly improve as you play against people which have your own skill range.\r\nIn the game you have realistic tuning for every vehicle, with more than 100 parts for a single car that you can fully customize the way you want.\r\nHashiriya Drifter offers you then best online racing experience and a cool way to drift around the horizon against people from all over the world. Do you have what it takes to become the best driver in the universe? Test out your skills against millions of other players, only with Hashiriya Drifter!","54":"The clicking adventure you and your friends need. Eat grass with the main hero of the game The Zebra Z and eat all the grass in the world!","55":"A tight action side-scroller with challenging robotic bosses. Dodge metallic dangers, acquire powerful weapons and blast your way through a destroyed world full of deadly machines where running out of energy means defeat.","56":"Rise to the challenge and join the hunt! Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.\r\n\r\nHunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying 'Wire Action' and your canine companion 'Palamute' will add exciting new layers to the already robust combat that Monster Hunter is known for.","57":"It is a dream of many to own a horse, or to bet on one, or for some to simply stroke one.\r\n\r\nNow you can, with your very own horse, well one on your TV anyway. Do what you want with it as long as it involves stroking.\r\n\r\nEnjoy your very own horse!","58":"Shoichi Sakikawa was a normal, second-year high school student. Or, he was, until he woke up from a car accident only to find himself trapped in mid-revolution 19th century France. What saved him from an onslaught of bullets was a girl armed with a sword.\n\n\"I am Napoleon Bonaparte. And one day I shall be ruler of all France.\"\n\nHaving been saved by this \"Napoleon\" in the form of a girl, Shoichi ends up accompanying her on her quest. But in this world, not only is the past distorted, but the gods grant chosen girls the gift of greatness, who in turn fight one another using superhuman abilities known as \"Apocalypse.\"\n\nWill Shoichi be able to return to his own world? And what will become of his growing bond with Napoleon?","59":"Twenty years ago, in a frightening battle you stopped Ragnar from descending upon your world, but everyone knows no peace lasts forever. Now, it's a matter of time until the evil will be stirring again. Wander into the unknown in search of the information that threatens to shake your reputation and your very existence. One phone call will send you on a journey that will not leave you unscathed.","60":"Frido is a simple game for kids and adults inspired by the popular arcade games of the 2000s. The player will have to take control of a robot that has fallen into the past and do everything to help him return home. As the game progresses, you will need to collect parts and solve simple puzzles.","61":"Flipy is chilling game with christmas atmosphere. Your goal is to stack as many blocks on top of each other as you can to achieve the highest possible score. Good Luck!","62":"Join BIG C on his exciting journey through the kitchen and make him jump! Enjoy the colorful comic graphics accompanied by atmospheric music.","63":"Enter a World War 1 first-person horror survival game where you have to survive and escape the harsh war-torn environment of the year 1917. Experience the war from the eyes of a soldier caught behind enemy lines.\r\n\r\nExplore the real chilling story as you navigate the horrors of battle, equipped with only your senses and a trench whistle. Find clues to better understand the enemy trenches without being caught and return to safety and your family.\r\n\r\nThe game relies on sounds and hearings, as you are equipped with a 'Trench Whistle' which you can use. When it's used, it will play a sound and you need to follow the sound, however - you have to be careful as the enemy can hear the whistle too and it can give out your position easily. Enemies will also be able to hear if you run, if you break anything, or even if you walk on wood as it will make a creaking noise.\r\n\r\nA HARDCORE objective-finding type first-person psychological horror survival game experience about finding and collecting clues to escape the Trenches, with gut-wrecking moments and randomized locations for clues on each take.","64":"99Seconds, a fun, retro-style video game, where you can modify time to avoid all kinds of dangers.\r\n\r\nAfter finishing off Black Eye, V-99 entered a mysterious zone called Bit 8, without knowing why V-99 could modify time!. But everything became complicated with the appearance of the BLACK VECTORS: mysterious beings that aim to destroy any intruder who reaches Bit 8.\r\n\r\n- Online Ranking!\r\n- Control V-99, dodging, using SLOW DOWN to slow !\r\n- Arcade mobility like in the classic arcade games!\r\n- 4 Players in Arcade and Survival mode!\r\n- Retro-style levels!\r\n- Incredible enemy patterns!","65":"In Rally Rock 'N Racing, you’ll enjoy a wide variety of natural environments, such as deserts, snow-covered mountains, forests... where you can show your skill at the wheel, competing against everyone to become the fastest. The game has several modes, such as Championship, Time Trial, Arcade, and 4-player multiplayer.\r\n\r\nOnline leader board where you can compare your best times with those of your friends and players from around the world.","66":"Strange rumors of the Midnight Channel slowly spread through the rural town of Inaba, the protagonist's new home, just as a chain of mysterious murders begin. As the protagonist and his teammates chase after the truth, they find themselves opening the door to another world. \r\n\r\nInaba, a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\r\n\r\nA coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one's self. \r\n\r\nWith an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.\r\n\r\nKey Features include:\r\n\r\n* Enjoy gameplay with variable framerates\r\n* Experience the world of Persona on Xbox in Full HD\r\n* Achievements \r\n* Choose between Japanese and English VO","67":"The Dark Hour, time \"hidden\" between one day and the next. Unfamiliar stillness swallows the city, people turn into eerie coffins, and otherworldly monsters called Shadows swarm. One night, the protagonist is attacked by these Shadows and the power of the heart, their Persona, is awakened.\r\n\r\nAs a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom. Will you live to see the light of day?","68":"Q.U.B.E. 10th Anniversary","69":"A girl who never wakes up. She has been fighting monsters in her dreams...\n\n\"NeverAwake\" is a nightmarish twin-stick shooter with a unique worldview and original game rules. The girl fights against vegetables, dogs, school friends, and other things she hates. What does the girl see at the end of the battle? And will she be able to wake up?\n\nWith over 80 levels, dozens of bosses, and a unique gameplay system that allows players to retry many levels, NeverAwake is suitable for both beginner shooters and experts.","70":"\"TANK FORCE\" is a shooter released by NAMCO (Bandai Namco Entertainment Inc.) in 1991. Take control of your own tank and defeat the enemies that attack your command center to clear each round. The game is over if MY TANK is destroyed. The key to victory is to select from the varied item panel situationally, using the bonus points, command center power-ups, and other items that appear in the game.","71":"Super Jumpy Ball is a simple &amp; fun 2D platform game for 1-8 players, inspired by retro platformers. Faced with clever level design and challenging obstacles, players must find their way through each level while bouncing, wall jumping, avoiding spikes and spike balls.","72":"Here is an interactive comics novel about one of the most high-profile events of the 20th century. There are many theories about what exactly happened on June 28, 1914 in Sarajevo. A deliberate attempt? A tragic accident? Masonic conspiracy?\r\n\r\nThe Bosnian Serb Gavrilo Princip killed the heir to the Austro-Hungarian throne, Franz Ferdinand, which became a formal reason to start the first world war of its kind ... But who was Princip and what led him to this act? Who was Franz Ferdinand and how did he meet that fateful day? What do they have in common and could war have been avoided?\r\n\r\nInside the game you will find answers to these questions, as well as the majestic interiors of Austria-Hungary and the nature of the Balkan Peninsula from the pen of Askold Akishin, one of the greatest comics artists.","73":"Tortuga - a Pirate's Tale tells the journey of a pirate captain with a lust for gold and glory who assumes command of a fleet of pirate ships to strike the Caribbean.\n\nCustomize your own Flag under which your fleet will sail. As you gain experience, your notoriety and skills will improve. Roleplay with more than 35 distinct pirate's skills on your way to claim your pirate throne.\n\nFight in tactical turn-based naval battles on a hexagonal grid of epic proportions. Use your wits when raiding a convoy or a settlement. Victory is determined by a clever combination of your ship's distinct armament with the varying and rough conditions of the sea.","74":"A Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\n\nFollow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.","75":"It is the 23rd century. EDEN, the massive virtual reality network witch helped humankind to flourish, suddenly severed all contact with the outside world...Leaving the minds of its 100 million users trapped inside.\n\nA covert special task force known as \"Saviours\" has been called in to address the situation. Using special attack programs modeled after fighter jets, they plan to delve into the deepest cores of EDEN and find who or what has set it haywire.\n\nA refreshing and highly re-playable bullet hell style shooter that WANTS you to play dangerously! Ride the razor's edge of life and death in this high-risk high-reward danger oriented arcade style shooting game.","76":"Play as Liao Tianding (AKA. Liau Thiam-Ting), vigilante of Taipei city and wanted by the Colonial Japanese authorities. Rob the rich, feed the poor, and fight for justice in the streets of early 20th century Taipei as Taiwan's legendary outlaw.\n\nBased on real events, real people and real situations, The Legend of Tianding is an exploration of a place and time often overlooked and presented in the style of Traditional Chinese Manga.\n\nBattle the colonial authorities in style with a tanto, waist sash, and fast paced Kung Fu in tightly tuned technical combat. Execute advanced aerial combos, steal weapons from your enemies, use your waist sash and grappling hook to fly around the battlefield, and strike fear into the hearts of your oppressors.\n\nTake on incredible bosses like deadly courtesans, greedy businessmen, and even military leaders, each one guaranteed to challenge you with their dynamic abilities and brutal attacks.","77":"GOLF FOR THE PEOPLE.\r\nHot Shots Golf's award-winning gameplay returns.\r\n- 13 golfers who'd probably under-tip the valet\r\n- 7 glorious courses\r\n- All new Tournament Mode\r\n- Equipment upgrades for the true fanatic\r\n- Unrivaled 3D graphics\r\n\"THE BEST GOLF GAME EVER MADE JUST GOT BETTER.\" --PS Extreme","78":"THE MIGHTY JABBA ASKS THAT YOU DIE HONORABLY\r\n\r\nTotal vehicular mayhem: special attacks and 4 game modes including tournament and high stakes.\r\n\r\nBlast your way to victory with an arsenal that includes laser cannons, proton torpedos and concussion missiles.\r\n\r\nWinner takes all in 8 intense arenas with over 10 Star Wars vehicles to choose from.","79":"AGENCY MISSION BRIEFING\r\nWANTED\r\nStop Gabe Logan! -Agency Director\r\n- Operates with classified weapons such as an X-ray gun, explosive round shotguns, nightvision rifle, laser and proximity mines.\r\n- Currently located within 19 intense, international environments as he attempts to save the world from viral terror.\r\n- Combats enemies with assistance from Lian Xing and other skilled agents.\r\n- Battle tests espionage skills in all new mini games and enhanced 2 player mode.","80":"Mrs.Cat Between Worlds is set in cute and deadly fantasy versions of the planets Mars and Neptune.\r\n\r\nIn this 2D precision platformer series, you have to master the skill of jumping with different amounts of gravity, as well as other special space cat movement techniques.\r\n\r\nYou’ll need to avoid dangers, collect shiny energy gems, and ultimately make it to the exit to warp to the next level.","81":"Protect space against the last wave of an enemy that used to be mankind's ally: a mysterious intelligent artificial life form. Take control of enhanced trainee pilot Aya, or the mysterious veteran pilot Zarak and fight your way through waves of enemies in order to save mankind and to learn more about yourself and also about your enemy.\n\nWings Of Bluestar is a horizontal hand painted and frame by frame animated HD game, no photobashing, 3D nor pre-rendered assets are used. Every asset is hand crafted and detailed by the same artist, which gives the game its visual integrity.","82":"Join the elite pilots of the US NAVY and attack the ships threatening your fleet. From your aircraft carrier, hunt down enemy battleships and win the naval battle.\n\nYou will play with modern warships and jet fighter in combats that enhance the player experience for better maneuvers against the best naval machines.","83":"Hyper Gunsport is cyberpunk volleyball with guns - it's all about that hot arcade action! You can play 2v2 or 1v1, with a co-op and single player circuit mode as well. Each of the 7 teams has a light story, unique weapons, and a stage with its own gimmick. As you progress, new rulesets change the game, and there's an unlockable AI mode as well. This is a hardcore action game, but we are hardcore about our accessibility options too, ensuring the game is playable by anyone.","84":"Evil has been vanquished. Peace has returned to Ancardia, and the peasants dare to dream once more of prosperity. Seven very different factions vie for control over the cataclysmic aftermath left behind by Andor Drakon's defeat. And somewhere, deep down in an inhospitable cave, ChAoS is stirring again.\n\nPick up your blade, prepare your spells, check your daggers and ready your bow, for you are about to enter the ominous Caverns of Chaos. Choose your allegiance carefully, for you are nothing more than an expendable asset to the masters you choose.\n\nFight for a mercenary's glory and purse, for the justice of a folk in decline, for the light of purity or even for ChAoS itself.","85":"Join BIG S on his exciting journey through the kitchen and make him jump! Enjoy the colorful comic graphics accompanied by atmospheric music.","86":"Hunt down monsters to cook and eat them! You've been revived in a massive underground complex and you must leave this bizarre facility. Aided by the undead Necro-Chef Simmer, you must stay safe, get fed and find a way to get out.\n\nDungeon Munchies is a side-scrolling action RPG with a focus on hunting down creatures, cooking them, and eating dishes to gain certain abilities. The combination of dishes you choose to eat will impact your entire play style.","87":"In 1927, Aurora Aylesworth, a young 19-year-old astronomer, sets out on a journey to find her father, who disappeared four years earlier while investigating the remains of a spaceship that fell to Earth in 1908, the Eureka, from which peculiar beings called robotos emerged and who now live integrated, in their own way, into society.\n\nBut Aurora will not be alone in her journey; she will have the help of her faithful Lackey, a roboto who has been with her since she was a child, as well as other friends and people she will meet during her travels.\n\nShe will have to face the dangerous brainless, deformed and unintelligent versions of the peaceful robotos, who, for some reason, seem to want to prevent Aurora from completing her goal.\n\nJoin Aurora and the Lackey in this side-scrolling adventure with shooter and platformer mechanics, various mini-games and 3D graphics.","88":"Join this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and Tales of series.\n\nDuring their voyage, the Straw Hats, led by Monkey D. Luffy are swallowed by a huge storm at sea. They end up on a mysterious island full of nature amidst the storm and become separated from each other. The crew sets out on a new adventurous journey filled with wonders of a raging nature, powerful enemies, and strange encounters with island locals.\n\nWork together with Luffy and his crew to set sail once again!","89":"In the dead of night a fierce storm rages across North Wales. Miles from any town, Chris Selwood seeks refuge in a remote roadside cafe. Shortly thereafter Chris experiences a horrific sight as he finds the cafe waitress pinned to the ceiling by something with fierce glowing eyes, he passes out waking up to the dusty old abandoned remains of the café.\n\nExplore the untouched wilderness of rural Wales as you uncover the forgotten remains of a mysterious facility and try to piece together what happened to the missing villagers of Hearth.\n\nInspired by 80s Sci-Fi horror and contemporary surrealist cinema, Chasing Static delivers a unique take on the narrative adventure genre through new audio driven gameplay mechanics and non-linear exploration.","90":"Breakers Collection features both of the original games (Breakers and Breakers Revenge) and a brand new content for the cult-classic among the fans of Fighting Games, that was first released in 1996 for the Neogeo and Arcades and after released with a sequel in 1998 with additional playable characters, balance adjustments and new gameplay elements.\n\nBreakers Collection is a simple action-fighting game, with a rooster with many playable characters (10 in Breakers Revenge), that were all known by the fans from around the world.\n\nThe collection version, the player will have more features and modes, like online versus mode - Rollback Netcode (GGPO) -, Art gallery and the most requested one, the training mode.","91":"\"SENJYO\" is a shooting game released by TEHKAN (KOEI TECMO GAMES) in 1983. Use the radar search at the bottom of the screen to destroy Space Tanks approaching from 360 degrees with your own twin laser cannons. Destroy 32 Space Tanks to advance to the next round.","92":"In the distant future, humans no longer exist. Now, robots rule the world. You wake up in a ruined site and have no memory of what happened to you, facing an unknown world and enemies.\n\nFight your way through the Tower to find the truth.\n\nFight of Steel: Infinity Warrior is a new fighting game with ultimate freedom. Players will have the opportunity to customize their own fighter from the appearance to fighting moves.","93":"MEME ANIMALS STRIKE AGAIN!!\n\nFight of Animals: Arena is Digital Crafter's newest BRAWLER GAME!\nLet the meme battle goes into NEXT LEVEL!! In \"Fight of Animals: Arena\" you get to play all the Animals from the previous 1 on 1 fighting game \"Fight of Animals\" and more! With varied stages, items and support up to 4 players local and online, \"Fight of Animals: Arena\" will bring you a brand new Brawler experience!! Let the fight begin!!\n\nEXPERIENCE THE FUN WITH NO IMPUT STRUGGLE!\n\nThe fun should not get stopped by complicate controls! \"Fight of Animals: Arena\" is SUPER EASY to play! The game only requires 4 buttons and direction inputs! you will be a fighter right away without worrying how to do all the moves! Also, with the new Double Jump and Dash\/Evade features, it will bring the whole game play into more intense and exciting level!\n\nWE GOT ITEMS AND WEAPONS!!\n\nYes, that's right! We got items and weapons in \"Fight of Animals: Arena\". You can throw them, and swipe them to whoever getting your way, even eat them!? \n\nThe bush you can hide inside, falling ice cone from the top, mystery portaletc\n\nWATCH OUT FOR THE TRAPS!\nEach stage comes with different environment and variant kind of traps!! For example, the swamp that slow you down, iceberg that make you slide around or even a bush you can hide in it!?\n\nSUPPORT UP TO 4 PLAYERS!! LOCAL AND ONLINE!\nThat's right, \"Fight of Animals: Arena\" is a brawler game which\nsupport 4 players local and ONLINE!\nPlayers can select severs around your location and experience our stable high quality rollback online netcode. More than that, Digital Crafter has enhanced the online room feature to make online matching even easier for everyone! \n\nBECOME THE KING OF THE ANIMALS\nChoose your main and get to know the stages and traps, become the king of all the animals! Let's roll!!","94":"Race against your enemies in this harbour. Pay attention to your environment and win the race by forcing your enemy to get out of the track.","95":"The Burrow of the Fallen Bear's seal is getting weaker and adventurers from the Furland Kingdom are coming to explore the house of one of the most fearful and violent assailants of the story. Now, Krile, a young adventurer, will live his first adventure to show everyone why he should be chosen to save the Furry Heroes.\n\nA gay furry visual novel, full of fantasy and RPG elements. Experience Krile's journey before he saves the Furry Heroes, Meet 3 unique hot adventurers, Fight with them, Buy items that impact your story, Unlock branches, Explore the Fallen Bear's burrow. Everything through a classic choice system.","96":"Congrats on becoming the newest hire of Salamander County's public TV station! Unfortunately, everyone in the county suddenly disappeared, except for you, your boss, and another employee. The show must go on, so with your new job title of Professional Thing-Doer, it's up to you to do all of the activities that need to be filmed for the TV station. \r\n\r\nYou should probably try and figure out why everyone disappeared in the first place, too.","97":"Yuri is a young man who has recently started working as a guard. After a long absence, he has returned home, but a series of dramatic events disturbs the tranquility of the village as people begin to mysteriously die off. Yuri is asked to investigate, but he quickly finds out that the problem is bigger than he initially thought.\n\nThrough your choices, his story will be told!\n\nSuhoshin is a 2D Visual Novel set in the medieval Joseon period of Korea. While investigating a series of mysterious murders, you will have to make choices that will lead you down different paths toward different endings.","98":"Vengeful Guardian: Moonrider is a side-scrolling action platformer that channels the golden age of classic 16-bit action games in a full-throttle quest for revenge.\r\n\r\nREVENGE OF THE MOONRIDER\r\n\r\nIn the oppressed world of Vengeful Guardian: Moonrider, humanity finds an unlikely hero. After building an army of super soldiers as weapons of war, the authoritarians unwittingly seal their own fates by bringing online the ninja warrior known as Moonrider. Conceived as a tool to preserve the totalitarian state, the Moonrider instead rejects its intended purpose and wages a relentless battle for vengeance against its creators and fellow super soldiers.\r\n\r\nGEAR UP AND PREPARE TO BATTLE YOUR CREATORS\r\n\r\nThe design of Vengeful Guardian: Moonrider puts the best classic action-game elements in the laser-precise sights of its starring ninja, ensuring snappy, responsive combat that’s supremely challenging.\r\n\r\nPowerful modifier chips are hidden and guarded throughout the adventure, allowing you to customize the Moonrider’s fighting style while gaining killer advantages and abilities.","99":"Unlike her sister, Elena never dreamed of elegant weddings or luxurious clothes. Even as the chief maid-of-honor, she preferred exploring dark caves to mingling at elegant parties. But Elena is in for the adventure of a lifetime when the crown prince goes missing during a search and rescue mission for the queen's favorite corgi! And this time, she has reason to suspect foul play! Join Elena in her quest to find the missing prince through an alternate history version of the Victorian era in this exciting time management adventure!","100":"Accompany Lucy and her friends in this grim, beautifully hand-drawn adventure game. Lucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play. People disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or so she thinks. Children of Silentown is a point &amp; click adventure game telling a mysterious and endearing story. Explore the town and its dangerous surroundings, meet its quirky inhabitants, solve puzzles and master minigames. Accompany Lucy on her adventure to get to the bottom of what is haunting the strange Silentown... if you dare."},"Link":{"1":"www.metacritic.com\/game\/playstation-4\/the-redress-of-mira","2":"www.metacritic.com\/game\/playstation-4\/prison-tycoon-under-new-management","3":"www.metacritic.com\/game\/playstation-4\/dicey-dungeons","4":"www.metacritic.com\/game\/playstation-4\/quiz-thiz-spain","5":"www.metacritic.com\/game\/playstation-4\/dodge-the-ball","6":"www.metacritic.com\/game\/playstation-4\/helvetii","7":"www.metacritic.com\/game\/playstation-4\/pets-at-work","8":"www.metacritic.com\/game\/playstation-4\/pirated-code-admin-edition","9":"www.metacritic.com\/game\/playstation-4\/prison-simulator","10":"www.metacritic.com\/game\/playstation-4\/offroad-moto-bike","11":"www.metacritic.com\/game\/playstation-4\/delirium","12":"www.metacritic.com\/game\/playstation-4\/puzzle-bobble-2x-bust-a-move-2-arcade-edition-puzzle-bobble-3-bust-a-move-3-s-tribute","13":"www.metacritic.com\/game\/playstation-4\/deliver-us-mars","14":"www.metacritic.com\/game\/playstation-4\/exitman-deluxe","15":"www.metacritic.com\/game\/playstation-4\/fashion-police-squad","16":"www.metacritic.com\/game\/playstation-4\/arcade-archives-phelios","17":"www.metacritic.com\/game\/playstation-4\/albacete-warrior","18":"www.metacritic.com\/game\/playstation-4\/beveron","19":"www.metacritic.com\/game\/playstation-4\/rhythm-sprout","20":"www.metacritic.com\/game\/playstation-4\/row-of-numbers","21":"www.metacritic.com\/game\/playstation-4\/astro-suzy-go-to-the-beach!","22":"www.metacritic.com\/game\/playstation-4\/powerwash-simulator","23":"www.metacritic.com\/game\/playstation-4\/raiden-iv-x-mikado-remix","24":"www.metacritic.com\/game\/playstation-4\/straylight","25":"www.metacritic.com\/game\/playstation-4\/we-were-here-forever","26":"www.metacritic.com\/game\/playstation-4\/powerwash-simulator-tomb-raider-special-pack","27":"www.metacritic.com\/game\/playstation-4\/spongebob-squarepants-the-cosmic-shake","28":"www.metacritic.com\/game\/playstation-4\/season-a-letter-to-the-future","29":"www.metacritic.com\/game\/playstation-4\/gnomes-garden-return-of-the-queen","30":"www.metacritic.com\/game\/playstation-4\/backfirewall_","31":"www.metacritic.com\/game\/playstation-4\/buy-the-game-i-have-a-gun--sheesh-man","32":"www.metacritic.com\/game\/playstation-4\/egg-runner","33":"www.metacritic.com\/game\/playstation-4\/find-the-bug","34":"www.metacritic.com\/game\/playstation-4\/the-jumping-onigiri","35":"www.metacritic.com\/game\/playstation-4\/stranger-of-paradise-final-fantasy-origin---different-future","36":"www.metacritic.com\/game\/playstation-4\/pro-turkey-hunting","37":"www.metacritic.com\/game\/playstation-4\/atone-heart-of-the-elder-tree","38":"www.metacritic.com\/game\/playstation-4\/dance-of-death-du-lac-fey","39":"www.metacritic.com\/game\/playstation-4\/wonderland-nights-white-rabbits-diary","40":"www.metacritic.com\/game\/playstation-4\/startup-company-console-edition","41":"www.metacritic.com\/game\/playstation-4\/wonder-boy-anniversary-collection","42":"www.metacritic.com\/game\/playstation-4\/mechwarrior-5-mercenaries---rise-of-rasalhague","43":"www.metacritic.com\/game\/playstation-4\/arcade-archives-the-new-zealand-story","44":"www.metacritic.com\/game\/playstation-4\/oddballers","45":"www.metacritic.com\/game\/playstation-4\/cat-slide-tiles","46":"www.metacritic.com\/game\/playstation-4\/miracle-snack-shop","47":"www.metacritic.com\/game\/playstation-4\/sissas-path","48":"www.metacritic.com\/game\/playstation-4\/the-dino-r","49":"www.metacritic.com\/game\/playstation-4\/clunky-hero","50":"www.metacritic.com\/game\/playstation-4\/risen","51":"www.metacritic.com\/game\/playstation-4\/neptunia-sisters-vs-sisters","52":"www.metacritic.com\/game\/playstation-4\/roads-of-time","53":"www.metacritic.com\/game\/playstation-4\/hashiriya-drifter---car-drift-racing-simulator","54":"www.metacritic.com\/game\/playstation-4\/the-zebra-z","55":"www.metacritic.com\/game\/playstation-4\/omegabot","56":"www.metacritic.com\/game\/playstation-4\/monster-hunter-rise","57":"www.metacritic.com\/game\/playstation-4\/stroke-the-horse","58":"www.metacritic.com\/game\/playstation-4\/napoleon-maiden-episode1-a-maiden-without-the-word-impossible","59":"www.metacritic.com\/game\/playstation-4\/demon-hunter-new-chapter","60":"www.metacritic.com\/game\/playstation-4\/frido","61":"www.metacritic.com\/game\/playstation-4\/flipy","62":"www.metacritic.com\/game\/playstation-4\/the-jumping-chocolate","63":"www.metacritic.com\/game\/playstation-4\/trenches","64":"www.metacritic.com\/game\/playstation-4\/99-seconds","65":"www.metacritic.com\/game\/playstation-4\/rally-rock-n-racing","66":"www.metacritic.com\/game\/playstation-4\/persona-4-golden","67":"www.metacritic.com\/game\/playstation-4\/persona-3-portable","68":"www.metacritic.com\/game\/playstation-4\/qube-10th-anniversary","69":"www.metacritic.com\/game\/playstation-4\/neverawake","70":"www.metacritic.com\/game\/playstation-4\/arcade-archives-tank-force","71":"www.metacritic.com\/game\/playstation-4\/super-jumpy-ball","72":"www.metacritic.com\/game\/playstation-4\/a-matter-of-principle","73":"www.metacritic.com\/game\/playstation-4\/tortuga---a-pirates-tale","74":"www.metacritic.com\/game\/playstation-4\/a-space-for-the-unbound","75":"www.metacritic.com\/game\/playstation-4\/graze-counter-gm","76":"www.metacritic.com\/game\/playstation-4\/the-legend-of-tianding","77":"www.metacritic.com\/game\/playstation-4\/hot-shots-golf-2","78":"www.metacritic.com\/game\/playstation-4\/star-wars-demolition","79":"www.metacritic.com\/game\/playstation-4\/syphon-filter-3","80":"www.metacritic.com\/game\/playstation-4\/mrscat-between-worlds","81":"www.metacritic.com\/game\/playstation-4\/wings-of-bluestar","82":"www.metacritic.com\/game\/playstation-4\/us-navy-sea-conflict","83":"www.metacritic.com\/game\/playstation-4\/hyper-gunsport","84":"www.metacritic.com\/game\/playstation-4\/ultimate-adom---caverns-of-chaos","85":"www.metacritic.com\/game\/playstation-4\/the-jumping-salad","86":"www.metacritic.com\/game\/playstation-4\/dungeon-munchies","87":"www.metacritic.com\/game\/playstation-4\/auroras-journey-and-the-pitiful-lackey","88":"www.metacritic.com\/game\/playstation-4\/one-piece-odyssey","89":"www.metacritic.com\/game\/playstation-4\/chasing-static","90":"www.metacritic.com\/game\/playstation-4\/breakers-collection","91":"www.metacritic.com\/game\/playstation-4\/arcade-archives-senjyo","92":"www.metacritic.com\/game\/playstation-4\/fight-of-steel-infinity-warrior","93":"www.metacritic.com\/game\/playstation-4\/fight-of-animals-arena","94":"www.metacritic.com\/game\/playstation-4\/reckless-auto-racing","95":"www.metacritic.com\/game\/playstation-4\/burrow-of-the-fallen-bear-a-gay-furry-visual-novel","96":"www.metacritic.com\/game\/playstation-4\/salamander-county-public-television","97":"www.metacritic.com\/game\/playstation-4\/suhoshin","98":"www.metacritic.com\/game\/playstation-4\/vengeful-guardian-moonrider","99":"www.metacritic.com\/game\/playstation-4\/crown-of-the-empire-around-the-world","100":"www.metacritic.com\/game\/playstation-4\/children-of-silentown"},"Release":{"1":"February 8, 2023","2":"February 7, 2023","3":"February 6, 2023","4":"February 4, 2023","5":"February 4, 2023","6":"February 3, 2023","7":"February 3, 2023","8":"February 3, 2023","9":"February 3, 2023","10":"February 3, 2023","11":"February 3, 2023","12":"February 2, 2023","13":"February 2, 2023","14":"February 2, 2023","15":"February 2, 2023","16":"February 2, 2023","17":"February 1, 2023","18":"February 1, 2023","19":"February 1, 2023","20":"February 1, 2023","21":"January 31, 2023","22":"January 31, 2023","23":"January 31, 2023","24":"January 31, 2023","25":"January 31, 2023","26":"January 31, 2023","27":"January 31, 2023","28":"January 31, 2023","29":"January 30, 2023","30":"January 30, 2023","31":"January 29, 2023","32":"January 28, 2023","33":"January 28, 2023","34":"January 27, 2023","35":"January 27, 2023","36":"January 27, 2023","37":"January 27, 2023","38":"January 27, 2023","39":"January 27, 2023","40":"January 26, 2023","41":"January 26, 2023","42":"January 26, 2023","43":"January 26, 2023","44":"January 26, 2023","45":"January 26, 2023","46":"January 26, 2023","47":"January 25, 2023","48":"January 25, 2023","49":"January 25, 2023","50":"January 24, 2023","51":"January 24, 2023","52":"January 23, 2023","53":"January 21, 2023","54":"January 21, 2023","55":"January 20, 2023","56":"January 20, 2023","57":"January 20, 2023","58":"January 20, 2023","59":"January 20, 2023","60":"January 20, 2023","61":"January 20, 2023","62":"January 20, 2023","63":"January 20, 2023","64":"January 20, 2023","65":"January 20, 2023","66":"January 19, 2023","67":"January 19, 2023","68":"January 19, 2023","69":"January 19, 2023","70":"January 19, 2023","71":"January 19, 2023","72":"January 19, 2023","73":"January 19, 2023","74":"January 19, 2023","75":"January 18, 2023","76":"January 17, 2023","77":"January 17, 2023","78":"January 17, 2023","79":"January 17, 2023","80":"January 17, 2023","81":"January 17, 2023","82":"January 13, 2023","83":"January 13, 2023","84":"January 13, 2023","85":"January 13, 2023","86":"January 13, 2023","87":"January 13, 2023","88":"January 13, 2023","89":"January 12, 2023","90":"January 12, 2023","91":"January 12, 2023","92":"January 12, 2023","93":"January 12, 2023","94":"January 12, 2023","95":"January 12, 2023","96":"January 12, 2023","97":"January 12, 2023","98":"January 12, 2023","99":"January 11, 2023","100":"January 11, 2023"}}