{"Titles":{"1":"The Redress of Mira","2":"Cube Farmer","3":"Prizma Puzzle Prime","4":"Peachy Boy","5":"Hogwarts Legacy","6":"Prison Tycoon: Under New Management","7":"Heirs of the Kings","8":"Speedway Racing","9":"Pets at Work","10":"Debtor: Enhanced Edition","11":"Deliver Us Mars","12":"The Pathless","13":"Fashion Police Squad","14":"Kattish","15":"Albacete Warrior","16":"Rhythm Sprout","17":"Inkulinati","18":"Raiden IV x Mikado Remix","19":"PowerWash Simulator: Tomb Raider Special Pack","20":"Age of Empires II: Definitive Edition","21":"We Were Here Forever","22":"Backfirewall_","23":"Roboquest","24":"Wonderland Nights: White Rabbit's Diary","25":"Stranger of Paradise: Final Fantasy Origin - Different Future","26":"GoldenEye 007","27":"Dead Space","28":"The Witcher 3: Wild Hunt - Complete Edition","29":"Startup Company: Console Edition","30":"Shoulders of Giants","31":"MechWarrior 5: Mercenaries - Rise of Rasalhague","32":"THE Table Game Deluxe Pack","33":"OddBallers","34":"Transiruby","35":"Marvel's Midnight Suns - The Good, the Bad, and the Undead","36":"Sissa's Path","37":"LoBlocks","38":"Hi-Fi Rush","39":"World War Z: Aftermath","40":"Trenches","41":"Monster Hunter Rise","42":"Demon Hunter: New Chapter","43":"Deep Space Anomaly","44":"A Space For The Unbound","45":"Persona 3 Portable","46":"Persona 4 Golden","47":"Tortuga - A Pirate's Tale","48":"Colossal Cave","49":"Graze Counter GM","50":"Wings of Bluestar","51":"RE:CALL","52":"Mrs.Cat Between Worlds","53":"Dragon Ball Z: Kakarot","54":"Ballotron Oceans","55":"One Piece Odyssey","56":"Space Raiders in Space","57":"Chasing Static","58":"Salamander County Public Television","59":"Breakers Collection","60":"Children of Silentown","61":"We Are The Caretakers","62":"Neon Souls","63":"8-Ball Pocket","64":"Hyper Gunsport","65":"Headbangers in Holiday Hell","66":"Sail Forth","67":"Crossovers by POWGI","68":"Space Accident","69":"Wave Break","70":"Them's Fightin' Herds - Additional Character #1 Texas","71":"It's Kooky","72":"HEROish","73":"Panda Punch","74":"Crime Secrets: Crimson Lily","75":"Vampire Survivors: Legacy of the Moonspell","76":"GRIME","77":"Cassiodora","78":"Blacktail","79":"Beholder 3","80":"Tetraminos","81":"Brick Breaker","82":"Mahjong (2016)","83":"River City Girls 2","84":"Raptor Boyfriend: A High School Romance","85":"Broken Lines","86":"Potion Craft: Alchemist Simulator","87":"Doctor Who: The Edge of Reality + The Lonely Assassins","88":"GRIS","89":"High on Life","90":"Crisis Core: Final Fantasy VII Reunion","91":"Wavetale","92":"Jitsu Squad","93":"Petite Adventure","94":"Terror of Hemasaurus","95":"Afterglitch","96":"Chained Echoes","97":"Dad's Monster House","98":"Jurassic World Evolution 2: Dominion Malta Expansion","99":"Mech Armada","100":"The Rumble Fish 2"},"Platform":{"1":"Xbox Series X","2":"Xbox Series X","3":"Xbox Series X","4":"Xbox Series X","5":"Xbox Series X","6":"Xbox Series X","7":"Xbox Series X","8":"Xbox Series X","9":"Xbox Series X","10":"Xbox Series X","11":"Xbox Series X","12":"Xbox Series X","13":"Xbox Series X","14":"Xbox Series X","15":"Xbox Series X","16":"Xbox Series X","17":"Xbox Series X","18":"Xbox Series X","19":"Xbox Series X","20":"Xbox Series X","21":"Xbox Series X","22":"Xbox Series X","23":"Xbox Series X","24":"Xbox Series X","25":"Xbox Series X","26":"Xbox Series X","27":"Xbox Series X","28":"Xbox Series X","29":"Xbox Series X","30":"Xbox Series X","31":"Xbox Series X","32":"Xbox Series X","33":"Xbox Series X","34":"Xbox Series X","35":"Xbox Series X","36":"Xbox Series X","37":"Xbox Series X","38":"Xbox Series X","39":"Xbox Series X","40":"Xbox Series X","41":"Xbox Series X","42":"Xbox Series X","43":"Xbox Series X","44":"Xbox Series X","45":"Xbox Series X","46":"Xbox Series X","47":"Xbox Series X","48":"Xbox Series X","49":"Xbox Series X","50":"Xbox Series X","51":"Xbox Series X","52":"Xbox Series X","53":"Xbox Series X","54":"Xbox Series X","55":"Xbox Series X","56":"Xbox Series X","57":"Xbox Series X","58":"Xbox Series X","59":"Xbox Series X","60":"Xbox Series X","61":"Xbox Series X","62":"Xbox Series X","63":"Xbox Series X","64":"Xbox Series X","65":"Xbox Series X","66":"Xbox Series X","67":"Xbox Series X","68":"Xbox Series X","69":"Xbox Series X","70":"Xbox Series X","71":"Xbox Series X","72":"Xbox Series X","73":"Xbox Series X","74":"Xbox Series X","75":"Xbox Series X","76":"Xbox Series X","77":"Xbox Series X","78":"Xbox Series X","79":"Xbox Series X","80":"Xbox Series X","81":"Xbox Series X","82":"Xbox Series X","83":"Xbox Series X","84":"Xbox Series X","85":"Xbox Series X","86":"Xbox Series X","87":"Xbox Series X","88":"Xbox Series X","89":"Xbox Series X","90":"Xbox Series X","91":"Xbox Series X","92":"Xbox Series X","93":"Xbox Series X","94":"Xbox Series X","95":"Xbox Series X","96":"Xbox Series X","97":"Xbox Series X","98":"Xbox Series X","99":"Xbox Series X","100":"Xbox Series X"},"RatingMC":{"1":"None","2":"None","3":"None","4":"None","5":"89","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"75","14":"None","15":"None","16":"75","17":"None","18":"None","19":"None","20":"87","21":"81","22":"83","23":"None","24":"None","25":"None","26":"None","27":"89","28":"94","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"88","39":"None","40":"None","41":"86","42":"None","43":"None","44":"None","45":"87","46":"90","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"78","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"81","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"83","91":"75","92":"None","93":"None","94":"None","95":"None","96":"88","97":"None","98":"None","99":"None","100":"None"},"UserRating":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"6.8","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"6.3","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"5.3","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"6.5","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"Summary":{"1":"\"Seeing how serious her mother was about keeping it a secret made Mira understand just how sensitive what she was about to tell her was. 'I promise,' Mira said solemnly.\"\n\nWith a variety of gameplay mechanics, venture through Mira's fantasy world filled with atmosphere and adventure, and pursue her inner peace. Uncover her past with the help of written books; witness events before she embarked.\n\nIn the daytime, travel through nature and man-made ruins; pass through magic gates with the aid of a mana-filled staff. In the nighttime, experience the horror of Mira's short nightmares.","2":"Embark on this memorable experience with a great and relaxing soundtrack and a beautiful view that will get you extremely satisfied.\n\nYou are responsible for irrigating the plantation on the islands. To do that, put the water cubes correctly in the indicated position to make the crops grow healthily.","3":"Tile-based puzzle game with smooth and addictive gameplay, old-school isometric graphics and excellent music. The player's task is to connect nodes which have various functions.\n\nThe original Prizma Puzzle web games were released from 2009 to 2011 and included 4 games. They have been played hundreds of millions of times online.\n\nPrizma Puzzle Prime includes content from past games, new elements, enhanced graphics, visual and sound effects.","4":"This cute looking puzzle game is as hard as it looks cute.\n\nCan you beat the challenging 30 levels?\n\nEach level is specially designed. You have to collect the key and pass the level, but be careful! Stones and thorns are not very safe.\n\nBut don't be afraid of algae. You can hold on to them.","5":"LIVE THE UNWRITTEN - Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and new locations as you explore and discover fantastic beasts, customize your character and craft potions, master spell casting, upgrade talents, and become the wizard you want to be.\r\n\r\nExperience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. You have received a late acceptance to the Hogwarts School of Witchcraft and Wizardry and soon discover that you are no ordinary student: you possess an unusual ability to perceive and master Ancient Magic. Only you can decide if you will protect this secret for the good of all, or yield to the temptation of more sinister magic.\r\n\r\nDiscover the feeling of living at Hogwarts as you make allies, battle Dark wizards, and ultimately decide the fate of the wizarding world. Your legacy is what you make of it.","6":"Plan and build your own prison from the ground up! Secure government grants, hire guards and staff and begin welcoming new prisoners in this reboot of the Prison Tycoon franchise.\n\nThe goal of a good Warden is not to punish their prisoners, it's to rehabilitate them into productive members of society. In Under New Management, each inmate must work through their own issues that landed them in prison, and it's your job to provide them with the help they need to get healthy.\n\n\"Prison Tycoon : Under New Management\" is looking for a good Warden. Are you up for the job?","7":"Laura, a girl who has lost her memory, and a mysterious pursuer.\nGrant, a young man, happens to come across Laura, and, in order to protect her, becomes separated from his father.\n\nGrant's father seems to know something about this mystery. With the words of his father ringing in his heart, Grant's journey begins, for Laura, and to save the world from danger!\n\nStrengthen Abilities with Soul Maps\nEach character has their own unique Soul Map. You can select and strengthen abilities as you desire. Soul maps expand alongside character growth. Develop the party members' abilities just as you wish!\n\nWeapon Customization and Arenas\nThe game is full of satisfying content! Collect material to customize your weapons. Test your strength at one of the Arenas!\n\nTheme Song\nThe game features a theme song sung by Eri Kitamura, famous as a voice actor in Japanese animation!","8":"In Speedway Racing, you will enjoy the fastest, most spectacular races at over 230 Mph, avoiding multiple collisions against 20 rivals.\n\nThere are several modes available, including Championship, Arcade and 4-player multiplayer.\n\nThere is also an online leader board where you can compare your best times with those of your friends and players from around the world.","9":"Some pets got lost from their owners in an office and now need to work together, using boxes, mats, buttons, climb on shelves and tables or just make a mess trying to find them in this colorful co-op game!","10":"There was a debtor in the world. Once he became very ill and he lost consciousness. While the ambulance was going to the hospital, he woke up in a strange place. In that strange place, one of the inmates explained that those who have unsuccessful assignments come here. Our hero's unfulfilled task was to collect all his debts.\n\nThe task of the hero to go through 30 levels and collect all the coins, while guarding at the same time clever traps and ruthless enemies. In addition to all, each task is given a dedicated time, which will play against you! To solve all his problems, our hero has a hard forehead with which he can break blocks, well, as well as explosives, with which you can get rid of enemies. Push the boxes, clear your way, solve small puzzles to achieve the goal in the form of an opening door leading to the next level.","11":"Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward.","12":"From the creators of ABZÛ, The Pathless is the mythic adventure of an archer and an eagle in a vast forest.\n\nExplore an open world and travel to a mystical island to dispel a curse of darkness that grips the world. Together with your eagle companion, discover the history of the island, and fight epic battles to restore light to the land.","13":"Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!\n\nFashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!","14":"Our main character is a very sweet cat, but she has to pass these levels quickly.\n\nAre you ready to pass the challenging levels with plain graphics? It's not as easy as it looks. Each section has different mechanics from each other. You need to understand these mechanics and pass the level.","15":"Albacete Warrior is a satirical combat game where you take on the role of Benito Waters, ninja from Albacete, Spain, in his worldwide adventure on an important task given to him by his master, Paco sensei. With his trusty companion, friend and also main weapon, Pepito the chicken, cockslap waves of enemies whose only wish is to see you dead and fulfill the ancient prophecy to become the chosen one, like many that have come before him. Being the chosen one doesn't really seem very special but it does sound fun.\n\nFight, climb, laugh and weep alone or with friends! Albacete Warrior includes a cooperative mode where you can experience Benito's odyssey in good company while you shed gallons of pixelated blood.","16":"Rhythm Sprout is a brand new high-focus rhythm action. Move and fight to the beat and follow a silly self-aware story in the breaks.\n\nYou play as the Chosen Onion - Sprout - saviour of the Vegetable Kingdom.\n\nWill you stop the King Sugar Daddy's Bad Sweets army? Could you save the Princess ... what was her name, again?","17":"Inkulinati is an ink-based strategy game straight from medieval manuscripts, where a rabbit's bum can be deadlier than a dog's sword.\r\n\r\nTake your turn in Inkulinati duels filled with unexpected tactical depth (and humour!). Embark on an ever-changing journey, build your own bestiary, defeat medieval superstars and collect perks to unleash special powers.\r\n\r\nBecome a master of the Living Ink, grab your quill and build your unique strategy time after time so that you can be named the greatest Inkulinati of all time!","18":"THE ROAR OF THUNDER IS BACK!\n\nRaiden IV, the popular shoot 'em up arcade and console game, debuts on Nintendo Switch with remixed background music by a superb lineup of artists produced by GAME CENTER MIKADO.\n\nInstill fear in your enemies with devastating attacks and earn the acclaimed title of master Ace!","19":"Wash Lara Croft's home back to its former glory with the soothing sounds of high-pressure water in the new Special Pack.","20":"Age of Empires II: Definitive Edition celebrates the 20th anniversary of one of the most popular strategy games ever with stunning 4K Ultra HD graphics, a new and fully remastered soundtrack, and brand-new content, \"The Last Khans\" with 3 new campaigns and 4 new civilizations.\r\n\r\nExplore all the original campaigns like never before as well as the best-selling expansions, spanning over 200 hours of gameplay and 1,000 years of human history. Head online to challenge other players with 35 different civilizations in your quest for world domination throughout the ages.\r\n\r\nChoose your path to greatness with this definitive remaster to one of the most beloved strategy games of all time.","21":"You both awaken imprisoned inside the sinister Castle Rock - were you betrayed, or simply not that clever? Find out in the newest co-op puzzle adventure in the We Were Here Series! Do you and your partner have what it takes to face the dark forces of this realm or will you be trapped… forever?","22":"Hello and welcome to Backfirewall_, a first-person tragicomic adventure set inside a smartphone.\n\nYou are the update assistant. Solve wacky puzzles to counter the update and save the previous operating system from deletion. The fate of the System is in your hands!","23":"Roboquest is a fast-paced FPS Roguelite, playable in solo or 2-player co-op. Jump into the steel shoes of a high-powered, hyper-mobile robot and fight like you've never fought before.\n\nRun through randomly generated environments on an unrecognizable Earth. Scorched canyons and vivid cities packed with secrets, upgrades, and enemies.\n\nDestroy every laser-shooting evil bot and boss that stands in your way, choosing from an arsenal of handcrafted weapons to do so.\n\nGather powerful technology to help you push forward. Upgrades, abilities and customization for your character and basecamp. They'll stick with you after each defeat, to make the next run a little easier.","24":"The four nations of Wonderland meet every year to agree on shared policies and enact their various schemes against each other.\n\nYou are the White Rabbit, and your job is to organize the schedule. Every decision you make affects the destiny of Wonderland!\n\nThere are personal vendettas to resolve and enchantments hidden everywhere, and did someone mention the dreaded intruder known as Alice?\n\nEach decision you make affects the destiny of Wonderland, and political intrigue is everywhere!","25":"Guided by the spirit of a moogle, Jack and company reach a city in an alternate time and space to face one last challenge.","26":"You are Bond. James Bond. You are assigned covert operations connected with the GoldenEye weapons satellite. M will brief you on your mission and objectives from London. Q Branch will support your efforts with a plentiful supply of weapons and gadgets. Moneypenny offers you light-hearted best wishes and you're off! Your mission begins in the heavily guarded chemical warfare facility at the Byelomorye Dam in the USSR. Look and shoot in any direction as you navigate 12 interactive 3-D environments. Use stealth and force as you see fit in matters of international security. Consider the military personnel expendable. You are licensed to kill!","27":"Developed exclusively for next generation consoles and PC, raising the level of horror and immersion to unprecedented heights for the franchise through stunning visuals, audio and controls powered by the Frostbite game engine. Fans will experience an improved story, characters, gameplay mechanics and more as they fight to survive a living nightmare aboard the desolate mining starship, the USG Ishimura, all while uncovering the dreadful mystery of what happened to the slaughtered crew and ship. \n\nIn Dead Space, Isaac Clarke is an everyman engineer on a mission to repair a vast, sprawling starship, the USG Ishimura, only to discover something has gone horribly wrong. The ship's crew has been slaughtered and infected by some alien scourge...and Isaac's beloved partner, Nicole, is lost somewhere on board. Now Isaac is alone with only his tools and engineering skills as he attempts to uncover the nightmarish mystery of what happened aboard the Ishimura. Trapped with hostile creatures called \"necromorphs\", Isaac faces a battle for survival, not only against the escalating terrors of the ship, but his own crumbling sanity.","28":"You are Geralt of Rivia, mercenary monster slayer. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down Ciri — the Child of Prophecy, a living weapon that can alter the shape of the world. The Complete Edition contains the base game, offering a huge, over 100-hour long, open-world adventure, as well as both of its massive story expansions: Hearts of Stone &amp; Blood and Wine worth an extra 50 hours of gameplay!  It also comes with all additional content released for the game, alongside new items including swords, armor, and alternate outfits inspired by The Witcher Netflix series — and more!\r\n\r\nUPDATED FOR XBOX SERIES X|S\r\nBehold the dark fantasy world of the Continent like never before! The Xbox Series X|S version of The Witcher 3: Wild Hunt has been enhanced with numerous visual and technical improvements, including vastly improved level of detail, faster loading times, a range of community created and newly developed mods for the game, real-time ray tracing, and more — all implemented with the power of the new consoles in mind — as well as a built-in Photo Mode. \r\n\r\nPLAY AS A HIGHLY TRAINED MONSTER SLAYER FOR HIRE\r\nTrained from early childhood and mutated to gain superhuman skills, strength, and reflexes, witchers are a counterbalance to the monster-infested world in which they live.\r\nGruesomely destroy foes as a professional monster hunter armed with a range of upgradeable weapons, mutating potions, and combat magic.\r\nHunt down a wide variety of exotic monsters, from savage beasts prowling mountain passes to cunning supernatural predators lurking in the shadowy back alleys of densely populated cities.\r\nInvest your rewards to upgrade your weaponry and buy custom armor, or spend them on horse races, card games, fist fighting, and other pleasures life brings.\r\n\r\nEXPLORE A MORALLY AMBIGUOUS FANTASY OPEN WORLD\r\nBuilt for endless adventure, the massive open world of The Witcher sets new standards in terms of size, depth, and complexity.\r\nTraverse a fantastical open world: explore forgotten ruins, caves, and shipwrecks, trade with merchants and dwarven smiths in cities, and hunt across the open plains, mountains, and seas.\r\nDeal with treasonous generals, devious witches, and corrupt royalty to provide dark and dangerous services.\r\nMake choices that go beyond good &amp; evil, and face their far-reaching consequences.\r\n\r\nTRACK DOWN THE CHILD OF PROPHECY\r\nTake on the most important contract of your life: to track down the child of prophecy, the key to saving or destroying this world.\r\nIn times of war, chase down the child of prophecy, a living weapon foretold by ancient elven legends.\r\nStruggle against ferocious rulers, spirits of the wilds, and even a threat from beyond the veil – all hell-bent on controlling this world.\r\nDefine your destiny in a world that may not be worth saving.","29":"Your company’s success depends on your ability to run and manage a website. You must develop and improve features while increasing hosting capacity and run marketing campaigns. The city offers you offices in all sizes and shapes. It’s up to you to select the most suitable. It’s your job to organize and decorate the office while keeping your employees happy. Your employees are a vital part of your success. As you grow, you must continue recruiting more people. Over time, your employees will start demanding more of you and the company. It’s your job to keep them happy, before your competitors send them a job offer they can’t reject! There’s no website without stable and reliable servers. As your website attracts more traffic, you'll have to move from virtual servers to your own fully featured hosting center. The goal is obvious: become the biggest website in the industry. It’s up to you if you want to buy and merge your competitors or outrun them until they go out of business!","30":"Simultaneously control a sword-wielding robot and a gunslinging space frog in Shoulders of Giants, an explosively colourful sci-fi roguelike designed to put your teamwork to the test. \n\nThe forces of Entropy are spreading chaos through the stars, corrupting living planets and urging on the heat death of the universe. Led by the psychic Owl, one scrappy team of space survivors are fighting to restore the balance. A mysterious mech! A sharpshooting amphibian! Together they must cut through waves of enemies and restore light and life to the galaxy!","31":"In a conflict that pre-dates the formation of the Star League, Join Colonel Månsdottir and the people of Rasalhague in a fight for freedom and independence from the Great Houses, in a new 12 mission quest line. Rise of Rasalhague adds the Crusader 'Mech chassis with 11 variants, the new Rival Mercenaries feature allowing you to interact with numerous other mercenary companies and the infamous Bounty Hunter.","32":"You can play Othello, Mahjong, Shogi, Igo, Hanafuda, Texas Hold'em, Chess, Backgammon, all in this single package!\n\nIn each game, you can play against a computer with real thinking, as well as collect achievements, challenge mode, and other overwhelmingly challenging elements.\n\nYou can enjoy playing against other players in Othello, Igo, Shogi, Chess, and Backgammon by alternating the use of even a single controller!","33":"Bend your knees and thrust your hips -- it's time for an intense dose of hard-hitting dodgeball action! OddBallers is a hilariously charming and totally bonkers multiplayer party game where each round is a new, absurd type of dodgeball. Gather your best enemies and prepare to shave sheep with lawnmowers, tussle with tractors, slam stinky toilets -- and yes, throw dodgeballs -- to decide who's the greatest OddBallers of them all!","34":"A strange continent from a different dimension has suddenly appeared... and Siruby, a young cyborg traveling space just happens to pass by. Taking her trusty AI partner \"Ne-com\" with her, she sets out to explore this unknown land.\n\nMeet other characters such as \"Yamato\", an unusual cyborg girl and \"Douglas\" the treasure hunter as you follow Siruby through her adventure.\n\nA new metroidvania game by Skipmore, the creators of \"Kamiko\" and \"Fairune\"! Expect the same high quality action... with a dash of adventure and puzzle-solving.","35":"Deadpool, everyone's favorite merc with a mouth, teams up with the Midnight Suns to tear evil a new one! Add Deadpool to your roster and take on a fresh set of story missions featuring undead enemies and plenty of fourth-wall-shattering asides. Hydra forces are closing in on an artifact brimming with ancient power, which just so happens to be on Deadpool's shopping list for his mysterious benefactor. The Midnight Suns are forced to step in and put a stop to any supernatural shenanigans before things get out of hand—which is all but guaranteed whenever Wade Wilson's involved.  With his twin pistols, oh-so-pointy katanas, and endless supply of witty banter, Deadpool's prowess on the battlefield is the bane of all his enemies (and even some of his allies, who just don't appreciate a sophisticated sense of humor). Join forces with the wisecracking merc and lay waste to new threats in this exciting chapter of DLC (Deadpool Loves Chimichangas)! This content requires Marvel's Midnight Suns to play and is included with Legendary Edition and the Season Pass.\r\n\r\nFeatures:\r\n\r\n- New Hero: Deadpool, an in-your-face damage dealer wielding 10 unique Hero Abilities\r\n\r\n- New Story Missions: Fight a host of fresh enemy types across challenging new encounters\r\n\r\n- New Abbey Upgrade: Deadpool's Food Truck\r\n\r\n- 3 Additional Hero Skins, 7 Abbey Outfits, and 3 Swimsuits for Deadpool","36":"Get to know the curious hobby of a kitten named Sissa! She's a very organized feline, and when she plays with her balls of wool, each needs to be pushed across the floor to the correct spot. Presented in cute and colorful 3D style, Sissa's Path is a pushing puzzle game where you play as Sissa and move her toys around tiled floors.\n\nOnce all the balls of wool rest on the white circular tiles, the stage is cleared, and another increasingly complex hand-crafted puzzle awaits to challenge Sissa's toy-nudging skills.\n\nCan you help her organize her toys?","37":"LoBlocks is a puzzle game, where the player must destroy all blocks to go to the next level enjoying a relaxing atmosphere with LoFi musics. The game also has an arcade mode with ranking. \n\nIn LoBlocks, the player must destroy all blocks to go to the next level. But to do it, you should solve a lot of challenging puzzle matching colors and amount of blocks with the same color.","38":"Feel the beat as wannabe rockstar Chai and his ragtag team fight against an evil megacorp with raucous rhythm combat! From Tango Gameworks comes Hi-Fi RUSH, an all-new action game where the world syncs to the music.","39":"World War Z: Aftermath is the ultimate co-op zombie shooter inspired by Paramount Pictures' blockbuster film, and the next evolution of the original hit World War Z that has now captivated over 15 million players. Turn the tide of the zombie apocalypse on consoles and PC with full cross-play. Join up to three friends or play on your own with AI teammates against hordes of ravenous zombies in intense story episodes across new zombie-ravaged locations around the world. Take back Vatican City in an epic confrontation in Rome, and join forces with survivors in Russia's snowbound Kamchatka peninsula.","40":"Welcome to the Trenches, 1917. A World War 1 first person horror survival game where you, caught behind enemy lines - have to survive and escape the harsh war-torn environment and experience World War l like never before from the eyes of James R. in this surreal nightmare, as you fight for your life and for your sanity.\n\nExplore the real chilling story as you navigate the horrors equipped with only your senses, hearing and trench whistle. Find clues to better understand and escape the enemy trenches without being caught to return to your family.","41":"Rise to the challenge and join the hunt!\n\nSet in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.\n\nHunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying 'Wire Action' and your canine companion 'Palamute' will add exciting new layers to the already robust combat that Monster Hunter is known for.","42":"Twenty years ago, in a frightening battle you stopped Ragnar from descending upon your world, but everyone knows no peace lasts forever. Now, it's a matter of time until the evil will be stirring again. Wander into the unknown in search of the information that threatens to shake your reputation and your very existence. One phone call will send you on a journey that will not leave you unscathed.","43":"","44":"A Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\r\n\r\nFollow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.","45":"Terrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next.  As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom.  Will you live to see the light of day?","46":"Inabaa quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\r\n\r\nA coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one's self. \r\n\r\nWith an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.\r\n\r\nKey Features include:\r\n\r\n* Enjoy gameplay with variable framerates\r\n* Experience the world of Persona on PC in Full HD\r\n* Steam Achievements and Trading Cards\r\n* Choose between Japanese and English VO","47":"Tortuga - a Pirate's Tale tells the journey of a pirate captain with a lust for gold and glory who assumes command of a fleet of pirate ships to strike the Caribbean.\n\nCustomize your own Flag under which your fleet will sail. As you gain experience, your notoriety and skills will improve. Roleplay with more than 35 distinct pirate's skills on your way to claim your pirate throne.\n\nFight in tactical turn-based naval battles on a hexagonal grid of epic proportions. Use your wits when raiding a convoy or a settlement. Victory is determined by a clever combination of your ship's distinct armament with the varying and rough conditions of the sea.","48":"Colossal Cave Reimagined by Roberta Williams, is an exciting new action-adventure game from the founders of Sierra On-Line, Ken and Roberta Williams. \n\nColossal Cave Reimagined by Roberta Williams is an exciting and thrilling adventure for a new generation to undertake. Immerse yourself in the world of Colossal Cave, explore its vast caverns and vistas, seek the diverse treasures within, and encounter both friends and foes in your quest to explore this mysterious and wonderful locale.","49":"It is the 23rd century. EDEN, the massive virtual reality network witch helped humankind to flourish, suddenly severed all contact with the outside world...Leaving the minds of its 100 million users trapped inside.\n\nA covert special task force known as \"Saviours\" has been called in to address the situation. Using special attack programs modeled after fighter jets, they plan to delve into the deepest cores of EDEN and find who or what has set it haywire.\n\nA refreshing and highly re-playable bullet hell style shooter that WANTS you to play dangerously! Ride the razor's edge of life and death in this high-risk high-reward danger oriented arcade style shooting game.","50":"Protect space against the last wave of an enemy that used to be mankind's ally: a mysterious intelligent artificial life form. Take control of enhanced trainee pilot Aya, or the mysterious veteran pilot Zarak and fight your way through waves of enemies in order to save mankind and to learn more about yourself and also about your enemy.\n\nWings Of Bluestar is a horizontal hand painted and frame by frame animated HD game, no photobashing, 3D nor pre-rendered assets are used. Every asset is hand crafted and detailed by the same artist, which gives the game its visual integrity.","51":"In RE:CALL you play through the memories of the character you're controlling. Your actions inside these flashbacks have immediate consequences in the present moment, letting you take advantage of the situation in order to progress the story.\n\nSolve mysteries by manipulating your memory. Escape a factory, solve a crime, and win the hearts and minds of your enemies by changing the past.\n\nInvestigate and solve the mystery of your mysterious power. Who is behind this?","52":"Mrs.Cat Between Worlds is set in cute and deadly fantasy versions of the planets Mars and Neptune.\n\nIn this 2D precision platformer series, you have to master the skill of jumping with different amounts of gravity, as well as other special space cat movement techniques.\n\nYou'll need to avoid dangers, collect shiny energy gems, and ultimately make it to the exit to warp to the next level.","53":"Relive the story of Goku in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe. \n\nExperience the Story\nExperience the story of DRAGON BALL Z from epic events to light-hearted side quests, including never-before-seen story moments that answer some burning questions of Dragon Ball lore for the first time!\n\nIconic DRAGON BALL Z\nPlay through iconic DRAGON BALL Z battles on a scale unlike any other. Fight across vast battlefields with destructible environments and experience epic boss battles that will test the limits of your combat abilities. Increase your power level and rise to the challenge! \n\nDon't Just Fight As Goku\nLive as Goku. Fish, fly, eat, train, and battle your way through the DRAGON BALL Z sagas, making friends and building relationships with a massive cast of DRAGON BALL characters.","54":"Welcome to the next part of Ballotron! You also shoot balls but everything happens underwater.\n\nMake the Blue Ball hit the Green Ball to achieve the goal. Shoot Small Balls to hit Large Balls and Bubble Blocks.\n\nThis time the level solutions will be even more fun!\n\nGet Stars and special Golden Coins to achieve the highest results.","55":"Join this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and Tales of series.\n\nDuring their voyage, the Straw Hats, led by Monkey D. Luffy are swallowed by a huge storm at sea. They end up on a mysterious island full of nature amidst the storm and become separated from each other. The crew sets out on a new adventurous journey filled with wonders of a raging nature, powerful enemies, and strange encounters with island locals.\n\nWork together with Luffy and his crew to set sail once again!","56":"Space Raiders in Space is a wave defense roguelike based around 5 orders: Attack, Defend, Cower, Search, and Build. Command your almost competent crew to loot weapons and supplies, build defenses, and fight their way through the Bugpocalypse.\r\n\r\nHave your raiders scavenge materials from their surroundings and use them to design and build elaborate fortifications, hopefully keeping your crew a safe distance from the bugs' sharp and stabby parts. With over a dozen defensives, there are many build strategies to explore.\r\n\r\nYour crew is armed with enthusiasm and a bunch of weapons (assuming you have been looting), but not much intelligence. Issue commands to individuals or the group as a whole, then hope they know how to follow instructions. It's up to you to tell them when to search, what to build, how to fight, and more. Or else they'll all die horribly violent deaths, Probably that second thing.","57":"In the dead of night a fierce storm rages across North Wales. Miles from any town, Chris Selwood seeks refuge in a remote roadside cafe. Shortly thereafter Chris experiences a horrific sight as he finds the cafe waitress pinned to the ceiling by something with fierce glowing eyes, he passes out waking up to the dusty old abandoned remains of the café.\n\nExplore the untouched wilderness of rural Wales as you uncover the forgotten remains of a mysterious facility and try to piece together what happened to the missing villagers of Hearth.\n\nInspired by 80s Sci-Fi horror and contemporary surrealist cinema, Chasing Static delivers a unique take on the narrative adventure genre through new audio driven gameplay mechanics and non-linear exploration.","58":"Congrats on becoming the newest hire of Salamander County's public TV station! Unfortunately, everyone in the county suddenly disappeared, except for you, your boss, and another employee. The show must go on, so with your new job title of Professional Thing-Doer, it's up to you to do all of the activities that need to be filmed for the TV station. \n\nYou should probably try and figure out why everyone disappeared in the first place, too.","59":"Breakers Collection features both of the original games (Breakers and Breakers Revenge) and a brand new content for the cult-classic among the fans of Fighting Games, that was first released in 1996 for the Neogeo and Arcades and after released with a sequel in 1998 with additional playable characters, balance adjustments and new gameplay elements.\r\n\r\nBreakers Collection is a simple action-fighting game, with a rooster with many playable characters (10 in Breakers Revenge), that were all known by the fans from around the world.\r\n\r\nThe collection version, the player will have more features and modes, like online versus mode - Rollback Netcode (GGPO) -, Art gallery and the most requested one, the training mode.","60":"Accompany Lucy and her friends in this grim, beautifully hand-drawn adventure game. Lucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play. People disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or so she thinks. Children of Silentown is a point &amp; click adventure game telling a mysterious and endearing story. Explore the town and its dangerous surroundings, meet its quirky inhabitants, solve puzzles and master minigames. Accompany Lucy on her adventure to get to the bottom of what is haunting the strange Silentown... if you dare.","61":"We Are The Caretakers is an afrofuturist squad management RPG. \n\nAssemble an arcane team of protectors in squad-building systems inspired by Darkest Dungeon, Ogre Battle, and XCOM. \n\nDefend the endangered animals your world relies on in strategic turn-based combat.\n\nDefine your approach to a global resistance by balancing your reputation, funds, research, animals and alliances. \n\nWe Are The Caretakers is a challenging strategy RPG fusion that asks you to protect a planet by fighting for the people, animals and ecosystems that inhabit it.","62":"Neon Souls is a Fast-paced Splatformer where platforms are invisible and you have to paint them. Walk, Jump, Double Jump, Slide and Wall Jump to paint everything, A vast amount of difficult levels for you challenge and powerful bosses to beat.","63":"8-Ball Pocket brings you eight-ball pool, also known as American billiards. You can compete with up to 4 friends or against the AI in Versus mode, or challenge the best in the world in Arcade mode, where you can make combo shots and rack up points to become Number 1 in the online ranking. All of this comes in a setting with great graphics and Jazz music.","64":"An arcade action game about shooting a ball into a goal. It's cyberpunk volleyball with guns.","65":"Christmas. Christmas never changes. \n\nSoon those overzealous little freaks will swarm the city led by that bearded maniac. But this time, we fight back.\n\nInspired by Zombies Ate My Neighbors and Beavis&amp;Butthead's heavy metal comedy, this is twin-stick mayhem like you've never experienced before.","66":"Heave! Fake the bull rope and stay the mizzen royal! Command a fleet of custom-rigged sailing ships on a procedurally crafted adventure over an unending ocean whose ancient depths have swallowed the key to a planet's mysterious past. \n\nPut the wind to your back and cast out into High Adventure over a vast ocean spanning numerous unique regions, each packed to bursting with its own flora, fauna, and ambient music.\n\nMake chase with a pod of curious dolphins, watch the sun sink into an icy horizon, run down a clutch of cowardly privateers and accept their apologies to the tune of wild cannonry.\n\nStay engaged with a replayable rogue-lite experience whose narrative is revealed through free exploration in an ocean-world of ever-changing discovery.\n\nOn the Deepblue, opportunity is in every direction, and sinking your ship is just the start of another adventure!","67":"Solve crossword puzzles - one letter at a time. Crossovers are little crosswords with just one letter missing. Find the letters, then unscramble them to solve the cryptic clue. Crossovers by POWGI contains 200 crossword clues - and 200 terrible jokes, as a “reward” for solving each one.","68":"","69":"Wave Break is the world's first skateBOATING game, inspired by arcade skateboarding classics. Grind, grab, kickflip and shoot your way through an explosive 80s crime-filled Miami Vice themed world.\n\nEnjoy an episodic single player campaign, ranked online multiplayer, multiple custom game modes, and an advanced park creator. From tropical beaches to frozen tundras, ride the waves and score the world's biggest combo with style.","70":"Texas is the first drop in the Season 1 Pass, available separately or as part of Them’s Fightin’ Herds: Deluxe Edition for $39.99.","71":"Dive into the world of beautiful hand drawn game with unusual and funny beings all around. You will have to spot all the silly characters cleverly hidden in the doodle maps.\n\nWith several different levels, each will unlock when you have collected the points required. The Levels will be incrementally hard by restricting your time to collect everything and more silly characters to find.","72":"Play as one of six epic heroes, summon troops, sling spells, and destroy enemy towers to achieve victory in this exciting head-to-head castle defense game.\n\nPlayers can enjoy single-player adventures with three campaigns filled with campy storytelling, sweeping musical scores, and hand-crafted environments. Or they can dive into fast-paced battles with friends and family in competitive 1v1 or 2v2 matches. \n\nPlayers can build custom decks and upgrade cards to create monstrous combinations of troops and spells as they aim to defeat their opponents, destroy the Soul Gem that gives them power, and move to the top of the leaderboards.","73":"Panda Punch is a puzzle platformer game in which you have to control a red panda and save the world from evil alien robots.\n\nSolve puzzles on the levels, collect coins, look for super coins, pump your abilities from the blacksmith.\n\nDefeat bosses, get new abilities.","74":"Crime Secrets: Crimson Lily is a captivating blend of hidden object challenges, puzzle solving and daring detective work.\r\n\r\nWhen a grim murder interrupts a private detective's vacation at the very gate to the hotel at which she was going to stay, she puts her plans for R&amp;R on hold and sets out to do what she does best: solve violent crimes. All she has to go on is a single clue: a mysterious paper lily attached to the victim's frozen body. Could it be the killer's calling card?","75":"In eastern lands, a clan has fallen. The Moonspell, once vigilant guardians of a sorcerous valley nestled in the mountains, have been overrun by hordes of yokai and oni. Though treacherous, this hive of spectral activity may provide some clue as to the location of a vampire. If not, at least it'll be entertaining to defeat thousands of wayward spirits in the process.\n\nLegacy of the Moonspell is the first DLC for Vampire Survivors, and introduces a brand new stage, new characters, new monsters, and new weapons to slaughter them with. There might even be some hidden mysteries for those of an inquiring mindset, but we can neither confirm nor deny the presence of vampires...","76":"An unusual material collapses in on itself, the world shudders and contracts, and suddenly you are squeezed into existence.\n\nWhat awaits you is a world unknown, alien in its own familiarity, and you must survive what terrors you face. Explore your surreal surroundings, absorb the many enemies you encounter, and use their own traits against them as you let yourself become far more than you once were.\n\nGRIME is a fast and unforgiving Action-Adventure RPG in which you crush your foes with living weapons that mutate form and function, and then consume their remains with a black hole to strengthen your vessel as you break apart a world of anatomical horror and intrigue.","77":"Cassiodora is a medieval fantasy game inspired by classic shoot 'em up with unique mechanics and epic boss fights. Save the princess Cassiodora by yourself or with up to 2 friends on the same screen.","78":"Create the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path to become either the guardian of the woods or the terror nightmares are made of.\r\n\r\nYou play as Yaga, a 16-year-old girl accused of witchcraft and expelled from an early medieval Slavic settlement. When living memories of her past return as foul, walking spirits, Yaga is faced with no other option than to hunt them down in hopes of unravelling her own mystery.","79":"A totalitarian state that controls everything and everyone through oppressive laws, total surveillance, and intimidation.\n\nYou are Frank Schwarz, a husband, and father who lost his cushy office job at the Ministry after someone set him up. The only way to avoid jail time was to make a deal with a high-ranking security officer.\n\nNow a government spy working undercover as a landlord, you must break into tenants' apartments, search them for contraband and eliminate anyone your boss wants out of the picture.\n\nAt the same time, you'll have to spy and scheme against co-workers and superiors in the Ministry to work your way back up the ladder. Different factions are secretly vying for power over the Ministry and the country play them against each other to your advantage.\n\nCan you get your old life back, or even something better? Will you fight for change and truth or uphold the status quo? Who are you willing to sacrifice to get what you want?","80":"The classic arcade game is back in a supercharged version! For beginners or veterans, Tetraminos offers an easy-to-learn, limitless challenge. Give your brain a workout with the 50 Puzzle mode levels, survive as long as possible in Endless mode and rack up the combos and same colour lines to climb to first place in the ranking. Challenge your friends in local Versus mode for up to four players* and sabotage their boards in wild games.","81":"Brick Breaker, the classic arcade game, is back with a breathtaking new version. Its explosive gameplay - unique and timeless - is filled with surprises.\r\n\r\nSharpen your reflexes and precision to overcome the hundred different levels that await you. Collect bonuses, avoid traps and shoot your way to victory. Play alone or with up to 4 players on a split screen. Brick Breaker will offer you many hours of fun and entertainment!","82":"Play a Zen game! Rediscover the famous traditional Chinese game.\n\nFind all the matching pairs of tiles, being careful not to become blocked in, to get to the end of each level. Concentration and perceptiveness are needed to finish the gorgeous boards that we have produced for you.\n\n- Traditional Mahjong with all its depth and captivating beauty\n- 70 levels with varying difficulty and brand new puzzles\n- Customise your games with different graphic styles","83":"The River City Girls are ready for round 2! When an old foe resurfaces, Misako, Kyoko, Kunio, and Riki - joined by newcomers Marian and Provie - hit the streets for an all-new beat-'em-up adventure packed with new abilities, enemies, environments, and more! \n\nTeam up for local or online co-op, then pound punks into the dirt with brand-new guard-crush attacks, lift-off combos, double-team maneuvers, and other knuckle-busting techniques! \n\nLevel-up to earn new moves, buy items and accessories in more than 30 shops, and recruit defeated foes and hired heavies to help you on your way!\n\nRiver City is bigger than ever, with more locations to explore, more objects to destroy, and a day-night cycle! With nonlinear gameplay, a dynamic story system, and another epic soundtrack by Megan McDuffee, River City Girls 2 will keep you brawling until all your enemies yell \"BARF!\"","84":"Raptor Boyfriend: A High School Romance is a dating sim about a teen girl who moves to a small secret community of cryptids. Romance a magical Fairy, a sensitive Sasquatch and a bold Velociraptor.\n\nLive this '90s teen drama as Stella, who moves to a small town only to discover it's populated with hot Cryptid teens. In her last year of high school she's determined to try to fit in, make new friends and find romance.\n\nEarn collectibles like tapes, poems, and comics by remembering key details from conversations with your crushes. Make choices like who to call after school, who to drop off last, who to cheer up during the holidays and more to decide which cryptid you end up with.\n\nWho do you want to laugh and cry with? Who do you want to open up to? And who do you want to share your last days of high school with?","85":"Your squad has crash-landed behind enemy lines, in the heart of an alternate history Eastern Europe. With no intel or leadership to support them, these soldiers must fight their way back home before the horrors of war break them. Teamwork and strategy are paramount Each soldier has their own personality and ideas on what needs to happen next. Some want to investigate what caused the crash that left them in hostile territory, while others want to lay low and wait for rescue. There are even whispers of desertion.\n\nYou are the \"unseen hand\" that guides this ragtag group of soldiers to safety and possible rescue. Whether it's as simple a choice as to which way to go next, or something as serious as how to engage their mysterious foes, every decision you make is serious and significant.\n\nBroken Lines combines a tactical RPG with story-driven gameplay. As your soldiers battle the mental strain of war, you'll need to command them in combat will they avoid the enemy, or go head to head with their foes?\n\nCombat is similar to that of a turn-based tactical RPG, but soldiers move only when action phase starts. However, when new enemies and hazards appear, the game pauses to allow you to plan your reaction to this new change. Will you continue to charge forward, or back off and seek cover?\n\nChoices you make will shape the story to your liking leading to a different campaign endings. Choose wisely as your progression through the game will affect not only soldiers you command but also a whole region and everyone who happen to live here. But you should also keep in mind that your soldiers have their own opinion on what is good for the squad so you have to maintain a balance between what you want them to do and what is good for keeping the squad in high spirits.","86":"Potion Craft is an alchemist simulator where you physically interact with your tools and ingredients to brew potions. You're in full control of the whole shop: invent new recipes, attract customers and experiment to your heart's content. Just remember: the whole town is counting on you. \n\nEvery day customers will come to your store looking for solutions to their problems. You will face consequences depending on what you decide to sell them. Attract guilds, befriend notable figures (or feud with them), gain riches and influence - and one day, you may even decide the fate of the whole town.","87":"****Doctor Who: The Edge of Reality\r\n\r\n    Wield the sonic screwdriver as you join the Thirteenth Doctor (voiced by Jodie Whittaker) on a quest to save the universe, and meet the Tenth Doctor along the way (voiced by David Tennant in a guest appearance).\r\n\r\n    Experience an unforgettable adventure through space and time, face terrifying monsters and solve a mind-bending mystery!\r\n\r\n    ORIGINAL DOCTOR WHO STORY\r\n\r\n    Enter the Chaosverse, where reality itself is threatened by a series of time-breaking glitches, and partner with two formidable Doctors as you seek to uncover a deeper mystery.\r\n\r\n    NEW NEMESIS REVEALED\r\n\r\n    Confront a terrifying new threat and face classic Doctor Who monsters, including Daleks, Weeping Angels and Cybermen.\r\n\r\n    THRILLING ADVENTURE GAMEPLAY\r\n\r\n    Now for non-VR platforms, Doctor Who: The Edge of Reality features brand-new gameplay, new challenges and new locations to explore, with a reimagined and expanded story that builds on the previous game Doctor Who: The Edge of Time.\r\n\r\n***Doctor Who: The Lonely Assassins\r\n\r\n    Building on the terrifying legacy of the Weeping Angels, first encountered in the iconic story “Blink”, Doctor Who: The Lonely Assassins is a thrilling found-phone mystery developed by the award-winning creators of Sara Is Missing and SIMULACRA.\r\n\r\n    Amidst a sinister series of events at a seemingly abandoned house in London, someone goes missing, and you find their phone. When it begins to self-destruct, ex-UNIT scientist Petronella Osgood enlists your help to uncover hidden clues and solve cryptic puzzles. Will you unravel the truth behind the chilling disappearance before it’s too late? But remember: don’t turn your back, don’t look away and DON’T BLINK.\r\n\r\n    ORIGINAL DOCTOR WHO STORY\r\n    Picking up where the iconic episode “Blink” left off, the Weeping Angels are back to unleash terror once again…\r\n\r\n    PETRIFYING NEW NEMESIS\r\n    Confront an evil like never before. No phone is safe!\r\n\r\n    AUTHENTIC CHARACTERS\r\n    Work alongside Petronella Osgood (played by Ingrid Oliver) to investigate mysterious events. Also features Finlay Robertson as Larry Nightingale and a special appearance by Jodie Whittaker as the voice of the Doctor.\r\n\r\n    FOUND-PHONE MYSTERY\r\n    Search through messages, emails, videos, photographs and more to uncover clues, solve puzzles and reveal the truth.","88":"Gris is a hopeful young girl lost in her own world, dealing with a painful experience in her life. Her journey through sorrow is manifested in her dress, which grants new abilities to better navigate her faded reality. As the story unfolds, Gris will grow emotionally and see her world in a different way, revealing new paths to explore using her new abilities.\n\nGRIS is a serene and evocative experience, free of danger, frustration or death. Players will explore a meticulously designed world brought to life with delicate art, detailed animation, and an elegant original score. Through the game light puzzles, platforming sequences, and optional skill-based challenges will reveal themselves as more of Gris's world becomes accessible.\n\nGRIS is an experience with almost no text, only simple control reminders illustrated through universal icons. The game can be enjoyed by anyone regardless of their spoken language.","89":"Fresh out of high school with no job and no ambition, you've really got nothing going for you until an alien cartel that wants to get high off humanity invades Earth. Now, you and a team of charismatic talking guns must answer the hero's call and become the deadliest intergalactic bounty hunter the cosmos has ever seen.\n\nTravel to various planets and locations across the cosmos, go up against the nefarious Garmantuous and his gang of goons, collect loot, meet unique characters, and more, in the latest comedy adventure from Justin Roiland!\n\nNavigate dynamic and changing worlds that range from a jungle paradise, to a city built inside an asteroid, the hub of the cosmos.\n\nLeverage the distinct skills of each gun to defeat a variety of diabolical alien enemies and track down Garmantuous.\n\nComplete hunter challenges, meet weird, fun, and hilarious characters, collect an array of alien technology, and more!","90":"CRISIS CORE -FINAL FANTASY VII- REUNION is a full remaster of the PlayStation Portable exclusive CRISIS CORE -FINAL FANTASY VII-, which originally launched back in 2007.\n\nCRISIS CORE -FINAL FANTASY VII- REUNION is a true remaster that follows the original's narrative: Zack Fair's mission to find the missing SOLDIER Genesis Rhapsodos. It features multiple improvements from the original game - for example, the graphics have been converted to HD, with all the 3D models, from the characters to everything else, being fully refreshed. What's more the dialogue is now fully voice-acted, and there's a new arrangement for the soundtrack!","91":"Surf the waters of a submerged city! Unravel the past, save the islanders from mysterious sea monsters and discover secrets hidden under the surface.\n\nExplore an open sea and the decaying archipelago of Strandville in Wavetale, a story-driven action-adventure game introducing you to fed-up fishermen, secretive hermits - and maybe a pirate or two. Traverse calm waters and surging waves as Sigrid, a young girl who befriends a mysterious shadow that provides her with the power to walk on water.\n\nSpeed through the waves, swing yourself from housetops with your net, and defeat an old nemesis to save the citizens of the islands. All with a bit of help from the shadows down below - and your cranky grandmother.","92":"Jitsu Squad is a 4 player co-op beat 'em up with fast-paced cartoony action and wacky chaotic battles! It has the accessibility and classic brawler mechanics of games like Streets of Rage and Final Fight but with the speed and intensity of fighting games games such as Marvel vs. Capcom II, Dragonball FighterZ &amp; Super Smash Bros.\n\nMaster the difficulty, level up and use your unique special moves and weapons to take down the wicked sorcerer to save the galaxy!","93":"In Petite Adventure you drive tiny cars around a house and complete challenging objectives.\n\nDo a 360 drift, pop balloons, play golf, collect coins, and explore each level. Petite Adventure features 32 different challenges to play organized based on difficulty.\n\nControl a wide variety of miniature automobiles including cars and trucks, master the art of driving in tight household spaces, and don't fall off the edge!","94":"Earth is on the brink of a climate catastrophe! The Church of the Holy Lizard hatches a dubious plan to save humanity from its own reckless disregard of the planet - unleash a monster to kill, destroy, and inflict terror!\n\nEmbark on a rampaging trail of total devastation across multiple stages as one of four recently defrosted monsters. Roar with delight as you stomp terrified citizens and pulverise buildings in an apocalyptic, retro arcade blast of awesome monsters, satisfying destruction, and farcical fatalities!","95":"Afterglitch is an experimental third-person exploration sci-fi video game. The player is an astronaut whose multidimensional journey to find an extraterrestrial civilization is more important than the destination!","96":"Take up your sword, channel your magic or board your Mech. Chained Echoes is a 16-bit SNES style RPG set in a fantasy world where dragons are as common as piloted mechanical suits. Follow a group of heroes as they explore a land filled to the brim with charming characters, fantastic landscapes and vicious foes.\n\nCan you bring peace to a continent where war has been waged for generations and betrayal lurks around every corner?\n\nChained Echoes is a story-driven game where a group of heroes travel around the vast continent of Valandis to bring an end to the war between its three kingdoms. In the course of their journey, they will travel through a wide array of diverse landscapes spanning from wind-tanned plateaus and exotic archipelagos to sunken cities and forgotten dungeons.","97":"A sudden call in the deep of night has you return to a house you haven't visited for many a year. You must unravel one puzzle after another: to from within scenes intertwined with memories find clues and get to the bottom of your father's secret.\n\nThe choice of whether to redeem or ultimately end this sad story lies in your hands.\n\nDad's Monster House is a hand-drawn puzzle game featuring horror and fantasy. It tells the story of Carlos' journey after he receives a distress call from his father, pleading for him to return to his old home and rescue his dad.","98":"Set before the dramatic events of Universal Pictures and Amblin Entertainment's Jurassic World Dominion, you'll head to the warmth of the Mediterranean and attempt to manage multiple dinosaur facilities across three locations.\n\nIn the Dominion Malta Expansion, you'll be able to discover new prehistoric species, three new island maps, Malta inspired buildings, and an all-new campaign!","99":"The world as we knew it ended when the Swarm came. Hordes of terrifying creatures out of our worst nightmares ravaged the Earth, destroying every living thing in sight.\n\nWe few survivors fled underground, desperately searching for the tech and resources to survive - and fight back. To battle the monsters we created an armada of war machines called Mechs.\n\nThanks to ground-breaking replicator tech these Mechs could be generated almost instantly in the battlefield, turning the tide of what seemed to be an unwinnable war. As we pushed back, we used every resource to power our way forward to destroy the Swarm.\n\nCommand custom mechs and outmaneuver the Swarm in this post-apocalyptic turn-based tactics game. Leverage the terrain, your Mech's unique skills and your wits to survive a series of ever-changing strategic battles and give humanity hope.","100":"At the close of the 20th century... A large-scale natural disaster struck the eastern area of a certain country. The disaster wiped out the financial sector and toppled high-rise buildings over a wide area, even as far as the main functions of the capital. This resulted in the loss of a staggering 158,000 lives.\n\nAt the dawn of the 21st century... Conglomerate PROBE-NEXUS, commonly known as Probe, begins reconstruction efforts in the eastern area of said country. Probe relocates its own base of operations to the ruined sector and builds a massive city run by the corporation. Lavished with colossal capital and cutting-edge technology, the modern-day Babylon is made up of skyscrapers that put the old high-rises to shame, the biggest shopping mall in the world, and recreational facilities one might mistake for a theme park.\n\nThis was the dazzling birth of a symbol for the new century. It became the most essential place on the planet and was christened Zone Prime.\n\nThe Rumble Fish is a 2D fighting game. The arcade version was developed in 2004. The arcade version of The Rumble Fish 2 came out in 2005, introducing new game mechanics and characters. It gained popularity with its sleek 2D visuals powered by S.M.A. (Smooth Model Animation), fascinating characters and strategic gameplay using 2 types of gauges."},"Link":{"1":"www.metacritic.com\/game\/xbox-series-x\/the-redress-of-mira","2":"www.metacritic.com\/game\/xbox-series-x\/cube-farmer","3":"www.metacritic.com\/game\/xbox-series-x\/prizma-puzzle-prime","4":"www.metacritic.com\/game\/xbox-series-x\/peachy-boy","5":"www.metacritic.com\/game\/xbox-series-x\/hogwarts-legacy","6":"www.metacritic.com\/game\/xbox-series-x\/prison-tycoon-under-new-management","7":"www.metacritic.com\/game\/xbox-series-x\/heirs-of-the-kings","8":"www.metacritic.com\/game\/xbox-series-x\/speedway-racing","9":"www.metacritic.com\/game\/xbox-series-x\/pets-at-work","10":"www.metacritic.com\/game\/xbox-series-x\/debtor-enhanced-edition","11":"www.metacritic.com\/game\/xbox-series-x\/deliver-us-mars","12":"www.metacritic.com\/game\/xbox-series-x\/the-pathless","13":"www.metacritic.com\/game\/xbox-series-x\/fashion-police-squad","14":"www.metacritic.com\/game\/xbox-series-x\/kattish","15":"www.metacritic.com\/game\/xbox-series-x\/albacete-warrior","16":"www.metacritic.com\/game\/xbox-series-x\/rhythm-sprout","17":"www.metacritic.com\/game\/xbox-series-x\/inkulinati","18":"www.metacritic.com\/game\/xbox-series-x\/raiden-iv-x-mikado-remix","19":"www.metacritic.com\/game\/xbox-series-x\/powerwash-simulator-tomb-raider-special-pack","20":"www.metacritic.com\/game\/xbox-series-x\/age-of-empires-ii-definitive-edition","21":"www.metacritic.com\/game\/xbox-series-x\/we-were-here-forever","22":"www.metacritic.com\/game\/xbox-series-x\/backfirewall_","23":"www.metacritic.com\/game\/xbox-series-x\/roboquest","24":"www.metacritic.com\/game\/xbox-series-x\/wonderland-nights-white-rabbits-diary","25":"www.metacritic.com\/game\/xbox-series-x\/stranger-of-paradise-final-fantasy-origin---different-future","26":"www.metacritic.com\/game\/xbox-series-x\/goldeneye-007","27":"www.metacritic.com\/game\/xbox-series-x\/dead-space","28":"www.metacritic.com\/game\/xbox-series-x\/the-witcher-3-wild-hunt---complete-edition","29":"www.metacritic.com\/game\/xbox-series-x\/startup-company-console-edition","30":"www.metacritic.com\/game\/xbox-series-x\/shoulders-of-giants","31":"www.metacritic.com\/game\/xbox-series-x\/mechwarrior-5-mercenaries---rise-of-rasalhague","32":"www.metacritic.com\/game\/xbox-series-x\/the-table-game-deluxe-pack","33":"www.metacritic.com\/game\/xbox-series-x\/oddballers","34":"www.metacritic.com\/game\/xbox-series-x\/transiruby","35":"www.metacritic.com\/game\/xbox-series-x\/marvels-midnight-suns---the-good-the-bad-and-the-undead","36":"www.metacritic.com\/game\/xbox-series-x\/sissas-path","37":"www.metacritic.com\/game\/xbox-series-x\/loblocks","38":"www.metacritic.com\/game\/xbox-series-x\/hi-fi-rush","39":"www.metacritic.com\/game\/xbox-series-x\/world-war-z-aftermath","40":"www.metacritic.com\/game\/xbox-series-x\/trenches","41":"www.metacritic.com\/game\/xbox-series-x\/monster-hunter-rise","42":"www.metacritic.com\/game\/xbox-series-x\/demon-hunter-new-chapter","43":"www.metacritic.com\/game\/xbox-series-x\/deep-space-anomaly","44":"www.metacritic.com\/game\/xbox-series-x\/a-space-for-the-unbound","45":"www.metacritic.com\/game\/xbox-series-x\/persona-3-portable","46":"www.metacritic.com\/game\/xbox-series-x\/persona-4-golden","47":"www.metacritic.com\/game\/xbox-series-x\/tortuga---a-pirates-tale","48":"www.metacritic.com\/game\/xbox-series-x\/colossal-cave","49":"www.metacritic.com\/game\/xbox-series-x\/graze-counter-gm","50":"www.metacritic.com\/game\/xbox-series-x\/wings-of-bluestar","51":"www.metacritic.com\/game\/xbox-series-x\/recall","52":"www.metacritic.com\/game\/xbox-series-x\/mrscat-between-worlds","53":"www.metacritic.com\/game\/xbox-series-x\/dragon-ball-z-kakarot","54":"www.metacritic.com\/game\/xbox-series-x\/ballotron-oceans","55":"www.metacritic.com\/game\/xbox-series-x\/one-piece-odyssey","56":"www.metacritic.com\/game\/xbox-series-x\/space-raiders-in-space","57":"www.metacritic.com\/game\/xbox-series-x\/chasing-static","58":"www.metacritic.com\/game\/xbox-series-x\/salamander-county-public-television","59":"www.metacritic.com\/game\/xbox-series-x\/breakers-collection","60":"www.metacritic.com\/game\/xbox-series-x\/children-of-silentown","61":"www.metacritic.com\/game\/xbox-series-x\/we-are-the-caretakers","62":"www.metacritic.com\/game\/xbox-series-x\/neon-souls","63":"www.metacritic.com\/game\/xbox-series-x\/8-ball-pocket","64":"www.metacritic.com\/game\/xbox-series-x\/hyper-gunsport","65":"www.metacritic.com\/game\/xbox-series-x\/headbangers-in-holiday-hell","66":"www.metacritic.com\/game\/xbox-series-x\/sail-forth","67":"www.metacritic.com\/game\/xbox-series-x\/crossovers-by-powgi","68":"www.metacritic.com\/game\/xbox-series-x\/space-accident","69":"www.metacritic.com\/game\/xbox-series-x\/wave-break","70":"www.metacritic.com\/game\/xbox-series-x\/thems-fightin-herds---additional-character-1-texas","71":"www.metacritic.com\/game\/xbox-series-x\/its-kooky","72":"www.metacritic.com\/game\/xbox-series-x\/heroish","73":"www.metacritic.com\/game\/xbox-series-x\/panda-punch","74":"www.metacritic.com\/game\/xbox-series-x\/crime-secrets-crimson-lily","75":"www.metacritic.com\/game\/xbox-series-x\/vampire-survivors-legacy-of-the-moonspell","76":"www.metacritic.com\/game\/xbox-series-x\/grime","77":"www.metacritic.com\/game\/xbox-series-x\/cassiodora","78":"www.metacritic.com\/game\/xbox-series-x\/blacktail","79":"www.metacritic.com\/game\/xbox-series-x\/beholder-3","80":"www.metacritic.com\/game\/xbox-series-x\/tetraminos","81":"www.metacritic.com\/game\/xbox-series-x\/brick-breaker","82":"www.metacritic.com\/game\/xbox-series-x\/mahjong-2016","83":"www.metacritic.com\/game\/xbox-series-x\/river-city-girls-2","84":"www.metacritic.com\/game\/xbox-series-x\/raptor-boyfriend-a-high-school-romance","85":"www.metacritic.com\/game\/xbox-series-x\/broken-lines","86":"www.metacritic.com\/game\/xbox-series-x\/potion-craft-alchemist-simulator","87":"www.metacritic.com\/game\/xbox-series-x\/doctor-who-the-edge-of-reality-+-the-lonely-assassins","88":"www.metacritic.com\/game\/xbox-series-x\/gris","89":"www.metacritic.com\/game\/xbox-series-x\/high-on-life","90":"www.metacritic.com\/game\/xbox-series-x\/crisis-core-final-fantasy-vii-reunion","91":"www.metacritic.com\/game\/xbox-series-x\/wavetale","92":"www.metacritic.com\/game\/xbox-series-x\/jitsu-squad","93":"www.metacritic.com\/game\/xbox-series-x\/petite-adventure","94":"www.metacritic.com\/game\/xbox-series-x\/terror-of-hemasaurus","95":"www.metacritic.com\/game\/xbox-series-x\/afterglitch","96":"www.metacritic.com\/game\/xbox-series-x\/chained-echoes","97":"www.metacritic.com\/game\/xbox-series-x\/dads-monster-house","98":"www.metacritic.com\/game\/xbox-series-x\/jurassic-world-evolution-2-dominion-malta-expansion","99":"www.metacritic.com\/game\/xbox-series-x\/mech-armada","100":"www.metacritic.com\/game\/xbox-series-x\/the-rumble-fish-2"},"Release":{"1":"February 8, 2023","2":"February 8, 2023","3":"February 8, 2023","4":"February 8, 2023","5":"February 7, 2023","6":"February 7, 2023","7":"February 3, 2023","8":"February 3, 2023","9":"February 3, 2023","10":"February 3, 2023","11":"February 2, 2023","12":"February 2, 2023","13":"February 2, 2023","14":"February 2, 2023","15":"February 1, 2023","16":"February 1, 2023","17":"January 31, 2023","18":"January 31, 2023","19":"January 31, 2023","20":"January 31, 2023","21":"January 31, 2023","22":"January 30, 2023","23":"January 30, 2023","24":"January 27, 2023","25":"January 27, 2023","26":"January 27, 2023","27":"January 27, 2023","28":"January 26, 2023","29":"January 26, 2023","30":"January 26, 2023","31":"January 26, 2023","32":"January 26, 2023","33":"January 26, 2023","34":"January 26, 2023","35":"January 26, 2023","36":"January 25, 2023","37":"January 25, 2023","38":"January 25, 2023","39":"January 24, 2023","40":"January 20, 2023","41":"January 20, 2023","42":"January 20, 2023","43":"January 20, 2023","44":"January 19, 2023","45":"January 19, 2023","46":"January 19, 2023","47":"January 19, 2023","48":"January 19, 2023","49":"January 19, 2023","50":"January 18, 2023","51":"January 17, 2023","52":"January 17, 2023","53":"January 13, 2023","54":"January 13, 2023","55":"January 13, 2023","56":"January 13, 2023","57":"January 12, 2023","58":"January 12, 2023","59":"January 12, 2023","60":"January 11, 2023","61":"January 6, 2023","62":"January 6, 2023","63":"December 23, 2022","64":"December 22, 2022","65":"December 21, 2022","66":"December 21, 2022","67":"December 21, 2022","68":"December 21, 2022","69":"December 21, 2022","70":"December 19, 2022","71":"December 16, 2022","72":"December 16, 2022","73":"December 16, 2022","74":"December 16, 2022","75":"December 15, 2022","76":"December 15, 2022","77":"December 15, 2022","78":"December 15, 2022","79":"December 15, 2022","80":"December 15, 2022","81":"December 15, 2022","82":"December 15, 2022","83":"December 15, 2022","84":"December 14, 2022","85":"December 14, 2022","86":"December 13, 2022","87":"December 13, 2022","88":"December 13, 2022","89":"December 13, 2022","90":"December 13, 2022","91":"December 13, 2022","92":"December 9, 2022","93":"December 9, 2022","94":"December 9, 2022","95":"December 9, 2022","96":"December 8, 2022","97":"December 8, 2022","98":"December 8, 2022","99":"December 8, 2022","100":"December 8, 2022"}}