{"Titles":{"1":"Daily Dadish","2":"Fire Emblem Engage: Expansion Pass Wave 2","3":"WBSC eBASEBALL: Power Pros","4":"Metroid Prime Remastered","5":"ARK: Survival Evolved - Ragnarok Expansion","6":"Nadir: A Grimdark Deck Builder","7":"I am an Air Traffic Controller - AIRPORT HERO HANEDA","8":"Street Racers","9":"I am an Air Traffic Controller - AIRPORT HERO HANEDA: Sky Day! Variety Pack","10":"I am an Air Traffic Controller - AIRPORT HERO HANEDA: Commemorative Launch Pack","11":"Prison Tycoon: Under New Management","12":"Space Lines: Extra Levels!","13":"Seraph's Last Stand","14":"Foxy's Coin Hunt","15":"Hentai RPG: Isekai Journey","16":"NCL: USA Bowl","17":"Swap Puzzles","18":"Pets at Work","19":"Car Factory Driver","20":"Helvetii","21":"Tiny Detour","22":"Trophy","23":"HUNDRED FIRES: The rising of red star Episode 2","24":"Samurai Warrior","25":"Sport &amp; Fun: Swimming","26":"Beat Them Up - Box Simulator - Boxing Battle Fight Combat for Nintendo Switch Ultimate 2023","27":"Box Roulette Simulator- Boxing Battle Fight Combat for Nintendo Switch","28":"Match Ventures 2","29":"SpiderHeck: Show Your Support","30":"Brightstone Mysteries: The Others","31":"Crime Map: Spot the Hidden Differences","32":"Kart Crazy Race Simulator Game","33":"Air Jet Fighter Combat - Europe Fly Plane Attack","34":"Pixel Game Maker Series CAT AND TOWER","35":"Oshiiro","36":"Puzzle Bobble 2X \/ Bust-a-Move 2 Arcade Edition &amp; Puzzle Bobble 3 \/ Bust-a-Move 3 S-Tribute","37":"Monster Girls and the Mysterious Adventure 2","38":"Radiantflux Hyperfractal 4.0","39":"The Pathless","40":"Jumbo Airport Story","41":"ExitMan Deluxe","42":"Life is Strange 2","43":"Fashion Police Squad","44":"Sakura Cupid","45":"Active DBG: Brave's Rage","46":"DRAINUS","47":"The Intership","48":"Red Hands - 2 Player Games","49":"Shark Attack: Fish Predator Ocean Sea Adventure Survival","50":"Arcade Archives: Phelios","51":"Chasing Light","52":"Cuddly Forest Friends","53":"Albacete Warrior","54":"Jigsaw Masterpieces: Flower Arrangement","55":"Gunscape","56":"Rhythm Sprout","57":"Harvest Yuuka","58":"PowerWash Simulator","59":"PowerWash Simulator: Tomb Raider Special Pack","60":"Spaceland: New Adventures","61":"SpongeBob SquarePants: The Cosmic Shake","62":"Backfirewall_","63":"Trek to Yomi","64":"Capybara Madness","65":"ATONE: Heart of the Elder Tree","66":"nOS new Operating System","67":"Dance of Death: Du Lac &amp; Fey","68":"Offroad Moto Bike","69":"Alice Escaped!","70":"Farming Life","71":"Super Benbo Quest: Turbo Deluxe","72":"Wonderland Nights: White Rabbit's Diary","73":"Arcade Archives: The New Zealand Story","74":"PIPELINE PANIC","75":"Tales of Shinobi Fantasy Magic Anime World Fight RPG Simulator","76":"Fear in Hospital: Escape Horror Story","77":"Anime Girls: Camping Trip","78":"Match Ventures","79":"Extreme Highway Racing: Real Speed Driver","80":"Jewel Match Solitaire: Collector's Edition","81":"Nature Escapes: Collector's Edition","82":"Uphill Rush Water Park Racing","83":"Unblock The Brick: Casual Block Puzzle","84":"Hyper Shapes","85":"Startup Company: Console Edition","86":"Cubic Light","87":"Japanese Escape from The Room with Sturdy Door","88":"Poker Legends: Omaha Champions","89":"Bike Clash","90":"Wonder Boy Anniversary Collection","91":"Onion Assault","92":"Hippo: Little Red Riding Hood","93":"Mars Base","94":"pixelBOT EXTREME!","95":"OddBallers","96":"Zodiacats","97":"Sunwards","98":"Yeah! Fighting Girl","99":"Roller Drama","100":"Ginnung"},"Platform":{"1":"Switch","2":"Switch","3":"Switch","4":"Switch","5":"Switch","6":"Switch","7":"Switch","8":"Switch","9":"Switch","10":"Switch","11":"Switch","12":"Switch","13":"Switch","14":"Switch","15":"Switch","16":"Switch","17":"Switch","18":"Switch","19":"Switch","20":"Switch","21":"Switch","22":"Switch","23":"Switch","24":"Switch","25":"Switch","26":"Switch","27":"Switch","28":"Switch","29":"Switch","30":"Switch","31":"Switch","32":"Switch","33":"Switch","34":"Switch","35":"Switch","36":"Switch","37":"Switch","38":"Switch","39":"Switch","40":"Switch","41":"Switch","42":"Switch","43":"Switch","44":"Switch","45":"Switch","46":"Switch","47":"Switch","48":"Switch","49":"Switch","50":"Switch","51":"Switch","52":"Switch","53":"Switch","54":"Switch","55":"Switch","56":"Switch","57":"Switch","58":"Switch","59":"Switch","60":"Switch","61":"Switch","62":"Switch","63":"Switch","64":"Switch","65":"Switch","66":"Switch","67":"Switch","68":"Switch","69":"Switch","70":"Switch","71":"Switch","72":"Switch","73":"Switch","74":"Switch","75":"Switch","76":"Switch","77":"Switch","78":"Switch","79":"Switch","80":"Switch","81":"Switch","82":"Switch","83":"Switch","84":"Switch","85":"Switch","86":"Switch","87":"Switch","88":"Switch","89":"Switch","90":"Switch","91":"Switch","92":"Switch","93":"Switch","94":"Switch","95":"Switch","96":"Switch","97":"Switch","98":"Switch","99":"Switch","100":"Switch"},"RatingMC":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"77","43":"None","44":"None","45":"None","46":"83","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"78","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"UserRating":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"Summary":{"1":"It’s an adventure that lasts a whole year! Daily Dadish is a retro platformer that features over 365 handcrafted levels - one for every day of the year! Each level is only playable for one day, so beat them while you can. Face challenging foes, unlock cool characters, and help reunite Dadish with his missing kids all over again!","2":"","3":"","4":"Intergalactic bounty hunter Samus Aran receives a distress signal from a wrecked frigate in orbit around planet Tallon IV. Upon investigation, the frigate reveals itself to be a Space Pirate research vessel home to terrifying genetic experiments using the mysterious Phazon substance. There, Samus encounters her nemesis, Meta Ridley, whom she pursues to the surface of Tallon IV. It's up to her alone to explore the planet's interconnected regions, investigate its dark secrets, and end the intergalactic threat posed by Phazon.\n\nExperience this critically acclaimed first-person adventure like never before with remastered visuals, audio, controls, and more.","5":"Journey through an expansive 144 sq. kilometer environment where elements from The Island, Scorched Earth, and all new biomes are combined to bring the ultimate survivor experience.\n\nWhether tackling the extreme cold atop the highest mountains, harvesting resources from an active volcano, or just searching for that perfect base location, Ragnarok plays host to explorers and base builders alike. But survivors beware, Ragnarok houses such creatures as Polar Bears, Ice Wyverns, and a mystical creature many have yet to tame in the ARK universe.\n\nRagnarok boasts many unique features such as: custom explorer notes, challenging dungeons, dungeon bosses, active hot springs, unique pickup-able\/harvestable resources, new biomes, an active volcano, unique tree platform locations, environmental traps, unique ruins, and so much more combined with a beautiful world to explore.","6":"Nadir is a roguelike deck-builder with a twist: the cost to play a card is an enemy reaction you can predict. \n\nCraft your own cards to slay powerful demons. Gather resources, expand your city, grow in power and conquer the underworld.","7":"An aviation simulation x puzzle game for all aviation fans!\n\n[Bokukan Airport Hero], the first Nintendo Switch release, is a popular series in which you become a controller and give instructions to aircraft!\n\nThe stage of the first appearance is \"Haneda Airport\". Skillfully use the 4 runways, and keep the skies safe with calm judgment and quick-witted air traffic control instructions! In the Nintendo Switch version, the airport and aircraft scenes have been completely renewed with more power than ever before!\n\nThe Nintendo Switch version can be easily enjoyed anytime, anywhere in portable mode, and if you project it on a TV, the powerful airport will spread out in front of you!","8":"","9":"","10":"","11":"Plan and build your own prison from the ground up! Secure government grants, hire guards and staff and begin welcoming new prisoners in this reboot of the Prison Tycoon franchise.\n\nThe goal of a good Warden is not to punish their prisoners, it's to rehabilitate them into productive members of society. In Under New Management, each inmate must work through their own issues that landed them in prison, and it's your job to provide them with the help they need to get healthy.\n\n\"Prison Tycoon : Under New Management\" is looking for a good Warden. Are you up for the job?","12":"","13":"Seraph's Last Stand is an incremental shoot 'em up based on the flash era classic \"Heli Attack\", but with roguelike elements.\n\nDefeat waves of enemies and choose an upgrade among multiple options.\n\nYou start clean every playthrough, but if you choose the right combinations, you can snowballs into crazy powerful builds.\n\nCreate insane builds and break the game in all possible ways to get your name into the leaderboards! Every round you get stronger, but so does the enemies...","14":"Foxy's Coin Hunt is an exciting platformer game where players take on the role of Foxy, a cute fox who travels through different worlds to collect as many coins as possible. Along the way, Foxy must face a variety of enemies. Players will also have access to various items that will help them fight enemies and solve problems. Foxy's Coin Hunt offers beautifully designed worlds that will delight players of all ages. Will you take on the challenge and help Foxy reach his ultimate goal?","15":"Hentai RPG: Isekai Journey is an addictive roguelike RPG puzzle game. You have entered the magical world of Isekai, full of charming anime waifu with their own character. You can get to know each one. Hentai RPG: Isekai Journey is an addictive roguelike RPG puzzle game.\r\nWin the favor of beautiful girls by playing three in a row, pumping your skills and abilities. Communication affects the difficulty and obtaining perks.\r\n\r\n• 3 charming anime waifu\r\n• Over 10 animated scenes\r\n• Thoughtful system of pumping","16":"Become a CHAMPION of your own tournament in NCL: USA Bowl. Race your friends and experience the thrill of American football.\r\n\r\nBlow the competition away and give in to your sporting spirit.\r\n\r\nTake part in the exciting races of NCL: USA Bowl. Run straight into a series of stylized challenges and races. Enjoy it by yourself or with a couple of friends. Only one of you can win. Make sure all the glory is yours!","17":"Swap tiles to reveal beautiful images. Relax with easy puzzles or challenge yourself with expert difficulty level.\r\n\r\nThis game is simple, rewarding and enjoyable: swap tiles to put them in the right places and complete the picture.\r\n\r\nReveal all 48 images with different themes: princesses, pets, ocean animals, cosmic fun, steampunk and more. Completed puzzles can be viewed later in the gallery.\r\n\r\nPlay on one of 4 difficulty levels, from 15 to 84 tiles.\r\n\r\nSwap, match and have fun!","18":"Some pets got lost from their owners in an office and now need to work together, using boxes, mats, buttons, climb on shelves and tables or just make a mess trying to find them in this colorful co-op game!","19":"In Car Factory Driver you have to take on EVERY DRIVING JOB. Deliver parts using Trucks, Vans and Fork Lifts! Take your Car through the factory production line and watch it get built in stages from Rolling Chassis to a Finished Car. You can even paint it your favorite color in the paint booth! Then give it a Test Drive on the test track, and finally, deliver to customers using the Car Transporter truck!","20":"Around a hundred years BC, all of Gaul is far from Roman control. In the lands controlled by the Helvetii, a Roman legion was subjugated by young warchief Divico, blessed by an ancient boon brought to him from parts unknown.\r\n\r\nHowever, this victory came at a great cost, as soon the result of the war chief's pact would turn into a curse; an ever spreading rot crawling through his land, and slowly corrupting his mind and heart. Monsters and cultists start appearing throughout the land, and a shadowy figure makes his move, taking advantage of the chaos he helped create.\r\n\r\nWith the help of the trusted yet reclusive druid Nammeios and the curious half-beast Renart, Divico sets his journey to undo the source of the rot and restore what was lost inside him.","21":"A Bridge has collapsed on your way home. You have to make a detour to the nearby forest, but luckily you find a local business man who promises to get it fixed for a few favors. Go on a mission to help the local business man with his unique quests and get that bridge fixed!\n\nCan you complete all of his missions and get back on your way home?","22":"Trophy is a brand-new action platformer for the original NES! Take control of the robot Trophy in this exciting new homebrew game. Save the peaceful planet of Gearus 9 from the evil machinations of Lord Q as you run, jump, and blast your way to victory.\n\nAs Trophy, you must navigate challenging environmental obstacles and terrain, such as water, snow, moving platforms, and even zero gravity. Collect power-ups and upgrade Trophy's health and weapon systems, all while battling enemies throughout the levels. Be prepared, though, as at the end of each level you will have to square off against one of the largest bosses ever seen on the NES!","23":"Hundred Fires is an action, stealth and infiltration game with an exciting story and incredible cinematics.\r\n\r\nThis is a one man infiltration mission, you alone cannot defeat the entire Soviet army, you must use your best skills to hide, sneak away from the enemy and go undetected. You must use your infiltration skills, hide in remote places, not make noise, use different items to advance in your adventure, you will also find action moments, a variety of weapons and strategies to fulfill your mission.\r\n\r\nIn this episode, Valero Montenegro has been captured in the Soviet base \"the red star\", his mission will be to rescue his daughter and stop the evil plans of the Soviet Army.","24":"Samurai Warrior is an exciting and engaging game that offers players the opportunity to experience an adventure as a samurai fighting for honor and survival in a mysterious world. The game offers intense and thrilling battles against opponents, using different fighting styles and special abilities. Players can explore different locations, solving puzzles and fighting bosses to uncover the secrets of this world. Additionally, the game features beautiful, atmospheric graphics that allow for full immersion in the game world and an unforgettable adventure as a samurai.\r\n\r\nWill you take on the challenge and reach the final goal?","25":"Discover a new world of fun! Dive into Sport &amp; Fun: Swimming and use your Joy-Con™ controllers to experience the cutest challenge in your life.\r\n\r\nEASY TO PLAY\r\nPlay with family and friends! Controls are intuitive, so simply move like you'd usually do while swimming and push forward. Swap your swimming style at any point for some extra fun.\r\n\r\nREACH YOUR GOAL\r\nPlay with your friends or challenge yourself. Complete daily goals to improve your health and do your best to unlock every achievement.\r\n\r\nENJOY YOURSELF\r\nRemember to swim at your own pace, and make time for some much needed breaks. Revel in the healthiest gameplay loop in your entire life.","26":"Beat Them Up is a 2D game on levels, where the main type of fight is boxing.\r\n\r\nThe whole game is designed for you to train your fighting skills as you will have to fight against the city gangsters by applying your boxing skills.\r\nBeat Them Up is a type of video game in which the player character fights against a large number of enemies in a side-scrolling. These games typically involve simple controls and gameplay, with the player character able to move left and right and attack with punches, kicks, or special moves.\r\nBeat Them Up’s often feature large numbers of enemies that appear on screen at once, and the player must defeat them all in order to progress to the next level.\r\nThese games often feature boss battles against larger, more powerful enemies and may also stages that the player must complete.\r\nThe amazing classical hard fighter and action game.","27":"If you looking for most exciting game and you’re ready to risk, Box Roulette is the exactly for your.One boxing punch and you lost it all!\r\n\r\nIf you don't like to play it on the safe side and you’re ready to risk, Box Roulette is the exact game you’re looking for. We’re giving you the chance to play one of the most extreme games in human history. One boxing punch and you lost it all!\r\n\r\nHere is how it works: as this game is really exciting and the consequences of it are unpredictable ,we placed a box in the middle of a spinning roulette and you cant know if that box will open exactly on your turn and if it will punch you with the whole strength. If it strikes you-you lost.\r\n\r\nTry to win and open new levels in order to play with more rivals. Play, and risk it all.","28":"Unravel the secrets of Cliffmont Castle in this enchanted match-3 journey! Explore vast levels, collect precious treasures and build majestic castles.\r\n\r\nUnravel the secrets of Cliffmont Castle in this enchanted match-3 journey!\r\nExplore vast levels, collect precious treasures and solve tricky puzzles on your quest among the cavernous dungeons.\r\nBut be wary the malevolent Dragon Master Dragor has returned with his evil horde to Crimson Valley.\r\n\r\nFight off enemies, explore mysterious passageways, and with the help of Finley the Leprechaun, build strongholds to defend the kingdom from the dark invasion.","29":"Spiders with laser swords! Swing, stab, shoot with style and cool parkour.\r\n\r\nSpiders With Laser Swords!\r\n\r\nSpiderHeck is a fast-paced couch co-op brawler where spiders dance to the death in the grip of chaotic battles using laser swords, grenades and even rocket launchers to defeat their foes.\r\n\r\nChallenge yourself by fighting wave after wave of vicious enemies in endless hours of single-player fun, or let the mayhem begin in a dazzling fight against your friends taking on the enemies in PvE; stab, sling, and scramble your way to victory in this silly spider showdown.\r\n• Local and Online Multiplayer\r\n• PvP and Co-op PvE modes","30":"A local toy-maker and all his factory workers mysteriously vanished on the same night. Uncover shocking secrets in this eerie hidden object puzzle adventure game!\r\n\r\nUpon your arrival to the town, things get more and more mysterious and clouded.\r\nIt's up to you, ace reporter Mary Brightstone, to delve into the town's hidden mysteries and discover the truth.\r\nBut first you'll need to understand the strange inhabitants.\r\n\r\nSome places look completely abandoned in this small, once peaceful town, while others, on the other hand, look like everything's normal.\r\nLittle makes sense at first, but as you progress forward, talk to local folks, search for clues and hidden items and solve riddles and mini-games, a mystery will reveal in front of your eyes, piece by piece.","31":"Can you find all the differences in the scene? Discover them to unveil the ins and outs of each crime, only then will you be able to solve the case.\r\n\r\nTo solve any crime you need to be careful and pay attention to every detail is everything as it should be?  In this game finding all the differences is the key to being a good detective.\r\n\r\nWill you be able to find out what details have changed at home scene? Only then will you be able to unravel the mysteries and learn the secrets of each crime.\r\n\r\nDuring each level you will have to find the differences in 4 scenes, if you succeed you will find the key to solve the case and become the best detective.","32":"Fast and dynamic kart races, if you are craving it and looking for it, Kart Crazy Race Simulator will not make you bored. Choose the map that suits you, set the game difficulty that is convenient for you and earn money to buy new karts that differ not only in design but also in power .","33":"Our team has tried to develop the deadliest weapon. And we realized that there is nothing more deadly than the fastest fighter under the control of an experienced pilot. Become a real pilot and show what you are capable of. A bunch of opponents are not afraid of you if you are on a new high-speed fighter. Many missions with a theme (Shoot or be shot down) will keep you on your toes. Realistic graphics, excellent planes, maneuvering like real ones, turn the game into a real battle for survival. Become one of the pilots and soar in the air with full 360-degree freedom of movement. With knocking down your enemies you will experience all the thrill of the game. A variety of missions will give you the opportunity to fly models from the Second World War. Realistic overheating physics, honest breakdowns will complicate your missions. Welcome to Air Fighter Air Attack.","34":"Control the cute cat and jump into the goal!\r\n\r\n\"CAT AND TOWER\" is an action time attack game in which you control Moi, a cat, to reach a goal on a tower.\r\nSimple controls are just move, jump and dash.\r\n\r\n■Game Features\r\n- Find your own best course and aim for the best time.\r\n- You can dash as many times as there are treats!\r\n- Complete Extra Missions!\r\n- Find the hidden difficulty levels!\r\n- Perfect for playing in your spare time, feel free to enjoy the game!","35":"Swing your glowstick and exorcise! A new kind of horror game. Horror X Virtual Idol\r\nInvestigate the haunted Chiba Legend Arena!\r\n\r\n■Game System\r\nExorcise the spirit by swinging a glowstick of the same color.\r\nClear the stage by finding the hidden idol symbol,\r\nAnd swinging a glowstick of the same color.\r\n\r\n■Story\r\nThe protagonist has been sent to investigate\r\nA haunted facility, the \"Chiba Legend Arena\".\r\nWhile investigating, they find a strange glowstick.\r\nThey use it to exorcise the demonic spirits...\r\n\r\n■Additional Content\r\nThere are a few minigames you can play\r\nThat appear unrelated to the main story\r\nAbout a PIEN, Buff Guys, or Sushi.","36":"Puzzle Bobble is a series of puzzle games in which the player fires bubbles from the bottom of the screen, and the bubbles pop when three or more of the same color stick together. The player clears each stage when they meet the conditions for that stage. Higher points are scored when many bubbles are dropped at once or when bubbles are popped by shooting bubbles and bouncing them off the walls.\r\n\r\nHave fun playing alone in puzzle mode, where you can take your time solving puzzles, or with a friend in versus mode, where you fire bubbles at each other. Enjoy ports of the arcade games Puzzle Bobble 2X and Puzzle Bobble 3, as well as four home console versions released in Japan and abroad, with added original modes.\r\n\r\nThe games also have new features such as rewind, slow mode, and quick save, which are perfect for practice, strategizing, and stage creation.","37":"This is a \"Mysterious Dungeon\" style roguelike game where the terrain changes with each challenge. Make the monsters your \"Friends\" and go on a new adventure! \n\nAn opponent moves once a player moves on a grid-based map. Move, Attack, Use Items... make the best choice while a turn is made by both sides and walk through the dungeons!","38":"Data-fractal hyper structures are the new storage medium favoured by big companies. You are a neo-hacker, a new breed of bedroom fract-breaker, and these data-structures are your playground. After receiving an unusual email instructing you to hack your own homepage you discover a hidden world that will take you through the hack-zone and deep into the dark-web to yield untold riches in lost and forbidden softwares.\r\nSo power up your aesthetically pleasing hackOS of choice and download the latest forbidden tools. It’s time to penetrate some software firewalls and hack some HYPERFRACTALS.","39":"From the creators of ABZÛ, The Pathless is the mythic adventure of an archer and an eagle in a vast forest.\n\nExplore an open world and travel to a mystical island to dispel a curse of darkness that grips the world. Together with your eagle companion, discover the history of the island, and fight epic battles to restore light to the land.","40":"Just imagine: your own world-famous airport! A game with sky-high levels of fun!","41":"Chicken Little was right, the sky IS falling!\n\nQuickly run into the gap as the ceiling comes crashing down from above. If you make it in time the ceiling will rise up again and then crash down again and again, each time with the gap in a random place. How long can you survive?\n\nIf you can squeeze into the yellow Exit area you'll earn coins that you can use to buy new costumes.","42":"The long awaited sequel to the award winning Life is Strange returns with a new 5-part narrative adventure from DONTNOD Entertainment.\n\nAfter a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel's new telekinetic power, the boys flee to Mexico for safety. Suddenly, sixteen year-old Sean is responsible for Daniel's safety, shelter, and teaching him right from wrong. As Sean, your choices shape the fates of the Diaz brothers, and the lives of everyone they meet. The road to Mexico is long and filled with danger. This is the trip that could bond Sean and Daniel forever... or tear their brotherhood apart.","43":"Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!\n\nFashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!","44":"How would a lazy cupid enjoy her stay on Earth?! Lilim is a lazy cupid who was exiled from Heaven for failing to do her duties.\r\n\r\nWhile most cupids would be ashamed of such a punishment, Lilim is overjoyed. Finally, she has enough time to indulge in her hobbies (comics and TV).\r\n\r\nLilim however, makes a human girl fall in love with her when she shoots a ‘love bullet’ in an attempt to swindle a free cup of coffee. The cute waitress in question, Mitsuki, becomes infatuated with Lilim.\r\n\r\nNow, Lilim’s stuck living with Mitsuki until the effects of the ‘love bullet’ wears off – and on top of that, she’s being hunted by her childhood friend, Serra, who’s determined to bring her back to Heaven.\r\n\r\nWhat’s a cute cupid to do?!","45":"Once upon a day, an evil dragon came to Aim kingdom and took the princess away. The King managed to rescue the princess by assembling groups of braves, but many of them never came back. With this opportunity, Forces were going to start something again, even Devils and Old ones were involved.\n\n\"Brave's Rage\" is a challenging real-time strategy card game. You can build your own unique deck and team, flexibly use bullet time and perfect defense mechanism, defeat the enemy elegantly and efficiently, and explore the truth behind the princess kidnapping!","46":"This is a side-scrolling shooting game in which you take control of the \"Drainus\", the Kharlal Empire's most cutting-edge fighter with the ability to absorb energy bullets, and take down the enemy ships zipping through space.","47":"A teenage-themed narrative game where you can choose between 4 different characters. Try to prevent some students from disturbing and creating chaos.\r\n\r\nWhen a group of teenagers torments the boarding school, making the right decisions is crucial to survive. Choose between 4 different characters and discover their stories throughout this disturbing game.\r\n\r\nBe careful, all the decisions you make will have consequences. Keep a cool mind and get all 4 protagonists to survive to the end of their story You will find up to 20 alternative endings!\r\n\r\nFeatures:\r\n- 4 different characters to choose from with their respective personalities.\r\n- 20 alternative endings that will keep you in tension until the end.\r\n- More than 25 choices to know the end of your path.\r\n- Collectible illustrations throughout the game's narrative.\r\n\r\nDo you accept the challenge?","48":"Challenge your friends to this fun 2-player game and check who's the first one to get hot hands! Ready? Get set! Gooo!!!\r\n\r\nRed Hands – 2-Player Games is based on a cool two player games known as “hot hands”, “slaps” or even in some countries “slap jack”. It belongs to games for girls and boys, but anyone who's competitive can play this reaction game. If you like to play two player games, this is a perfect choice for you!\r\n\r\nHow to play hot hands:\r\n\r\n- A player stands on each side of the device\r\n- Once the game starts, one player is the attacker and the other is the defender\r\n- Attacker slaps by chosing the right command\r\n- Defender should retreat at the right time\r\n- The first player to reach 10 points is the winner\r\n\r\nKnown as red tomato in Great Britain, Red Hands – 2-Player Games belongs to fun games, (games for girls and boys) but it really is fit for people of all ages. The game tests your reflexes and speed so if you don't pay attention, before you know it you'll get hot hands!\r\n\r\nLike what you hear? That's not all! While playing the game, you can choose different hands. Feel what an animal slaps like, or a skeleton. Like body art? Choose a tattooed hand and play two-player games till your red hands start burning high!\r\n\r\nYou can now play fun games for girls and boys without really feeling the pain. So, what are you waiting for!?","49":"Who is the king of the underwater world? What animal is as old as the world? Many people don't even know what it looks like - of course it's a Shark! With our game Shark Attack: Fish Predator you can feel like a shark. Explore the life of sharks in their natural habitat! Freedom of action: gnaw, break, scare, no one will defeat you. Numerous selection of sharks will allow you to choose your favorite species. A variety of terrain with many interesting locations will not leave you indifferent. Realistic graphics with convenient controls will make you a real predator.","50":"Artemis, the goddess of the moon, has been kidnapped by the evil ruler of the darkness known as Typhon. Apollo must traverse seven treacherous areas in order to rescue his love!","51":"\"Chasing Light is a game that tries to dismantle and revolutionize games, and it's a work that proves that games are great art.\"\n\nWhat is a game? What should a game consist of? How should the game be? 'Chasing Light' is the process of the question and the story of the seven days of exploring the physical properties of the game and uncovering the inner world of human beings and society.\n\nYou will become a game crew and create a game called 'Chase Light'. Controlling the director and producer, you make a lot of decisions in the process of game production: the choice of music and sound effects, the number of enemies, the speed of enemy input and attack...there are many pending issues that you need to decide on. So, think about what you need to make a game that people will love. \n\nYour own journey awaits its birth in 'Chasing Light'.","52":"The game begins when Chinchilla comes to the Gesshizu's village. The player will cooperate with the Gesshizu by watching over them, plotting their fields and homes, and allocating them various work.\n\nGive the Gesshizu commands and they will work, eat, and craft. Since they each have their own strengths, weaknesses, likes, and dislikes, your village building efforts will move forward as you help them out. \n\nBy gathering materials and such, the Gesshizu can craft various items. You can also sell the items you craft and buy items that cannot be obtained in the village. The Gesshizu can be outfitted with crafted accessories, and if you create a new facility, you can perform new actions at that facility.","53":"Albacete Warrior is a satirical combat game where you take on the role of Benito Waters, ninja from Albacete, Spain, in his worldwide adventure on an important task given to him by his master, Paco sensei. With his trusty companion, friend and also main weapon, Pepito the chicken, cockslap waves of enemies whose only wish is to see you dead and fulfill the ancient prophecy to become the chosen one, like many that have come before him. Being the chosen one doesn't really seem very special but it does sound fun.\n\nFight, climb, laugh and weep alone or with friends! Albacete Warrior includes a cooperative mode where you can experience Benito's odyssey in good company while you shed gallons of pixelated blood.","54":"This is the additional puzzle pack for \"Jigsaw Masterpieces\". The following 10 puzzle images are included.\r\n-Flower arrangement of roses and hydrangeas\r\n-Flower arrangement of sunflowers and chrysanthemums\r\n-Flower arrangement of roses and other red flowers\r\n-Flower arrangement of cute small flowers\r\n-Flower arrangement of pink roses\r\n-Flower arrangement of tulips\r\n-Flower arrangement utilizing the wall\r\n-Purple flowers arrangement\r\n-Flower arrangement that evokes autumn\r\n-Colorful flowers arrangement","55":"Create, play and share your own FPS experiences. Mash-up your favourite classics into something amazing!","56":"Rhythm Sprout is a brand new high-focus rhythm action. Move and fight to the beat and follow a silly self-aware story in the breaks.\n\nYou play as the Chosen Onion - Sprout - saviour of the Vegetable Kingdom.\n\nWill you stop the King Sugar Daddy's Bad Sweets army? Could you save the Princess ... what was her name, again?","57":"What will you do today? How about tomorrow? A farming simulation game you can play however you like.\r\n\r\nThe protagonist is a scary youkai?\r\nNo, she's a gentle youkai who loves flowers.\r\nYour objective is to create your own fantastic garden, unique to you. Whether you want to make your wide, empty lot into a sprawling field of flowers or a colorful, seasonal orchard, you're given full freedom to make whatever choices you want. You can even build your own house, letting you enjoy a slow lifestyle following your whims with no pressure.\r\n-Become friends with the residents of Gensokyo!\r\nMake friends with those around you to dispel your frightening image! You'll discover places in Gensokyo you're familiar with, packed with their usual residents. From Bhavaagra to the Underground, your list of places to go will expand even further as you make more friends!","58":"Release the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. \n\nBuild up your business in Career Mode and complete a variety of dirty jobs across the dusty town of Muckingham. There's no right or wrong; no time pressure or final score, just you and the tools you need to soak away your stress. Want a clean start? Chill out and replay your favourite jobs in Free Play.","59":"The Tomb Raider Free Special Pack rappels into PWS.","60":"Double the missions available and discover new stories in the Spaceland universe. This add-on doubles the number of missions available to you and tells new stories of the characters from the original game.\r\n\r\n- The Prologue campaign. Learn Jim's backstory in 6 story missions. Take your final exams at the Space Ranger Academy and solve a high-profile crime on your first mission.\r\n- The Frontier campaign. Explore the secluded corners of Barret's home planet in 8-story missions. Fight the most incredible wild creatures that have inhabited this planet since time immemorial.\r\n- In addition, get 24 daily missions with 10 new enemies that challenge your tactical skills. Earn additional upgrade chips for your fighters.\r\n- Discover the true cause behind the events of the main Spaceland storyline in the secret ending only available to owners of this add-on.","61":"Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!\n\nFeatures\n\n* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick\n* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar\n* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom\n* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick\n* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors\n* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory","62":"Hello and welcome to Backfirewall_, a first-person tragicomic adventure set inside a smartphone.\n\nYou are the update assistant. Solve wacky puzzles to counter the update and save the previous operating system from deletion. The fate of the System is in your hands!","63":"As a vow to his dying Master, the young swordsman Hiroki is sworn to protect his town and the people he loves against all threats. Faced with tragedy and bound to duty, the lone samurai must voyage beyond life and death to confront himself and decide his path forward.\n\nBreathtaking camera angles and striking visuals in the spirit of classic samurai film create a true cinematic experience in Trek to Yomi.\n\nEngage vicious swordsmen and supernatural beings with a streamlined combat system based around the traditional weapons of the samurai.\n\nExperience an enthralling story of Hiroki during his fall against the forces of evil and heroic return to make good on his failed promise to save the people he swore to protect.","64":"Capybara Madness is 3D Ragdoll Physics Based Platform Adventure Game.\r\n\r\nOur main character is a capybara, yes a capybara!\r\nBut he has to escape from these maps,\r\nReach the end by completing the tiny puzzle\r\nand Enjoy the Ragdoll Physics\r\nCan you pass the maps designed differently from each other?\r\n\r\nFeatures;\r\n15 Cool Designed Maps,\r\nDifferent puzzles for each season.\r\nRagdoll Physics and\r\nCapybara","65":"The Gods have abandoned Midgard. Once a prosperous land teeming with mythical beasts and beings, it now rots from the inside, tainted by unknown forces. Odin's chosen guardians of the realm are gone. In their absence, the sacred Elder Tree they swore to protect is exposed to abuse and manipulation. Now, the only remnants of hope reside in Estra, the daughter of mankind's last great leader.\n\nWith a heavy emphasis on narrative, Estra's journey through Midgard is filled with Nordic lore, mysterious twists, and consequential decisions. Players will converse with a variety of characters and share in Estra's discoveries as she learns more about her family's past and the looming darkness spreading across the realm.","66":"A revolution has come!\r\n\r\nEnjoy every awesome feature of the nOS. Draw, write, calculate, organize your day and play around at your convenience. All the tools you need are here!\r\n\r\nYou have the power\r\n\r\nBrighten up your day and customize the nOS to suit your every need. Find your favorite setup and create the fantastic user experience you deserve.\r\n\r\nKey features:\r\n\r\n- Splendid customization options\r\n- Reliable tools (Notepad, Scetchbook, Day Planner)\r\n- Brilliant design\r\n- A charming puzzle game","67":"1888. The Ripper stalks London’s streets.\r\n\r\nPlay as Arthurian immortals Sir Lancelot Du Lac and Morgana Le Fey on a thrilling quest to\r\nstop history’s most infamous murderer and save the city.\r\nTeam up with Whitechapel local - Mary Jane Kelly - as you explore the capital’s underbelly,\r\nmeet the intriguing characters who live there, and work with them to solve the crimes. But\r\nremember, every decision you make will influence their fates.\r\n\r\nFeatures\r\n● A thrilling mystery set in Victorian London during the \"Autumn of Terror\".\r\n● Historically accurate crime scenes and true-to-life locations, meticulously researched\r\nand fact-checked by experts.\r\n● Performances by leading actors, such as Perdita Weeks (Kira from Ready Player\r\nOne), Gareth David-Lloyd (Solas from Dragon Age) and Alexandra Roach (Carrie\r\nfrom Black Mirror).\r\n● Story by Philip Huxley (Batman: Arkham Knight and Battlefield) and BAFTA\r\nBreakthrough Brit winner Jessica Saunders.","68":"Enjoy riding your moto bike on off road terrains, trying to reach the goal line of each level.\r\n\r\nYou will have to face loops, brigdes, hills, jumps and all sort of obstacles.\r\n\r\nMore importantly, you will have to watch carefully you gazoline consumption to make sure you don't run out of it.\r\n\r\nEasily playable, but still much fun, Offroad Moto Bike will please at all ages","69":"Explore the stylish world of Wonderland with Usada and Kotora as they search for a mysterious girl named Alice! A Metroidvania action game with a rich, exhilarating battle system all wrapped up in cuteness.","70":"Set up your own farm and fill it with farmhouses, sheds and granaries. Build roads and design optimal fields for your crops. Choose what you want to plant or sow: apples, beets, cabbage, carrots, corn, leeks, onions, peppers, pumpkins, sunflowers, tomatoes, wheat.\r\nRemember to water them and keep them away from pests!\r\n\r\nRunning a large farm will teach you how to manage finances, recruit human resources and, most importantly, take responsibility for your crops and animals. Generate profits from your farm and get resources to grow it!\r\n\r\nAnd remember: Two farms are better than one!","71":"THE LEGENDARY INDIE GAME OF ALL TIME: The SKeleton Army Take over the Planet, Platformer in to action and fight them o_O save the world\r\n\r\nTHE PORTAL TO THE SKELETON WORLD have opened...the Infinite Skeleton Army has began the Ultimate Invasion ,\r\n\r\nMeanwhiel at your house: you (anime girl) all like o_O wtf why is there skeleton lol so you GO ON THE EPIC QUEST TO BUY THIS GAME for real money hot new indie retro anime pixel platformer that all the cool kids are talking about. Smash your way through a handful of levels and defeat all of the bad dudes, THE GAME SUPER BENBO QUEST TURBO DELUXE\r\n\r\nDESCRIPTION OF GAME:\r\nSUPER BENBO QUEST TURBO DELUXE is the newest first and last installment of the Benbo Franchise\r\n\r\nyou play as The Legendary Anime Girl with unlimited damage attacks and its a 2d pixel platformer so you basically walk to the side of the level -&gt; and punch the skeletons on the way it’s not complicated","72":"The four nations of Wonderland meet every year to agree on shared policies and enact their various schemes against each other.\r\n\r\nYou are the White Rabbit, and your job is to organize the schedule. Every decision you make affects the destiny of Wonderland!\r\n\r\nThere are personal vendettas to resolve and enchantments hidden everywhere, and did someone mention the dreaded intruder known as Alice?\r\n\r\nEach decision you make affects the destiny of Wonderland, and political intrigue is everywhere!","73":"Wally Walrus has captured his tea - 20 of Tiki Kiwi's friends from the New Zealand zoo, and if Tiki doesn't rescue them all by tea-time they'll be stuffed, served and swallowed at Wally's table. Tiki has to search Wally's domain which is just how you would expect it to be - FAT with danger! Armed only with a bow and arrow, Tiki can accumulate more weapons along the way. Beware of the malicious rabbits, boomerang throwers, deadly frogs, blood-sucking bats and many, many more villainous creatures.","74":"Good old fashioned 2D arcade fun with tons of upgrades and fast paced action where taking risks is rewarded with a higher score.\n\nDefend humanity's last source of energy wrench in one hand, laser gun in the other!","75":"Tales of Shinobi is a single-player adventure game where you get to play as a powerful Shinobi who must save the world from evil!\n\nAs a powerful Shinobi, you must use your abilities and knowledge wisely to defeat the dark majestic creatures which have arrived from the Dark Dimension to invade your lands. Open the portal to get to the monsters' land and defeat every one of them!\n\nThe Dark Land is full of creatures with unbelievable powers, so you have to use and develop your abilities. Fight your way through hordes of monsters, while also receiving rewards for eliminating them. Unlock new powerful abilities by advancing the game, which will give you many different advantages. Level up your character and improve your stats! Explore a beautiful open-world map, with cartoon stylised graphics and visuals.","76":"Spine-chilling horror in an abandoned mental hospital - collect notes and keys, solve puzzles and find your way to the exit!\r\n\r\nMeet the new spine-chilling horror! You have to look for notes and keys, unravel the mysteries of the past and try to survive all these terrible horrors. The hospital will leave you with memories of the heartbreaking minutes spent there for a long time. Who is this crazy doctor? What did his patients have to go through?\r\n\r\nYour goal is to find a way out of the hospital. Look for keys and flashlight batteries - this is your only chance to survive. After all, if you are left without light, then ghosts and mysticism will envelop you from head to toe. The hospital with its gloomy atmosphere will keep you in suspense until the very end of the game.","77":"The day of camping with friends has arrived, prove to be the memory of the group! It's up to you to prove that you know all the rules of camping. Answer the questions quickly.\r\n\r\nCamping with girlfriends is one of the most exciting experiences in adolescence. Prove that you know all the rules of camping perfectly Don't make a mistake! If you fail they will know and you won't prove your memory.","78":"Curse is set upon Cliffmon Castle. Show your magic skills and fight the darkness. Explore the dungeons of Cliffmont Castle in this unique new match-3 adventure!\r\nTraverse huge levels and overcome dozens of obstacles as you search the depths for valuable items to help rebuild the castle that was ravaged by the dark dragon master Dragor.\r\nFight off enemies, explore caves, and solve puzzles, all with the aid of your one ally Finley the Leprechaun and his company of dwarves.\r\nFulfill an ancient legend that would rid the land of darkness.\r\n\r\nFeatures:\r\n- Traverse enormous levels.\r\n- Encounter a myriad of environmental obstacles to overcome.\r\n- Fight enemies in the castle!\r\n- Rebuild the fabled castle of Cliffmont.\r\n- Gorgeous fantasy soundtrack.","79":"Hey extreme racer, your task is simple - leave your opponents behind in puffs of smoke and get to the finish line first! The more victories, the more new tracks and cool sports cars. Get into a charged sports car and show everyone what extreme racing means!\r\n\r\nThe vehicle is controlled using the Joy-Con™️. Win extreme races to unlock new tracks and cars!","80":"Return to the world of Jewel Match in this beautiful new Solitaire adventure! Journey across an ancient land to rebuild epic castles of old. Over 200 levels in all, plus many Solitaire variants including Klondike, Spider, Freecell, Pyramid, and more! Dozens of unique game play alternatives shake up your classic Solitaire with locked and frozen cards, obstacles to remove like vines and wax seals, and power-ups like wild cards, jokers, and shuffles. Search every level for gems and coins to purchase new castle upgrades and power-ups. Jewel Match Solitaire is the ultimate relaxing Solitaire game!","81":"Get ready to get lost in the wild beauty of Nature with this hidden object game! \n\nLet Nature Escapes take you on a trip to handcrafted snapshots of untamed wonder, and decorate your very own garden until it becomes a bouquet of beautiful plants and flowers!","82":"How long can you surf while you perform crazy stunts, flips, and slide through everything in your path? Master your surfing skills and bounce through roller coaster style corkscrews, loops, and more! Will you dare to try some seriously insane racing tracks? This is more than just fun in the sun in an amusement park. Do you have the skills to make it to the finish line and not wipe out? Test yourself with an epic and thrilling ride now!\r\n\r\nTAKE IT TO THE MAX! Take the fun to another level! You'll flip over our most thrilling water slide game when you choose from tons of rad “boards” like bathtubs, sharks, or jet skis, each with their own unique specs.","83":"Your task is to arrange all the blocks so that the main block can be unlocked and sent to the exit in a certain number of steps. Show the wonders of logic and you can easily complete the level!\r\n\r\nThe game has more than 150 levels and with each level the game becomes more difficult. At some levels, you will have to rack your brains pretty hard! The game is easy to learn and even a child will figure it out, but the further you go, the more interesting the tasks will become. The game is suitable for all ages, so the whole family can play!\r\n\r\nThis interesting logic game will brighten up your free time and you will spend it with benefit. Have a good game!","84":"Hyper Shapes is a frenetic minimalist Boss Rush where understanding the enemies attack patterns and weaknesses is key. \n\nImmerse yourself in a unique experience with a 2D minimalistic art style. Each room is a surprise and each boss a different challenge with unique mechanics. Use your power ball to defeat them and beware of their attacks. You won't have a break.","85":"Your company’s success depends on your ability to run and manage a website. You must develop and improve features while increasing hosting capacity and run marketing campaigns.\r\n\r\nThe city offers you offices in all sizes and shapes. It’s up to you to select the most suitable. It’s your job to organize and decorate the office while keeping your employees happy.\r\n\r\nYour employees are a vital part of your success. As you grow, you must continue recruiting more people. Over time, your employees will start demanding more of you and the company. It’s your job to keep them happy, before your competitors send them a job offer they can’t reject!\r\n\r\nThere’s no website without stable and reliable servers. As your website attracts more traffic, you'll have to move from virtual servers to your own fully featured hosting center.\r\n\r\nThe goal is obvious: become the biggest website in the industry. It’s up to you if you want to buy and merge your competitors or outrun them until they go out of business!","86":"Cubic Light is minimalistic puzzle game where you need to put blocks to activate the entire image.\r\nGrab the block, define the color if necessary, and put it into the correct place. You need to activate all the cells to complete the level.\r\n\r\nMeet a challenge every 5 levels – you need to define the color of the blocks yourself.\r\n\r\nMind the color, number of cells and the direction of the blocks. The block should be of the same color that is the cell you place it on. Some blocks can be of no color (white) so you should color them before placing,\r\nIf you messed up you can always restart the level.","87":"The 13th Japanese Escape Games series. \r\nThis game is an escape-the-room game (mystery-adventure game)\r\n*Point the screen with a cursor to solve riddles, and this game goes on\r\n\r\nStory\r\nYou wake up in a room you don't recognize\r\n\r\nThe only way in or out is blocked by a sturdy door","88":"OMAHA POKER GAME\r\nAre you a pro at poker games? Find a way to gain FAME worldwide and improve your skills! Gain precious experience and make your way in poker hand rankings! Feel the real casino atmosphere and show who’s the boss in Poker World!","89":"Go head-to-head with the best bikers on the mountain trails!\r\nConquer them in a surprising style.\r\n\r\nProve your mountain bike driving skills. Get unique trophies through competition. Compare your results with the best and take part in various events.\r\nDrive through the various mountain and forest trails! Discover new locations, and compete with friends at local multiplayer!\r\n\r\nKey features:\r\nLocal Multiplayer duels, events, and tournaments,\r\nStunning 3D graphics,\r\nPvE competition system,\r\nEpic mountain and forest trails,\r\nA wide range of bicycle modifications to choose from,\r\nEasy and dynamic controls,\r\nRealistic driving physics\r\nJoin our Discord community!","90":"Featuring 21 versions of six of the most iconic Wonder Boy games ever released, this incredible compilation brings the influential platformer series to today's hardware. Through the 1980s and 1990s the Wonder Boy series gained a vast cult following thanks to its distinct blend of energetic platforming, action-RPG elements, and even shoot 'em up gameplay. And now you can enjoy a diverse spread of the Wonder Boy games that have left a powerful legacy throughout gaming, from the 1986 arcade original to 1994's Monster World IV.\n\nWhether you're a retro devotee wanting to catch up on this important piece of gaming history, a Wonder Boy fan looking to play your favourites on cutting edge hardware or are simply looking to experience the very best in nostalgic gameplay, Wonder Boy Anniversary Collection is about as essential as it gets.","91":"Classic old school platforming action from the creator of Gunman Clive and Mechstermination Force. Defeat the evil army by throwing onions, or lifting and throwing enemies. Old school gameplay inspired by 8-bit classics. Full 3D graphics with a unique artstyle and custom engine. 16 levels with a huge variety of different environments, obstacles, enemies and giant bosses.","92":"Funny storie for children about the fascinating adventures of the Hippo. Visit the magical world of Little Red Riding Hood with Hippo and save her Grandma from an angry Dragon. Fun tasks and colorful puzzles with coloring for kids are waiting for you!\r\n\r\nAn old well-known fairy tale has been transformed and has become a modern story about a red bandana. The main villain will be an evil Green Dragon, not the old-fashioned Gray Wolf. And who is this modern Red Riding Hood? Of course this is our beloved Hippo!\r\n\r\nLet the new adventures begin!\r\n\r\nFeatures:\r\n• Super cute graphics\r\n• Fun mini games\r\n• Puzzles and coloring pages\r\n• Groovy music and fully voiced dialogues\r\n• A game for the youngest players\r\n• Touch screen support","93":"Welcome to Mars, adventurer! You have been selected to join the Mars colonization mission &amp; establish a permanent human presence on the enigmatic Red Planet. Your assignment is at Mars Base, located in the scenic Erebus Montes region on the Amazonia Planitia. \r\n\r\nYour job? Make sure that our nascent colony can sustain itself through agriculture. Achieve the impossible &amp; convert the harsh Martian soil to arable land, grow everything the colonists need to survive. If successful, you'll make Human-Martian history.\r\n\r\nBut never forget that you'll be working tens of miilions of kms away with no resupply!","94":"EXTREME! retro side-scrolling shoot 'em up with a colorful twist! Become one with your controller, learn all rocket colors by heart and master a unique color-based destruction! \n\npixelBOT EXTREME! is a hardcore gameplay experience and is not for the easily daunted. But don't despair! Rapid respawns keep the action flowing while energy orbs keep you in the fight until it's time for the final showdown!\n\nSHOOT DIE RESPAWN! And most importantly...\n\nNEVER GIVE UP!","95":"OddBallers is a new dodgeball multiplayer party game where just about anything you can find can be thrown at your opponents.","96":"Zodiacats is a jigsaw-like puzzle in which you match the pieces to see the full picture of a Zodiac Cat. You can also see a prediction for your sign to see what the future holds for you!\n\nLet Catherine guide you through the zodiac wheel, showing you about features of each solar sign. You can also learn about your cat's sign!","97":"Freud said: dreams are the way to the heart. The magician Black Crow, has closed his heart. You will play his good friend, the Witch Niche, to explore in the dream of the Black Crow, smash the nightmare and finally face the Black Crow's heart to save him.\n\nThere is no doubt that this will be the climax of the action role-playing game. The 10 well-designed boss have different identity background and unique fighting style. Use your ability to find the most effective way to destroy boss. Finally, face the heart of the Black Crow and save him from the gloomy heart.","98":"This is a relaxing and casual game. Five cute girls owe a huge debt for breaking the naked statue of the demon king. In order not to be sold to goblins, they are forced to go to an arena and start fighting to earn money to pay off their debts.\n\nEvery time the girls enter the arena, they need to challenge from the first tier. If you actively leave the arena before the start of each tier, you can exchange all the chips for money and take away. The higher the tier, the higher the reward, but if the challenge fails, half of the chips will be deducted and you will be forced to leave the arena. Whether to continue to pursue higher rewards, or to give up in time, is a question.\n\nAfter paying off the debt, you will challenge four bosses, who are the dominators of the arena. Defeat them and the girls will be completely free.","99":"In Roller Drama, you (Joan) live with &amp; coach five kickass athletes: Anne, Portia, Lily, Cordelia, and Juliet. Together they form a top Roller Derby team, a full contact sport on quad skates!\n\nYour job is to act as a keeper of the team, managing both their personal and professional lives. Try to balance everyone's emotions as they navigate rivalries, friendships, and love.\n\nThe visual novel \/ sport management mashup game of your (anxiety-ridden?) DREAMS! Lead a team of Roller Derby athletes using strategy and real-time controls. Outside the ring you'll have to manage five big personalities as they grapple with friendship, heartbreak, and late capitalist society...","100":"Ginnung is a movement focused platformer with speed and tight controls. Run, wall jump and dash your way with speed, whilst fighting the monsters that await you. This world is not where you belong. Master the levels and movement to ultimately escape your Ginnung with style!\n\nYou are hunted by the spirits of this world. Use your trusty weapon to slay all that is in your way. Including a reflection of yourself, which you will battle in intense boss fights."},"Link":{"1":"www.metacritic.com\/game\/switch\/daily-dadish","2":"www.metacritic.com\/game\/switch\/fire-emblem-engage-expansion-pass-wave-2","3":"www.metacritic.com\/game\/switch\/wbsc-ebaseball-power-pros","4":"www.metacritic.com\/game\/switch\/metroid-prime-remastered","5":"www.metacritic.com\/game\/switch\/ark-survival-evolved---ragnarok-expansion","6":"www.metacritic.com\/game\/switch\/nadir-a-grimdark-deck-builder","7":"www.metacritic.com\/game\/switch\/i-am-an-air-traffic-controller---airport-hero-haneda","8":"www.metacritic.com\/game\/switch\/street-racers","9":"www.metacritic.com\/game\/switch\/i-am-an-air-traffic-controller---airport-hero-haneda-sky-day!-variety-pack","10":"www.metacritic.com\/game\/switch\/i-am-an-air-traffic-controller---airport-hero-haneda-commemorative-launch-pack","11":"www.metacritic.com\/game\/switch\/prison-tycoon-under-new-management","12":"www.metacritic.com\/game\/switch\/space-lines-extra-levels!","13":"www.metacritic.com\/game\/switch\/seraphs-last-stand","14":"www.metacritic.com\/game\/switch\/foxys-coin-hunt","15":"www.metacritic.com\/game\/switch\/hentai-rpg-isekai-journey","16":"www.metacritic.com\/game\/switch\/ncl-usa-bowl","17":"www.metacritic.com\/game\/switch\/swap-puzzles","18":"www.metacritic.com\/game\/switch\/pets-at-work","19":"www.metacritic.com\/game\/switch\/car-factory-driver","20":"www.metacritic.com\/game\/switch\/helvetii","21":"www.metacritic.com\/game\/switch\/tiny-detour","22":"www.metacritic.com\/game\/switch\/trophy","23":"www.metacritic.com\/game\/switch\/hundred-fires-the-rising-of-red-star-episode-2","24":"www.metacritic.com\/game\/switch\/samurai-warrior","25":"www.metacritic.com\/game\/switch\/sport-fun-swimming","26":"www.metacritic.com\/game\/switch\/beat-them-up---box-simulator---boxing-battle-fight-combat-for-nintendo-switch-ultimate-2023","27":"www.metacritic.com\/game\/switch\/box-roulette-simulator--boxing-battle-fight-combat-for-nintendo-switch","28":"www.metacritic.com\/game\/switch\/match-ventures-2","29":"www.metacritic.com\/game\/switch\/spiderheck-show-your-support","30":"www.metacritic.com\/game\/switch\/brightstone-mysteries-the-others","31":"www.metacritic.com\/game\/switch\/crime-map-spot-the-hidden-differences","32":"www.metacritic.com\/game\/switch\/kart-crazy-race-simulator-game","33":"www.metacritic.com\/game\/switch\/air-jet-fighter-combat---europe-fly-plane-attack","34":"www.metacritic.com\/game\/switch\/pixel-game-maker-series-cat-and-tower","35":"www.metacritic.com\/game\/switch\/oshiiro","36":"www.metacritic.com\/game\/switch\/puzzle-bobble-2x-bust-a-move-2-arcade-edition-puzzle-bobble-3-bust-a-move-3-s-tribute","37":"www.metacritic.com\/game\/switch\/monster-girls-and-the-mysterious-adventure-2","38":"www.metacritic.com\/game\/switch\/radiantflux-hyperfractal-40","39":"www.metacritic.com\/game\/switch\/the-pathless","40":"www.metacritic.com\/game\/switch\/jumbo-airport-story","41":"www.metacritic.com\/game\/switch\/exitman-deluxe","42":"www.metacritic.com\/game\/switch\/life-is-strange-2","43":"www.metacritic.com\/game\/switch\/fashion-police-squad","44":"www.metacritic.com\/game\/switch\/sakura-cupid","45":"www.metacritic.com\/game\/switch\/active-dbg-braves-rage","46":"www.metacritic.com\/game\/switch\/drainus","47":"www.metacritic.com\/game\/switch\/the-intership","48":"www.metacritic.com\/game\/switch\/red-hands---2-player-games","49":"www.metacritic.com\/game\/switch\/shark-attack-fish-predator-ocean-sea-adventure-survival","50":"www.metacritic.com\/game\/switch\/arcade-archives-phelios","51":"www.metacritic.com\/game\/switch\/chasing-light","52":"www.metacritic.com\/game\/switch\/cuddly-forest-friends","53":"www.metacritic.com\/game\/switch\/albacete-warrior","54":"www.metacritic.com\/game\/switch\/jigsaw-masterpieces-flower-arrangement","55":"www.metacritic.com\/game\/switch\/gunscape","56":"www.metacritic.com\/game\/switch\/rhythm-sprout","57":"www.metacritic.com\/game\/switch\/harvest-yuuka","58":"www.metacritic.com\/game\/switch\/powerwash-simulator","59":"www.metacritic.com\/game\/switch\/powerwash-simulator-tomb-raider-special-pack","60":"www.metacritic.com\/game\/switch\/spaceland-new-adventures","61":"www.metacritic.com\/game\/switch\/spongebob-squarepants-the-cosmic-shake","62":"www.metacritic.com\/game\/switch\/backfirewall_","63":"www.metacritic.com\/game\/switch\/trek-to-yomi","64":"www.metacritic.com\/game\/switch\/capybara-madness","65":"www.metacritic.com\/game\/switch\/atone-heart-of-the-elder-tree","66":"www.metacritic.com\/game\/switch\/nos-new-operating-system","67":"www.metacritic.com\/game\/switch\/dance-of-death-du-lac-fey","68":"www.metacritic.com\/game\/switch\/offroad-moto-bike","69":"www.metacritic.com\/game\/switch\/alice-escaped!","70":"www.metacritic.com\/game\/switch\/farming-life","71":"www.metacritic.com\/game\/switch\/super-benbo-quest-turbo-deluxe","72":"www.metacritic.com\/game\/switch\/wonderland-nights-white-rabbits-diary","73":"www.metacritic.com\/game\/switch\/arcade-archives-the-new-zealand-story","74":"www.metacritic.com\/game\/switch\/pipeline-panic","75":"www.metacritic.com\/game\/switch\/tales-of-shinobi-fantasy-magic-anime-world-fight-rpg-simulator","76":"www.metacritic.com\/game\/switch\/fear-in-hospital-escape-horror-story","77":"www.metacritic.com\/game\/switch\/anime-girls-camping-trip","78":"www.metacritic.com\/game\/switch\/match-ventures","79":"www.metacritic.com\/game\/switch\/extreme-highway-racing-real-speed-driver","80":"www.metacritic.com\/game\/switch\/jewel-match-solitaire-collectors-edition","81":"www.metacritic.com\/game\/switch\/nature-escapes-collectors-edition","82":"www.metacritic.com\/game\/switch\/uphill-rush-water-park-racing","83":"www.metacritic.com\/game\/switch\/unblock-the-brick-casual-block-puzzle","84":"www.metacritic.com\/game\/switch\/hyper-shapes","85":"www.metacritic.com\/game\/switch\/startup-company-console-edition","86":"www.metacritic.com\/game\/switch\/cubic-light","87":"www.metacritic.com\/game\/switch\/japanese-escape-from-the-room-with-sturdy-door","88":"www.metacritic.com\/game\/switch\/poker-legends-omaha-champions","89":"www.metacritic.com\/game\/switch\/bike-clash","90":"www.metacritic.com\/game\/switch\/wonder-boy-anniversary-collection","91":"www.metacritic.com\/game\/switch\/onion-assault","92":"www.metacritic.com\/game\/switch\/hippo-little-red-riding-hood","93":"www.metacritic.com\/game\/switch\/mars-base","94":"www.metacritic.com\/game\/switch\/pixelbot-extreme!","95":"www.metacritic.com\/game\/switch\/oddballers","96":"www.metacritic.com\/game\/switch\/zodiacats","97":"www.metacritic.com\/game\/switch\/sunwards","98":"www.metacritic.com\/game\/switch\/yeah!-fighting-girl","99":"www.metacritic.com\/game\/switch\/roller-drama","100":"www.metacritic.com\/game\/switch\/ginnung"},"Release":{"1":"February 8, 2023","2":"February 8, 2023","3":"February 8, 2023","4":"February 8, 2023","5":"February 7, 2023","6":"February 7, 2023","7":"February 7, 2023","8":"February 7, 2023","9":"February 7, 2023","10":"February 7, 2023","11":"February 7, 2023","12":"February 5, 2023","13":"February 4, 2023","14":"February 4, 2023","15":"February 3, 2023","16":"February 3, 2023","17":"February 3, 2023","18":"February 3, 2023","19":"February 3, 2023","20":"February 3, 2023","21":"February 3, 2023","22":"February 3, 2023","23":"February 3, 2023","24":"February 3, 2023","25":"February 3, 2023","26":"February 2, 2023","27":"February 2, 2023","28":"February 2, 2023","29":"February 2, 2023","30":"February 2, 2023","31":"February 2, 2023","32":"February 2, 2023","33":"February 2, 2023","34":"February 2, 2023","35":"February 2, 2023","36":"February 2, 2023","37":"February 2, 2023","38":"February 2, 2023","39":"February 2, 2023","40":"February 2, 2023","41":"February 2, 2023","42":"February 2, 2023","43":"February 2, 2023","44":"February 2, 2023","45":"February 2, 2023","46":"February 2, 2023","47":"February 2, 2023","48":"February 2, 2023","49":"February 2, 2023","50":"February 2, 2023","51":"February 2, 2023","52":"February 2, 2023","53":"February 1, 2023","54":"February 1, 2023","55":"February 1, 2023","56":"February 1, 2023","57":"February 1, 2023","58":"January 31, 2023","59":"January 31, 2023","60":"January 31, 2023","61":"January 31, 2023","62":"January 30, 2023","63":"January 30, 2023","64":"January 30, 2023","65":"January 27, 2023","66":"January 27, 2023","67":"January 27, 2023","68":"January 27, 2023","69":"January 27, 2023","70":"January 27, 2023","71":"January 27, 2023","72":"January 27, 2023","73":"January 26, 2023","74":"January 26, 2023","75":"January 26, 2023","76":"January 26, 2023","77":"January 26, 2023","78":"January 26, 2023","79":"January 26, 2023","80":"January 26, 2023","81":"January 26, 2023","82":"January 26, 2023","83":"January 26, 2023","84":"January 26, 2023","85":"January 26, 2023","86":"January 26, 2023","87":"January 26, 2023","88":"January 26, 2023","89":"January 26, 2023","90":"January 26, 2023","91":"January 26, 2023","92":"January 26, 2023","93":"January 26, 2023","94":"January 26, 2023","95":"January 26, 2023","96":"January 26, 2023","97":"January 26, 2023","98":"January 26, 2023","99":"January 26, 2023","100":"January 26, 2023"}}