{"Titles":{"1":"Peachy Boy","2":"The Redress of Mira","3":"Prizma Puzzle Prime","4":"Cube Farmer","5":"Puzzle by Nikoli W Hashiwokakero","6":"Prison Tycoon: Under New Management","7":"Heirs of the Kings","8":"Speedway Racing","9":"Escape 2088","10":"Debtor: Enhanced Edition","11":"Pets at Work","12":"Metal Black S-Tribute","13":"Puzzle Bobble 2X \/ Bust-a-Move 2 Arcade Edition &amp; Puzzle Bobble 3 \/ Bust-a-Move 3 S-Tribute","14":"Deliver Us Mars","15":"The Pathless","16":"ExitMan Deluxe","17":"Fashion Police Squad","18":"Dogurai","19":"Kattish","20":"ReactorX 2","21":"Albacete Warrior","22":"Rhythm Sprout","23":"Inkulinati","24":"Raiden IV x Mikado Remix","25":"We Were Here Forever","26":"Age of Empires II: Definitive Edition","27":"PowerWash Simulator: Tomb Raider Special Pack","28":"SpongeBob SquarePants: The Cosmic Shake","29":"Roboquest","30":"Backfirewall_","31":"Stranger of Paradise: Final Fantasy Origin - Different Future","32":"Wonderland Nights: White Rabbit's Diary","33":"Memory Link","34":"GoldenEye 007","35":"Dance of Death: Du Lac &amp; Fey","36":"Startup Company: Console Edition","37":"Shoulders of Giants","38":"MechWarrior 5: Mercenaries - Rise of Rasalhague","39":"THE Table Game Deluxe Pack","40":"OddBallers","41":"Cat Slide Tiles","42":"Transiruby","43":"The Dark Side of the Moon: An Interactive FMV Thriller","44":"Sissa's Path","45":"LoBlocks","46":"Kingdom Rush","47":"Clunky Hero","48":"Risen","49":"Hunt Ducks 4","50":"Monster Hunter Rise","51":"Deep Space Anomaly","52":"Demon Hunter: New Chapter","53":"Trenches","54":"OmegaBot","55":"Persona 3 Portable","56":"Persona 4 Golden","57":"Tortuga - A Pirate's Tale","58":"Graze Counter GM","59":"A Space For The Unbound","60":"Wings of Bluestar","61":"RE:CALL","62":"Mrs.Cat Between Worlds","63":"UnderDungeon","64":"Ballotron Oceans","65":"NEScape!","66":"Chasing Static","67":"Breakers Collection","68":"Salamander County Public Television","69":"Dragon Blaze","70":"Gunbarich","71":"Zero Gunner 2","72":"Puzzle by Nikoli W Heyawake","73":"Children of Silentown","74":"Atrio: The Dark Wild","75":"We Are The Caretakers","76":"Neon Souls","77":"Shieldmaiden: Remix Edition","78":"One Step After Fall","79":"Joy Ball Adventure","80":"Space Raiders in Space","81":"Fluffy Horde","82":"Tower Princess","83":"8-Ball Pocket","84":"The Tale of Clouds and Wind: QUByte Classics","85":"Hyper Gunsport","86":"Headbangers in Holiday Hell","87":"Crossovers by POWGI","88":"Space Accident","89":"Sail Forth","90":"Wally and the FANTASTIC PREDATORS","91":"Wave Break","92":"Ships","93":"Project Snaqe","94":"Them's Fightin' Herds - Additional Character #1 Texas","95":"It's Kooky","96":"Alphadia Neo","97":"Aery - Path of Corruption","98":"Retro Tank Arcade","99":"reky","100":"Panda Punch"},"Platform":{"1":"Xbox One","2":"Xbox One","3":"Xbox One","4":"Xbox One","5":"Xbox One","6":"Xbox One","7":"Xbox One","8":"Xbox One","9":"Xbox One","10":"Xbox One","11":"Xbox One","12":"Xbox One","13":"Xbox One","14":"Xbox One","15":"Xbox One","16":"Xbox One","17":"Xbox One","18":"Xbox One","19":"Xbox One","20":"Xbox One","21":"Xbox One","22":"Xbox One","23":"Xbox One","24":"Xbox One","25":"Xbox One","26":"Xbox One","27":"Xbox One","28":"Xbox One","29":"Xbox One","30":"Xbox One","31":"Xbox One","32":"Xbox One","33":"Xbox One","34":"Xbox One","35":"Xbox One","36":"Xbox One","37":"Xbox One","38":"Xbox One","39":"Xbox One","40":"Xbox One","41":"Xbox One","42":"Xbox One","43":"Xbox One","44":"Xbox One","45":"Xbox One","46":"Xbox One","47":"Xbox One","48":"Xbox One","49":"Xbox One","50":"Xbox One","51":"Xbox One","52":"Xbox One","53":"Xbox One","54":"Xbox One","55":"Xbox One","56":"Xbox One","57":"Xbox One","58":"Xbox One","59":"Xbox One","60":"Xbox One","61":"Xbox One","62":"Xbox One","63":"Xbox One","64":"Xbox One","65":"Xbox One","66":"Xbox One","67":"Xbox One","68":"Xbox One","69":"Xbox One","70":"Xbox One","71":"Xbox One","72":"Xbox One","73":"Xbox One","74":"Xbox One","75":"Xbox One","76":"Xbox One","77":"Xbox One","78":"Xbox One","79":"Xbox One","80":"Xbox One","81":"Xbox One","82":"Xbox One","83":"Xbox One","84":"Xbox One","85":"Xbox One","86":"Xbox One","87":"Xbox One","88":"Xbox One","89":"Xbox One","90":"Xbox One","91":"Xbox One","92":"Xbox One","93":"Xbox One","94":"Xbox One","95":"Xbox One","96":"Xbox One","97":"Xbox One","98":"Xbox One","99":"Xbox One","100":"Xbox One"},"RatingMC":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"None","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"None","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"UserRating":{"1":"None","2":"None","3":"None","4":"None","5":"None","6":"None","7":"None","8":"None","9":"None","10":"None","11":"None","12":"None","13":"None","14":"None","15":"None","16":"None","17":"None","18":"None","19":"None","20":"None","21":"None","22":"None","23":"None","24":"None","25":"None","26":"None","27":"None","28":"5.6","29":"None","30":"None","31":"None","32":"None","33":"None","34":"None","35":"None","36":"None","37":"None","38":"None","39":"None","40":"None","41":"None","42":"None","43":"None","44":"None","45":"None","46":"None","47":"None","48":"None","49":"None","50":"None","51":"None","52":"None","53":"None","54":"None","55":"5.0","56":"None","57":"None","58":"None","59":"None","60":"None","61":"None","62":"None","63":"None","64":"None","65":"None","66":"None","67":"None","68":"None","69":"None","70":"None","71":"None","72":"None","73":"None","74":"None","75":"None","76":"None","77":"None","78":"None","79":"None","80":"None","81":"None","82":"None","83":"None","84":"None","85":"None","86":"None","87":"None","88":"None","89":"None","90":"None","91":"None","92":"None","93":"None","94":"None","95":"None","96":"None","97":"None","98":"None","99":"None","100":"None"},"Summary":{"1":"This cute looking puzzle game is as hard as it looks cute.\n\nCan you beat the challenging 30 levels?\n\nEach level is specially designed. You have to collect the key and pass the level, but be careful! Stones and thorns are not very safe.\n\nBut don't be afraid of algae. You can hold on to them.","2":"\"Seeing how serious her mother was about keeping it a secret made Mira understand just how sensitive what she was about to tell her was. 'I promise,' Mira said solemnly.\"\n\nWith a variety of gameplay mechanics, venture through Mira's fantasy world filled with atmosphere and adventure, and pursue her inner peace. Uncover her past with the help of written books; witness events before she embarked.\n\nIn the daytime, travel through nature and man-made ruins; pass through magic gates with the aid of a mana-filled staff. In the nighttime, experience the horror of Mira's short nightmares.","3":"Tile-based puzzle game with smooth and addictive gameplay, old-school isometric graphics and excellent music. The player's task is to connect nodes which have various functions.\n\nThe original Prizma Puzzle web games were released from 2009 to 2011 and included 4 games. They have been played hundreds of millions of times online.\n\nPrizma Puzzle Prime includes content from past games, new elements, enhanced graphics, visual and sound effects.","4":"Embark on this memorable experience with a great and relaxing soundtrack and a beautiful view that will get you extremely satisfied.\n\nYou are responsible for irrigating the plantation on the islands. To do that, put the water cubes correctly in the indicated position to make the crops grow healthily.","5":"","6":"Plan and build your own prison from the ground up! Secure government grants, hire guards and staff and begin welcoming new prisoners in this reboot of the Prison Tycoon franchise.\n\nThe goal of a good Warden is not to punish their prisoners, it's to rehabilitate them into productive members of society. In Under New Management, each inmate must work through their own issues that landed them in prison, and it's your job to provide them with the help they need to get healthy.\n\n\"Prison Tycoon : Under New Management\" is looking for a good Warden. Are you up for the job?","7":"Laura, a girl who has lost her memory, and a mysterious pursuer.\nGrant, a young man, happens to come across Laura, and, in order to protect her, becomes separated from his father.\n\nGrant's father seems to know something about this mystery. With the words of his father ringing in his heart, Grant's journey begins, for Laura, and to save the world from danger!\n\nStrengthen Abilities with Soul Maps\nEach character has their own unique Soul Map. You can select and strengthen abilities as you desire. Soul maps expand alongside character growth. Develop the party members' abilities just as you wish!\n\nWeapon Customization and Arenas\nThe game is full of satisfying content! Collect material to customize your weapons. Test your strength at one of the Arenas!\n\nTheme Song\nThe game features a theme song sung by Eri Kitamura, famous as a voice actor in Japanese animation!","8":"In Speedway Racing, you will enjoy the fastest, most spectacular races at over 230 Mph, avoiding multiple collisions against 20 rivals.\n\nThere are several modes available, including Championship, Arcade and 4-player multiplayer.\n\nThere is also an online leader board where you can compare your best times with those of your friends and players from around the world.","9":"Escape2088 is an old-school escape room game set in a futuristic, cyberpunk world.\n\nEscape2088 is an old-school point &amp; click escape room game with modern 3D graphics! Explore a futuristic environment and use your problem-solving skills to set yourself free!\n\nCareful observation of the surroundings will help you discover hidden clues, solve logic puzzles and escape in time!","10":"There was a debtor in the world. Once he became very ill and he lost consciousness. While the ambulance was going to the hospital, he woke up in a strange place. In that strange place, one of the inmates explained that those who have unsuccessful assignments come here. Our hero's unfulfilled task was to collect all his debts.\n\nThe task of the hero to go through 30 levels and collect all the coins, while guarding at the same time clever traps and ruthless enemies. In addition to all, each task is given a dedicated time, which will play against you! To solve all his problems, our hero has a hard forehead with which he can break blocks, well, as well as explosives, with which you can get rid of enemies. Push the boxes, clear your way, solve small puzzles to achieve the goal in the form of an opening door leading to the next level.","11":"Some pets got lost from their owners in an office and now need to work together, using boxes, mats, buttons, climb on shelves and tables or just make a mess trying to find them in this colorful co-op game!","12":"Metal Black is a 2D was originally released as a side-scrolling shooter arcade game by Taito in 1991. This game is a reproduction of the home console version released by Bing in 1996.\n\nCollect NEWALONE to level up your beam, then release energy!","13":"Puzzle Bobble is a series of puzzle games in which the player fires bubbles from the bottom of the screen, and the bubbles pop when three or more of the same color stick together. The player clears each stage when they meet the conditions for that stage. Higher points are scored when many bubbles are dropped at once or when bubbles are popped by shooting bubbles and bouncing them off the walls.\r\n\r\nHave fun playing alone in puzzle mode, where you can take your time solving puzzles, or with a friend in versus mode, where you fire bubbles at each other. Enjoy ports of the arcade games Puzzle Bobble 2X and Puzzle Bobble 3, as well as four home console versions released in Japan and abroad, with added original modes.\r\n\r\nThe games also have new features such as rewind, slow mode, and quick save, which are perfect for practice, strategizing, and stage creation.","14":"Sequel to the award-winning Deliver Us The Moon, Deliver Us Mars is an atmospheric sci-fi adventure offering an immersive astronaut experience. Explore new frontiers on a suspense-fuelled, high-stakes mission to recover the ARK colony ships stolen by the mysterious Outward.","15":"From the creators of ABZÛ, The Pathless is the mythic adventure of an archer and an eagle in a vast forest.\n\nExplore an open world and travel to a mystical island to dispel a curse of darkness that grips the world. Together with your eagle companion, discover the history of the island, and fight epic battles to restore light to the land.","16":"Chicken Little was right, the sky IS falling!\n\nQuickly run into the gap as the ceiling comes crashing down from above. If you make it in time the ceiling will rise up again and then crash down again and again, each time with the gap in a random place. How long can you survive?\n\nIf you can squeeze into the yellow Exit area you'll earn coins that you can use to buy new costumes.","17":"Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!\n\nFashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!","18":"In a dystopian future, where Armies and the Police were replaced by robots and machines, their creator decided to take over the world. Now, it's up to Bones, a retired dog samurai from the Special Forces, to fight against the robot menace alone.\n\nYou will face several robot leaders in an action-packed platforming throughout the city, fighting in urban sewers, military facilities, factories and even in sky-high structures. Each level features several gimmicks and different challenges inspired by classic platformers from the past decades, as well as different enemies and memorable boss encounters!","19":"Our main character is a very sweet cat, but she has to pass these levels quickly.\n\nAre you ready to pass the challenging levels with plain graphics? It's not as easy as it looks. Each section has different mechanics from each other. You need to understand these mechanics and pass the level.","20":"Be an skilled android mechanic in ReactorX 2! The ultimate repair and power restoration challenge awaits you in puzzle game as you take on the aftermath of a pirate attack on your spaceship. \n\nWith 5 different sectors to navigate and 30 levels of increasingly difficult challenges, you'll need to use all your skills and problem-solving abilities to restore power to your ship and get back on course.","21":"Albacete Warrior is a satirical combat game where you take on the role of Benito Waters, ninja from Albacete, Spain, in his worldwide adventure on an important task given to him by his master, Paco sensei. With his trusty companion, friend and also main weapon, Pepito the chicken, cockslap waves of enemies whose only wish is to see you dead and fulfill the ancient prophecy to become the chosen one, like many that have come before him. Being the chosen one doesn't really seem very special but it does sound fun.\n\nFight, climb, laugh and weep alone or with friends! Albacete Warrior includes a cooperative mode where you can experience Benito's odyssey in good company while you shed gallons of pixelated blood.","22":"Rhythm Sprout is a brand new high-focus rhythm action. Move and fight to the beat and follow a silly self-aware story in the breaks.\n\nYou play as the Chosen Onion - Sprout - saviour of the Vegetable Kingdom.\n\nWill you stop the King Sugar Daddy's Bad Sweets army? Could you save the Princess ... what was her name, again?","23":"Inkulinati is an ink-based strategy game straight from medieval manuscripts, where a rabbit's bum can be deadlier than a dog's sword.\r\n\r\nTake your turn in Inkulinati duels filled with unexpected tactical depth (and humour!). Embark on an ever-changing journey, build your own bestiary, defeat medieval superstars and collect perks to unleash special powers.\r\n\r\nBecome a master of the Living Ink, grab your quill and build your unique strategy time after time so that you can be named the greatest Inkulinati of all time!","24":"THE ROAR OF THUNDER IS BACK!\n\nRaiden IV, the popular shoot 'em up arcade and console game, debuts on Nintendo Switch with remixed background music by a superb lineup of artists produced by GAME CENTER MIKADO.\n\nInstill fear in your enemies with devastating attacks and earn the acclaimed title of master Ace!","25":"You both awaken imprisoned inside the sinister Castle Rock - were you betrayed, or simply not that clever? Find out in the newest co-op puzzle adventure in the We Were Here Series! Do you and your partner have what it takes to face the dark forces of this realm or will you be trapped… forever?","26":"Age of Empires II: Definitive Edition celebrates the 20th anniversary of one of the most popular strategy games ever with stunning 4K Ultra HD graphics, a new and fully remastered soundtrack, and brand-new content, \"The Last Khans\" with 3 new campaigns and 4 new civilizations.\n\nExplore all the original campaigns like never before as well as the best-selling expansions, spanning over 200 hours of gameplay and 1,000 years of human history. Head online to challenge other players with 35 different civilizations in your quest for world domination throughout the ages.\n\nChoose your path to greatness with this definitive remaster to one of the most beloved strategy games of all time.","27":"Wash Lara Croft's home back to its former glory with the soothing sounds of high-pressure water in the new Special Pack.","28":"Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!\n\nFeatures\n\n* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick\n* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar\n* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom\n* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick\n* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors\n* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory","29":"Roboquest is a fast-paced FPS Roguelite, playable in solo or 2-player co-op. Jump into the steel shoes of a high-powered, hyper-mobile robot and fight like you've never fought before.\n\nRun through randomly generated environments on an unrecognizable Earth. Scorched canyons and vivid cities packed with secrets, upgrades, and enemies.\n\nDestroy every laser-shooting evil bot and boss that stands in your way, choosing from an arsenal of handcrafted weapons to do so.\n\nGather powerful technology to help you push forward. Upgrades, abilities and customization for your character and basecamp. They'll stick with you after each defeat, to make the next run a little easier.","30":"Hello and welcome to Backfirewall_, a first-person tragicomic adventure set inside a smartphone.\n\nYou are the update assistant. Solve wacky puzzles to counter the update and save the previous operating system from deletion. The fate of the System is in your hands!","31":"Guided by the spirit of a moogle, Jack and company reach a city in an alternate time and space to face one last challenge.","32":"The four nations of Wonderland meet every year to agree on shared policies and enact their various schemes against each other.\n\nYou are the White Rabbit, and your job is to organize the schedule. Every decision you make affects the destiny of Wonderland!\n\nThere are personal vendettas to resolve and enchantments hidden everywhere, and did someone mention the dreaded intruder known as Alice?\n\nEach decision you make affects the destiny of Wonderland, and political intrigue is everywhere!","33":"A heartwarming story of a boy chasing memories of a dreamy girl. Explore a mysterious world in this stylish platformer game.","34":"You are Bond. James Bond. You are assigned covert operations connected with the GoldenEye weapons satellite. M will brief you on your mission and objectives from London. Q Branch will support your efforts with a plentiful supply of weapons and gadgets. Moneypenny offers you light-hearted best wishes and you're off! Your mission begins in the heavily guarded chemical warfare facility at the Byelomorye Dam in the USSR. Look and shoot in any direction as you navigate 12 interactive 3-D environments. Use stealth and force as you see fit in matters of international security. Consider the military personnel expendable. You are licensed to kill!","35":"London, 1888: The people of Whitechapel live under the ghastly shadow of Jack the Ripper, tempting Arthurian legends - Du Lac &amp; Fey - back to English shores to intervene. \n\nWill they stop Jack before more blood is spilt on the cobbled streets? Victorian London awaits you...","36":"Your company’s success depends on your ability to run and manage a website. You must develop and improve features while increasing hosting capacity and run marketing campaigns. The city offers you offices in all sizes and shapes. It’s up to you to select the most suitable. It’s your job to organize and decorate the office while keeping your employees happy. Your employees are a vital part of your success. As you grow, you must continue recruiting more people. Over time, your employees will start demanding more of you and the company. It’s your job to keep them happy, before your competitors send them a job offer they can’t reject! There’s no website without stable and reliable servers. As your website attracts more traffic, you'll have to move from virtual servers to your own fully featured hosting center. The goal is obvious: become the biggest website in the industry. It’s up to you if you want to buy and merge your competitors or outrun them until they go out of business!","37":"Simultaneously control a sword-wielding robot and a gunslinging space frog in Shoulders of Giants, an explosively colourful sci-fi roguelike designed to put your teamwork to the test. \n\nThe forces of Entropy are spreading chaos through the stars, corrupting living planets and urging on the heat death of the universe. Led by the psychic Owl, one scrappy team of space survivors are fighting to restore the balance. A mysterious mech! A sharpshooting amphibian! Together they must cut through waves of enemies and restore light and life to the galaxy!","38":"In a conflict that pre-dates the formation of the Star League, Join Colonel Månsdottir and the people of Rasalhague in a fight for freedom and independence from the Great Houses, in a new 12 mission quest line. Rise of Rasalhague adds the Crusader 'Mech chassis with 11 variants, the new Rival Mercenaries feature allowing you to interact with numerous other mercenary companies and the infamous Bounty Hunter.","39":"You can play Othello, Mahjong, Shogi, Igo, Hanafuda, Texas Hold'em, Chess, Backgammon, all in this single package!\n\nIn each game, you can play against a computer with real thinking, as well as collect achievements, challenge mode, and other overwhelmingly challenging elements.\n\nYou can enjoy playing against other players in Othello, Igo, Shogi, Chess, and Backgammon by alternating the use of even a single controller!","40":"Bend your knees and thrust your hips -- it's time for an intense dose of hard-hitting dodgeball action! OddBallers is a hilariously charming and totally bonkers multiplayer party game where each round is a new, absurd type of dodgeball. Gather your best enemies and prepare to shave sheep with lawnmowers, tussle with tractors, slam stinky toilets -- and yes, throw dodgeballs -- to decide who's the greatest OddBallers of them all!","41":"Kitty Tom needs to go a long way to his home. However, to make your life more difficult, the blocks of land that make up the path are completely out of order. Slide blocks from the terrain to create a path that leads the kitten from point A to point B.\n\nThere are three keys in each scenario. The kitten must take all the keys to open the door that leads to the next path.\n\nTake Tom to his destination, he really needs you to get home before dark.","42":"A strange continent from a different dimension has suddenly appeared... and Siruby, a young cyborg traveling space just happens to pass by. Taking her trusty AI partner \"Ne-com\" with her, she sets out to explore this unknown land.\n\nMeet other characters such as \"Yamato\", an unusual cyborg girl and \"Douglas\" the treasure hunter as you follow Siruby through her adventure.\n\nA new metroidvania game by Skipmore, the creators of \"Kamiko\" and \"Fairune\"! Expect the same high quality action... with a dash of adventure and puzzle-solving.","43":"When his two children randomly vanish throughout the night, it's up to you to help Dean Hamilton bring them back home. As the mystery deepens decisions will need to be made and it's down to you to make the right ones. Who can you trust? Who's doing this? What's the significance of the impending solar eclipse? And what are those strange glowing lights in the sky?\n\nExplore the quaint little village of Marywine, solve puzzles, make some startling discoveries and help unravel what's really going on in this sci-fi thriller.\n\nThe Dark Side of the Moon is a fully interactive FMV \/ Interactive Movie hybrid, featuring live-action video and point &amp; click elements, along with a total of 5 different outcomes.","44":"Get to know the curious hobby of a kitten named Sissa! She's a very organized feline, and when she plays with her balls of wool, each needs to be pushed across the floor to the correct spot. Presented in cute and colorful 3D style, Sissa's Path is a pushing puzzle game where you play as Sissa and move her toys around tiled floors.\n\nOnce all the balls of wool rest on the white circular tiles, the stage is cleared, and another increasingly complex hand-crafted puzzle awaits to challenge Sissa's toy-nudging skills.\n\nCan you help her organize her toys?","45":"LoBlocks is a puzzle game, where the player must destroy all blocks to go to the next level enjoying a relaxing atmosphere with LoFi musics. The game also has an arcade mode with ranking. \n\nIn LoBlocks, the player must destroy all blocks to go to the next level. But to do it, you should solve a lot of challenging puzzle matching colors and amount of blocks with the same color.","46":"Get ready for an epic journey to defend your kingdom against hordes of orcs, trolls, evil wizards and other nasty fiends using a vast arsenal of towers and spells at your command!\n\nFight on forests, mountains and wastelands, customizing your defensive strategy with different tower upgrades and specializations! Rain fire upon your enemies, summon reinforcements, command your troops, recruit elven warriors and face legendary monsters on a quest to save the Kingdom from the forces of darkness!","47":"In a village far, far away, a dull peasant named Rufus was living an ordinary life. Life was nice and happy in the village, until one day, awakened by some magical mistake, the Evil One started to spread his minions around town, performing hideous acts against the people. The worst of which was the kidnapping of Brunilde. She was torn from Rufus' hands and put in a prison at the Evil One's castle.\n\nDetermined to win her back, Rufus made a helmet out of a bucket and picked a broom as a weapon. Everybody now calls him the CLUNKY HERO, but he might be the only hope to defeat the evil one that no one wants to call by name. Rufus is now on his journey to save his wife and the whole village! \n\nCLUNKY HERO is a story-driven, platformer metroidvania game, with a touch of RPG and tons of humor.\n\nIf you'd love a platformer game where you have a strong storyline, can talk with characters, solve side quests, find and buy items, change weapons and wearables, with great hand-drawn-looking backgrounds, presented in a very comical way, then CLUNKY HERO might be the game of your dreams!","48":"This epic RPG is set in a medieval world on a volcanic Mediterranean island. The \"Risen\" story unfolds over four engrossing chapters and will offer multiple ways for the player to develop the story by his own actions and decisions. An innovative and intuitive user control interface will support both casual and hardcore gamers. With full world streaming support, players will have a seamless experience while playing in a fully-simulated game world with authentic, customizable characters.","49":"","50":"Rise to the challenge and join the hunt!\n\nSet in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.\n\nHunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying 'Wire Action' and your canine companion 'Palamute' will add exciting new layers to the already robust combat that Monster Hunter is known for.","51":"","52":"Twenty years ago, in a frightening battle you stopped Ragnar from descending upon your world, but everyone knows no peace lasts forever. Now, it's a matter of time until the evil will be stirring again. Wander into the unknown in search of the information that threatens to shake your reputation and your very existence. One phone call will send you on a journey that will not leave you unscathed.","53":"Welcome to the Trenches, 1917. A World War 1 first person horror survival game where you, caught behind enemy lines - have to survive and escape the harsh war-torn environment and experience World War l like never before from the eyes of James R. in this surreal nightmare, as you fight for your life and for your sanity.\n\nExplore the real chilling story as you navigate the horrors equipped with only your senses, hearing and trench whistle. Find clues to better understand and escape the enemy trenches without being caught to return to your family.","54":"A tight action side-scroller with challenging robotic bosses. Dodge metallic dangers, acquire powerful weapons and blast your way through a destroyed world full of deadly machines where running out of energy means defeat.","55":"Terrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next.  As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom.  Will you live to see the light of day?","56":"Inabaa quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\n\nA coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one's self. \n\nWith an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.\n\nKey Features include:\n\n* Enjoy gameplay with variable framerates\n* Experience the world of Persona on PC in Full HD\n* Steam Achievements and Trading Cards\n* Choose between Japanese and English VO","57":"Tortuga - a Pirate's Tale tells the journey of a pirate captain with a lust for gold and glory who assumes command of a fleet of pirate ships to strike the Caribbean.\n\nCustomize your own Flag under which your fleet will sail. As you gain experience, your notoriety and skills will improve. Roleplay with more than 35 distinct pirate's skills on your way to claim your pirate throne.\n\nFight in tactical turn-based naval battles on a hexagonal grid of epic proportions. Use your wits when raiding a convoy or a settlement. Victory is determined by a clever combination of your ship's distinct armament with the varying and rough conditions of the sea.","58":"It is the 23rd century. EDEN, the massive virtual reality network witch helped humankind to flourish, suddenly severed all contact with the outside world...Leaving the minds of its 100 million users trapped inside.\n\nA covert special task force known as \"Saviours\" has been called in to address the situation. Using special attack programs modeled after fighter jets, they plan to delve into the deepest cores of EDEN and find who or what has set it haywire.\n\nA refreshing and highly re-playable bullet hell style shooter that WANTS you to play dangerously! Ride the razor's edge of life and death in this high-risk high-reward danger oriented arcade style shooting game.","59":"A Space For The Unbound is a slice-of-life adventure game with beautiful pixel art set in the late 90s rural Indonesia that tells a story about overcoming anxiety, depression, and the relationship between a boy and a girl with supernatural powers.\n\nFollow two high school sweethearts, Atma and Raya, on a journey of self-discovery at the end of their high school years. When a mysteriously supernatural power is suddenly unleashed threatening their existence, they must explore and investigate their town to uncover hidden secrets, face the end of the world, and perhaps learn more about each other.","60":"Protect space against the last wave of an enemy that used to be mankind's ally: a mysterious intelligent artificial life form. Take control of enhanced trainee pilot Aya, or the mysterious veteran pilot Zarak and fight your way through waves of enemies in order to save mankind and to learn more about yourself and also about your enemy.\n\nWings Of Bluestar is a horizontal hand painted and frame by frame animated HD game, no photobashing, 3D nor pre-rendered assets are used. Every asset is hand crafted and detailed by the same artist, which gives the game its visual integrity.","61":"In RE:CALL you play through the memories of the character you're controlling. Your actions inside these flashbacks have immediate consequences in the present moment, letting you take advantage of the situation in order to progress the story.\n\nSolve mysteries by manipulating your memory. Escape a factory, solve a crime, and win the hearts and minds of your enemies by changing the past.\n\nInvestigate and solve the mystery of your mysterious power. Who is behind this?","62":"Mrs.Cat Between Worlds is set in cute and deadly fantasy versions of the planets Mars and Neptune.\n\nIn this 2D precision platformer series, you have to master the skill of jumping with different amounts of gravity, as well as other special space cat movement techniques.\n\nYou'll need to avoid dangers, collect shiny energy gems, and ultimately make it to the exit to warp to the next level.","63":"UnderDungeon is a peculiar adventure based on the classic dungeon crawlers. Our protagonist, Kimuto, will have to face the harsh world of work on his first day on the job.\n\nWith the enigmatic appearance of the monsters, the lives of the residents of Kutopia have radically changed. The famous \"Heroes\" have emerged who try to hunt down these creatures, some have created communities to try to resist them, and others try to survive as best they can.\n\nBe careful, doing your job will not be easy.","64":"Welcome to the next part of Ballotron! You also shoot balls but everything happens underwater.\n\nMake the Blue Ball hit the Green Ball to achieve the goal. Shoot Small Balls to hit Large Balls and Bubble Blocks.\n\nThis time the level solutions will be even more fun!\n\nGet Stars and special Golden Coins to achieve the highest results.","65":"NEScape combines the look and feel of an authentic 8-Bit Legit retro game with the modern-day element of escape rooms.\n\nIt's you against the clock in an intense race to escape the room before time runs out!\n\nDo you have the mental fortitude to assemble the clues and connect the dots so that you might overcome the challenges and see what lies on the other side of the door?\n\nBeing able to track your success by seeing the room change over time adds a unique experience to escape room games.\n\nWill you escape in NEScape?","66":"In the dead of night a fierce storm rages across North Wales. Miles from any town, Chris Selwood seeks refuge in a remote roadside cafe. Shortly thereafter Chris experiences a horrific sight as he finds the cafe waitress pinned to the ceiling by something with fierce glowing eyes, he passes out waking up to the dusty old abandoned remains of the café.\n\nExplore the untouched wilderness of rural Wales as you uncover the forgotten remains of a mysterious facility and try to piece together what happened to the missing villagers of Hearth.\n\nInspired by 80s Sci-Fi horror and contemporary surrealist cinema, Chasing Static delivers a unique take on the narrative adventure genre through new audio driven gameplay mechanics and non-linear exploration.","67":"Breakers Collection features both of the original games (Breakers and Breakers Revenge) and a brand new content for the cult-classic among the fans of Fighting Games, that was first released in 1996 for the Neogeo and Arcades and after released with a sequel in 1998 with additional playable characters, balance adjustments and new gameplay elements.\n\nBreakers Collection is a simple action-fighting game, with a rooster with many playable characters (10 in Breakers Revenge), that were all known by the fans from around the world.\n\nThe collection version, the player will have more features and modes, like online versus mode - Rollback Netcode (GGPO) -, Art gallery and the most requested one, the training mode.","68":"Congrats on becoming the newest hire of Salamander County's public TV station! Unfortunately, everyone in the county suddenly disappeared, except for you, your boss, and another employee. The show must go on, so with your new job title of Professional Thing-Doer, it's up to you to do all of the activities that need to be filmed for the TV station. \n\nYou should probably try and figure out why everyone disappeared in the first place, too.","69":"The shooter of riding the dragon's back! Master the techniques of the dragon and magic shot!\n\nDragon Blaze is a vertical-scrolling shooter game that first appeared in arcades in 2000.\n\nThe heroes are the four dragon riders.\n\nThey can use normal shots, bombs and magic shots (press and hold the button). In addition, they can also use the Dragon Shot.\n\nYou'll be surprised by the bosses attacks , transforming animations and background art depicting an eerie and beautiful world.","70":"Shoot back the enemy bullets! The breakout-like shooter with a variety of items and gimmicks!\n\nGUNBARICH is a breakout-like shooter game that first appeared in arcades in 2001.\n\nControl the flipper and shoot the pink ball = puck to break all the blocks to clear the stage.\n\nYou can set the difficulty level, life, number of continues, controls, screen orientation, item dropping speed, enemy bullet speed, and more.\n\nIn addition, now we have online rankings!\n\nBe the world's best GUNBARICH!","71":"Zero Gunner 2 is a top-down shooter game that first appeared in arcades in 2001.\n\nThe planes are three attack helicopters. They can use automatic normal shot, sub-shot and Drone Attack.\n\nThe Drone Attack consumes energy and deals heavy damage to the enemy.\n\nThis shooter has an important system of Turn Marker. The Turn Marker become the axis of the plane's change of direction when installed.\n\nMaster the Turn Marker system and prepare for attacks from all sides!","72":"This is a progressive puzzle which you can comfortably enjoy working out using logic. \n\n\"Heyawake\" is a puzzle in which you fill in the spaces according to the rules. It's called \"heyawake\" (\"split rooms\") because the face of the board is divided into rooms. This puzzle first appeared in 1992, but a plethora of solutions have been developed, allowing for a very progressive puzzle.\n\nEach time you discover a new strategic move, your skills of solution will improve.","73":"Accompany Lucy and her friends in this grim, beautifully hand-drawn adventure game. Lucy is afraid of the forest, just like any other child: every night, the echoing roars rob her of her sleep. Not even her dreams are a safe place where she could play. People disappearing is nothing uncommon in the village, but this time, Lucy is old enough to investigate on her own. Or so she thinks. Children of Silentown is a point &amp; click adventure game telling a mysterious and endearing story. Explore the town and its dangerous surroundings, meet its quirky inhabitants, solve puzzles and master minigames. Accompany Lucy on her adventure to get to the bottom of what is haunting the strange Silentown... if you dare.","74":"You are a nameless android tasked with restoring Station 3. Where are all the humans? What is your real purpose? What are these giant statues? The only way to know is to head into the dark wild.\n\nAtrio is a survival game set in a cyberpunk inspired post-apocalyptic world. Bend nature to your will by capturing and exploiting the creatures and environment to help you survive at all costs. The many threats and challenges you will face are too difficult to handle on your own, you must build, automate and optimize your systems to keep the world at bay to stay alive.","75":"We Are The Caretakers is an afrofuturist squad management RPG. \n\nAssemble an arcane team of protectors in squad-building systems inspired by Darkest Dungeon, Ogre Battle, and XCOM. \n\nDefend the endangered animals your world relies on in strategic turn-based combat.\n\nDefine your approach to a global resistance by balancing your reputation, funds, research, animals and alliances. \n\nWe Are The Caretakers is a challenging strategy RPG fusion that asks you to protect a planet by fighting for the people, animals and ecosystems that inhabit it.","76":"Neon Souls is a Fast-paced Splatformer where platforms are invisible and you have to paint them. Walk, Jump, Double Jump, Slide and Wall Jump to paint everything, A vast amount of difficult levels for you challenge and powerful bosses to beat.","77":"The end of the world just started and everyone is gone. The machines took over and your only goal is to look for your missing sister in a retro wave atmosphere. Fight and find your way into the danger with your shield in this vibrant pixel art world.\n\nThe Remix Edition adds a lot of new content: A revised and more in-depth story, balance and quality of life improvements, new levels and gameplay features remixing Shieldmaiden with the help of your feedback to get the game that much closer to our vision.","78":"This narrative experience introduces Steve Robinson, a successful writer who, due to life's misfortunes, ended up losing important people, faith in his work and the meaning of life. The narrative leads the player to help Steve relive the episodes in his story that dragged him into depression, while getting to know the places that marked his life. From that moment, where Steve may or may not revisit his story, he becomes able to face his destiny and be able to make the most important decision of his life.\n\nOne Step After Fall is a single-player, first-person walking simulator that focuses on the narrative experience.","79":"","80":"Space Raiders in Space is a wave defense roguelike based around 5 orders: Attack, Defend, Cower, Search, and Build. Command your almost competent crew to loot weapons and supplies, build defenses, and fight their way through the Bugpocalypse.\n\nHave your raiders scavenge materials from their surroundings and use them to design and build elaborate fortifications, hopefully keeping your crew a safe distance from the bugs' sharp and stabby parts. With over a dozen defensives, there are many build strategies to explore.\n\nYour crew is armed with enthusiasm and a bunch of weapons (assuming you have been looting), but not much intelligence. Issue commands to individuals or the group as a whole, then hope they know how to follow instructions. It's up to you to tell them when to search, what to build, how to fight, and more. Or else they'll all die horribly violent deaths, Probably that second thing.","81":"Fluffy Horde is a 2D side-scrolling hybrid between real-time strategy and tower defense. The game revolves around a magical hyper-breeding bunny horde created by a misunderstood Shaman wanderer. \n\nAfter having a dwelling denied in all three kingdoms, the Shaman is willing to take over all of them by force. Can you stop the Fluffy Horde?","82":"Once upon a time, in a Far Away Land, an Evil Dragon took prisoner every royal heir he could meet. Lots of worthy suitors of every kingdom tried to face the beast, without success. Now it's your turn! You'll have to do your best to beat the dungeon, defeat the dragon, and manage the most perfect date!\n\nA charming 3D roguelite platformer about a normal day in the life of a knight! Sharpen the spear and make the Dragon run in fear! Oh, and also try to manage a date with princesses &amp; princes you rescue.","83":"8-Ball Pocket brings you eight-ball pool, also known as American billiards. You can compete with up to 4 friends or against the AI in Versus mode, or challenge the best in the world in Arcade mode, where you can make combo shots and rack up points to become Number 1 in the online ranking. All of this comes in a setting with great graphics and Jazz music.","84":"A light shines from the depths of the earth; heavenly spirits and earthly fiends arise. The blood of the people runs cold, and heroes tremble in fear. Vengeful forces seek to destroy the heroic outlaws of Mount Liang. A tale of immortal deeds now begins, let all listen and take heed.\n\nWater Margin - Tale of Clouds and Wind for Genesis is a beat'em up game with lots of action and hours of gameplay. Choose between 3 outlaw heroes and help them battle through oppressing armies of evil men.\n\nWater Margin features several different alternate endings depending the character and the difficulty you play the game through. It features different power ups and colorful 16 bit graphics. You can play two players simultaneously or pass through the game solo.\n\nThis game was original release in Hong Kong during the mid 90s. It has now been fully translated for English speaking players.","85":"Hyper Gunsport is cyberpunk volleyball with guns - it's all about that hot arcade action! You can play 2v2 or 1v1, with a co-op and single player circuit mode as well. Each of the 7 teams has a light story, unique weapons, and a stage with its own gimmick.\n\nAs you progress, new rulesets change the game, and there's an unlockable AI mode as well. This is a hardcore action game, but we are hardcore about our accessibility options too, ensuring the game is playable by anyone.\n\nHyper Gunsport is arcade action with fighting game vibes, a pulsing soundtrack, a unique cast of characters, a host of trophies, and unlockables to discover.","86":"Christmas. Christmas never changes. \n\nSoon those overzealous little freaks will swarm the city led by that bearded maniac. But this time, we fight back.\n\nInspired by Zombies Ate My Neighbors and Beavis&amp;Butthead's heavy metal comedy, this is twin-stick mayhem like you've never experienced before.","87":"","88":"","89":"Heave! Fake the bull rope and stay the mizzen royal! Command a fleet of custom-rigged sailing ships on a procedurally crafted adventure over an unending ocean whose ancient depths have swallowed the key to a planet's mysterious past. \n\nPut the wind to your back and cast out into High Adventure over a vast ocean spanning numerous unique regions, each packed to bursting with its own flora, fauna, and ambient music.\n\nMake chase with a pod of curious dolphins, watch the sun sink into an icy horizon, run down a clutch of cowardly privateers and accept their apologies to the tune of wild cannonry.\n\nStay engaged with a replayable rogue-lite experience whose narrative is revealed through free exploration in an ocean-world of ever-changing discovery.\n\nOn the Deepblue, opportunity is in every direction, and sinking your ship is just the start of another adventure!","90":"Your best friend wants to cheer you up, so he tries his best to make a dungeon for you to explore. Explore his wholesome, weird-as-heck, scrappy rogue-lite oozing with charm and humor for 1-2 Players.\n\nWally and the FANTASTIC PREDATORS is a perma-death rogue-lite where you play as Wally, a predatory fox who is attacking defenseless animals in their own homes and taking all their money. During your decent you also get to experience verbal abuse from various NPCs, but it's okay because you can hug the backpack guy and that's fantastic.","91":"Wave Break is the world's first skateBOATING game, inspired by arcade skateboarding classics. Grind, grab, kickflip and shoot your way through an explosive 80s crime-filled Miami Vice themed world.\n\nEnjoy an episodic single player campaign, ranked online multiplayer, multiple custom game modes, and an advanced park creator. From tropical beaches to frozen tundras, ride the waves and score the world's biggest combo with style.","92":"Participate in the extraction of large-scale marine facilities from the bottom of the sea, in the transport and assembly of large offshore installations, as well as in rescue and transport missions.\n\nIn a special game mode, you will take direct control of crew members and appropriate accessories (e.g. fire extinguishers, fire hoses, water cannons, inflatable boats, searchlights) to defend the ship against pirate attacks, put out a fire or pick out survivors.","93":"Project SNAQE is an action and precision game inspired by the classic Snake, where the objective is maximizing the amount of cargo in your wagons, collecting minerals scattered throughout the map.\n\nDon't be scared when you come across explosive rocks, giant worms, or oversized moles, count on your ability to shoot projectiles and perform precise maneuvers to overcome the various obstacles that appear during the game.\n\nThe game has 3 different modes with progressive difficulty levels, in addition to the classic mode that remounts the traditional Snake gameplay. Project SNAQE promises a great experience for all types of gamers, from casual to hardcore, also featuring several achievements and a global ranking system.\n\nA simple game at first glance, Project SNAQE is charming and challenging and will put to the test your reflexes, reasoning, and skills to find solutions.","94":"Texas is the first drop in the Season 1 Pass, available separately or as part of Them’s Fightin’ Herds: Deluxe Edition for $39.99.","95":"Dive into the world of beautiful hand drawn game with unusual and funny beings all around. You will have to spot all the silly characters cleverly hidden in the doodle maps.\n\nWith several different levels, each will unlock when you have collected the points required. The Levels will be incrementally hard by restricting your time to collect everything and more silly characters to find.","96":"In a world where battles over Energi, the life energy have broken out, a young man with no memory meets a princess whose kingdom has been destroyed.\n\nThe gears of fate begin to move little by little in this truly classic fantasy story... Cut a way through the path of despair with allies!\n\nUse up to three styles for each character in turn-based battles to get benefits from recovery to fighting styles. Increase Energi levels by raising multiple elementals unique to the Alphadia series and learn new skills.\n\nAlphadia Neo also features an original fishing system where you can fish in various points to get fish exchangeable with powerful items or equipment!","97":"In Aery - Path of Corruption you play as a bird-like spirit and fly through the thoughts and different scenarios of the decision-making process of the protagonist.\n\nWithin the world, each level represents a different path that the protagonist could take and your task is to discover the different paths, find their possible outcomes, and help find a good future for the unknown protagonist.\n\nWithin this imaginary world, you have to find a certain amount of memory shards to advance with the story and unlock more possible paths into the future. Once you have found all memory shards you are free to explore the next paths.","98":"","99":"A logic puzzle game, Reky marries an elegance of design with an architectural minimalist aesthetic to create an experience that is fresh, stylish and satisfyingly challenging.\n\nThe player interacts with the different puzzle elements of each level, shifting and moving them in order to create a path to the goal.\n\nEverything in the game is simple and functional, with only cubes, lines, exits, portals and a dash of colour used to create a large variety of brain-teasing challenges.","100":"Panda Punch is a puzzle platformer game in which you have to control a red panda and save the world from evil alien robots.\n\nSolve puzzles on the levels, collect coins, look for super coins, pump your abilities from the blacksmith.\n\nDefeat bosses, get new abilities."},"Link":{"1":"www.metacritic.com\/game\/xbox-one\/peachy-boy","2":"www.metacritic.com\/game\/xbox-one\/the-redress-of-mira","3":"www.metacritic.com\/game\/xbox-one\/prizma-puzzle-prime","4":"www.metacritic.com\/game\/xbox-one\/cube-farmer","5":"www.metacritic.com\/game\/xbox-one\/puzzle-by-nikoli-w-hashiwokakero","6":"www.metacritic.com\/game\/xbox-one\/prison-tycoon-under-new-management","7":"www.metacritic.com\/game\/xbox-one\/heirs-of-the-kings","8":"www.metacritic.com\/game\/xbox-one\/speedway-racing","9":"www.metacritic.com\/game\/xbox-one\/escape-2088","10":"www.metacritic.com\/game\/xbox-one\/debtor-enhanced-edition","11":"www.metacritic.com\/game\/xbox-one\/pets-at-work","12":"www.metacritic.com\/game\/xbox-one\/metal-black-s-tribute","13":"www.metacritic.com\/game\/xbox-one\/puzzle-bobble-2x-bust-a-move-2-arcade-edition-puzzle-bobble-3-bust-a-move-3-s-tribute","14":"www.metacritic.com\/game\/xbox-one\/deliver-us-mars","15":"www.metacritic.com\/game\/xbox-one\/the-pathless","16":"www.metacritic.com\/game\/xbox-one\/exitman-deluxe","17":"www.metacritic.com\/game\/xbox-one\/fashion-police-squad","18":"www.metacritic.com\/game\/xbox-one\/dogurai","19":"www.metacritic.com\/game\/xbox-one\/kattish","20":"www.metacritic.com\/game\/xbox-one\/reactorx-2","21":"www.metacritic.com\/game\/xbox-one\/albacete-warrior","22":"www.metacritic.com\/game\/xbox-one\/rhythm-sprout","23":"www.metacritic.com\/game\/xbox-one\/inkulinati","24":"www.metacritic.com\/game\/xbox-one\/raiden-iv-x-mikado-remix","25":"www.metacritic.com\/game\/xbox-one\/we-were-here-forever","26":"www.metacritic.com\/game\/xbox-one\/age-of-empires-ii-definitive-edition","27":"www.metacritic.com\/game\/xbox-one\/powerwash-simulator-tomb-raider-special-pack","28":"www.metacritic.com\/game\/xbox-one\/spongebob-squarepants-the-cosmic-shake","29":"www.metacritic.com\/game\/xbox-one\/roboquest","30":"www.metacritic.com\/game\/xbox-one\/backfirewall_","31":"www.metacritic.com\/game\/xbox-one\/stranger-of-paradise-final-fantasy-origin---different-future","32":"www.metacritic.com\/game\/xbox-one\/wonderland-nights-white-rabbits-diary","33":"www.metacritic.com\/game\/xbox-one\/memory-link","34":"www.metacritic.com\/game\/xbox-one\/goldeneye-007","35":"www.metacritic.com\/game\/xbox-one\/dance-of-death-du-lac-fey","36":"www.metacritic.com\/game\/xbox-one\/startup-company-console-edition","37":"www.metacritic.com\/game\/xbox-one\/shoulders-of-giants","38":"www.metacritic.com\/game\/xbox-one\/mechwarrior-5-mercenaries---rise-of-rasalhague","39":"www.metacritic.com\/game\/xbox-one\/the-table-game-deluxe-pack","40":"www.metacritic.com\/game\/xbox-one\/oddballers","41":"www.metacritic.com\/game\/xbox-one\/cat-slide-tiles","42":"www.metacritic.com\/game\/xbox-one\/transiruby","43":"www.metacritic.com\/game\/xbox-one\/the-dark-side-of-the-moon-an-interactive-fmv-thriller","44":"www.metacritic.com\/game\/xbox-one\/sissas-path","45":"www.metacritic.com\/game\/xbox-one\/loblocks","46":"www.metacritic.com\/game\/xbox-one\/kingdom-rush","47":"www.metacritic.com\/game\/xbox-one\/clunky-hero","48":"www.metacritic.com\/game\/xbox-one\/risen","49":"www.metacritic.com\/game\/xbox-one\/hunt-ducks-4","50":"www.metacritic.com\/game\/xbox-one\/monster-hunter-rise","51":"www.metacritic.com\/game\/xbox-one\/deep-space-anomaly","52":"www.metacritic.com\/game\/xbox-one\/demon-hunter-new-chapter","53":"www.metacritic.com\/game\/xbox-one\/trenches","54":"www.metacritic.com\/game\/xbox-one\/omegabot","55":"www.metacritic.com\/game\/xbox-one\/persona-3-portable","56":"www.metacritic.com\/game\/xbox-one\/persona-4-golden","57":"www.metacritic.com\/game\/xbox-one\/tortuga---a-pirates-tale","58":"www.metacritic.com\/game\/xbox-one\/graze-counter-gm","59":"www.metacritic.com\/game\/xbox-one\/a-space-for-the-unbound","60":"www.metacritic.com\/game\/xbox-one\/wings-of-bluestar","61":"www.metacritic.com\/game\/xbox-one\/recall","62":"www.metacritic.com\/game\/xbox-one\/mrscat-between-worlds","63":"www.metacritic.com\/game\/xbox-one\/underdungeon","64":"www.metacritic.com\/game\/xbox-one\/ballotron-oceans","65":"www.metacritic.com\/game\/xbox-one\/nescape!","66":"www.metacritic.com\/game\/xbox-one\/chasing-static","67":"www.metacritic.com\/game\/xbox-one\/breakers-collection","68":"www.metacritic.com\/game\/xbox-one\/salamander-county-public-television","69":"www.metacritic.com\/game\/xbox-one\/dragon-blaze","70":"www.metacritic.com\/game\/xbox-one\/gunbarich","71":"www.metacritic.com\/game\/xbox-one\/zero-gunner-2","72":"www.metacritic.com\/game\/xbox-one\/puzzle-by-nikoli-w-heyawake","73":"www.metacritic.com\/game\/xbox-one\/children-of-silentown","74":"www.metacritic.com\/game\/xbox-one\/atrio-the-dark-wild","75":"www.metacritic.com\/game\/xbox-one\/we-are-the-caretakers","76":"www.metacritic.com\/game\/xbox-one\/neon-souls","77":"www.metacritic.com\/game\/xbox-one\/shieldmaiden-remix-edition","78":"www.metacritic.com\/game\/xbox-one\/one-step-after-fall","79":"www.metacritic.com\/game\/xbox-one\/joy-ball-adventure","80":"www.metacritic.com\/game\/xbox-one\/space-raiders-in-space","81":"www.metacritic.com\/game\/xbox-one\/fluffy-horde","82":"www.metacritic.com\/game\/xbox-one\/tower-princess","83":"www.metacritic.com\/game\/xbox-one\/8-ball-pocket","84":"www.metacritic.com\/game\/xbox-one\/the-tale-of-clouds-and-wind-qubyte-classics","85":"www.metacritic.com\/game\/xbox-one\/hyper-gunsport","86":"www.metacritic.com\/game\/xbox-one\/headbangers-in-holiday-hell","87":"www.metacritic.com\/game\/xbox-one\/crossovers-by-powgi","88":"www.metacritic.com\/game\/xbox-one\/space-accident","89":"www.metacritic.com\/game\/xbox-one\/sail-forth","90":"www.metacritic.com\/game\/xbox-one\/wally-and-the-fantastic-predators","91":"www.metacritic.com\/game\/xbox-one\/wave-break","92":"www.metacritic.com\/game\/xbox-one\/ships","93":"www.metacritic.com\/game\/xbox-one\/project-snaqe","94":"www.metacritic.com\/game\/xbox-one\/thems-fightin-herds---additional-character-1-texas","95":"www.metacritic.com\/game\/xbox-one\/its-kooky","96":"www.metacritic.com\/game\/xbox-one\/alphadia-neo","97":"www.metacritic.com\/game\/xbox-one\/aery---path-of-corruption","98":"www.metacritic.com\/game\/xbox-one\/retro-tank-arcade","99":"www.metacritic.com\/game\/xbox-one\/reky","100":"www.metacritic.com\/game\/xbox-one\/panda-punch"},"Release":{"1":"February 8, 2023","2":"February 8, 2023","3":"February 8, 2023","4":"February 8, 2023","5":"February 8, 2023","6":"February 7, 2023","7":"February 3, 2023","8":"February 3, 2023","9":"February 3, 2023","10":"February 3, 2023","11":"February 3, 2023","12":"February 2, 2023","13":"February 2, 2023","14":"February 2, 2023","15":"February 2, 2023","16":"February 2, 2023","17":"February 2, 2023","18":"February 2, 2023","19":"February 2, 2023","20":"February 1, 2023","21":"February 1, 2023","22":"February 1, 2023","23":"January 31, 2023","24":"January 31, 2023","25":"January 31, 2023","26":"January 31, 2023","27":"January 31, 2023","28":"January 31, 2023","29":"January 30, 2023","30":"January 30, 2023","31":"January 27, 2023","32":"January 27, 2023","33":"January 27, 2023","34":"January 27, 2023","35":"January 27, 2023","36":"January 26, 2023","37":"January 26, 2023","38":"January 26, 2023","39":"January 26, 2023","40":"January 26, 2023","41":"January 26, 2023","42":"January 26, 2023","43":"January 25, 2023","44":"January 25, 2023","45":"January 25, 2023","46":"January 25, 2023","47":"January 25, 2023","48":"January 24, 2023","49":"January 22, 2023","50":"January 20, 2023","51":"January 20, 2023","52":"January 20, 2023","53":"January 20, 2023","54":"January 20, 2023","55":"January 19, 2023","56":"January 19, 2023","57":"January 19, 2023","58":"January 19, 2023","59":"January 19, 2023","60":"January 18, 2023","61":"January 17, 2023","62":"January 17, 2023","63":"January 13, 2023","64":"January 13, 2023","65":"January 13, 2023","66":"January 12, 2023","67":"January 12, 2023","68":"January 12, 2023","69":"January 11, 2023","70":"January 11, 2023","71":"January 11, 2023","72":"January 11, 2023","73":"January 11, 2023","74":"January 10, 2023","75":"January 6, 2023","76":"January 6, 2023","77":"January 5, 2023","78":"January 5, 2023","79":"January 3, 2023","80":"December 30, 2022","81":"December 23, 2022","82":"December 23, 2022","83":"December 23, 2022","84":"December 22, 2022","85":"December 22, 2022","86":"December 21, 2022","87":"December 21, 2022","88":"December 21, 2022","89":"December 21, 2022","90":"December 21, 2022","91":"December 21, 2022","92":"December 21, 2022","93":"December 20, 2022","94":"December 19, 2022","95":"December 16, 2022","96":"December 16, 2022","97":"December 16, 2022","98":"December 16, 2022","99":"December 16, 2022","100":"December 16, 2022"}}